<?php


defined('BASEPATH') OR exit('No direct script access allowed');

class Home extends CI_Controller {

    
    public function __construct()
    {
        parent::__construct();
        $this->load->model('Main_model');
        //Do your magic here
        if(!$this->session->userdata('admintoafl')){
            $this->session->set_flashdata('pesan', '
                <div class="alert alert-important alert-danger alert-dismissible" role="alert">
                    <div class="d-flex">
                        <div>
                            <svg width="24" height="24" class="alert-icon">
                                <use xlink:href="'.base_url().'assets/tabler-icons-1.39.1/tabler-sprite.svg#tabler-alert-circle" />
                            </svg>
                        </div>
                        <div>
                            Anda harus login terlebih dahulu
                        </div>
                    </div>
                    <a class="btn-close btn-close-white" data-bs-dismiss="alert" aria-label="close"></a>
                </div>
            ');

			redirect(base_url("auth"));
		}
    }

    public function index(){
        // navbar and sidebar
        $data['menu'] = "Dashboard";

        // for title and header 
        $data['title'] = "Dashboard";

        // javascript 
        $data['js'] = [
            "modules/other.js",
            "load_data/reload_home.js",
        ];
        
        $data['soal'] = COUNT($this->Main_model->get_all("soal", ["hapus" => 0]));
        $data['tes'] = COUNT($this->Main_model->get_all("tes", ["hapus" => 0]));
        $data['peserta'] = COUNT($this->Main_model->get_all("peserta"));

        $this->load->view("pages/index", $data);
    }

    public function get_dashboard(){
        $data['soal'] = COUNT($this->Main_model->get_all("soal", ["hapus" => 0]));
        $data['tes'] = COUNT($this->Main_model->get_all("tes", ["hapus" => 0]));
        $data['peserta'] = COUNT($this->Main_model->get_all("peserta"));

        echo json_encode($data);
    }

    public function listening(){
        $istima = $this->get_soal_qiroahv3();

        $i = 1;
        foreach ($istima as $soal) {
            $id_soal = 1;
            // $soal = $this->Main_model->get_one("soal", ["id_soal" => $id_soal]);

            $item = $this->Main_model->get_one("item_soal", ["id_soal" => $id_soal], "urutan", "DESC");
            if($item) {
                $urutan = $item['urutan'] + 1;
            } else {
                $urutan = 1;
            }

            if($soal['tipe'] == "soal"){
                $data_soal = "{no}".$soal['data']['soal']."###".$soal['data']['pilihan'][0]."///".$soal['data']['pilihan'][1]."///".$soal['data']['pilihan'][2]."///".$soal['data']['pilihan'][3]."###".$soal['data']['jawaban'];
    
                $data = [
                    "id_soal" => $id_soal,
                    "tipe_soal" => "Reading",
                    "item" => $soal['tipe'],
                    "data" => $data_soal,
                    "penulisan" => "RTL",
                    "urutan" => $urutan,
                ];
            } else {
                $data = [
                    "id_soal" => $id_soal,
                    "tipe_soal" => "Reading",
                    "item" => $soal['tipe'],
                    "data" => $soal['data'],
                    "penulisan" => "RTL",
                    "urutan" => $urutan,
                ];
            }

            $query = $this->Main_model->add_data("item_soal", $data);
            if($query){
                echo json_encode(1);
            } else {
                echo json_encode(0);
            }
        }
    }
    public function get_soal_istimav3(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center><b>إختبار  اللغة العربية لغير الناطقين بها</b></center></p>
                    <p><center><b>القسم الأول : فهم المسموع</b></center></p>
                    <p>في هذا القسم 50 سؤالا تتكون من ثلاثة أنواع : التعبيرات، و الحوارات، و الفقرات:</p>
                    <p>للإجابة عن الأسئلة من رقم واحد إلى رقم خمسة وعشرين، استمع إلى التعبيرات ثم اختر أنسب جواب بعد كل تعبير :</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 1-5.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "1",
                    "soal" => "",
                    "pilihan" => [
                        "هو يركب الدراجة النارية للذهاب إلى الجامعة",
                        "الدراجة النارية في الجامعة",
                        "هو لا يحب الدراجة النارية",
                        "هو لا يذهب بالدراجة النارية",
                    ],
                    "jawaban" => "هو يركب الدراجة النارية للذهاب إلى الجامعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "2",
                    "soal" => "",
                    "pilihan" => [
                        "الصياد يسترحون",
                        "الصياد لا يسترحون",
                        "الصياد لا يريدون أن يصيدوا الأسماك",
                        "الأسماك غير موجودة في البحر",
                    ],
                    "jawaban" => "الصياد يسترحون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "3",
                    "soal" => "",
                    "pilihan" => [
                        "إنها قوية",
                        "إنها لطيفة",
                        "إنها ضعيفة",
                        " إنها صابرة",
                    ],
                    "jawaban" => "إنها قوية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "4",
                    "soal" => "",
                    "pilihan" => [
                        "الطبيب",
                        "الصديق",
                        "الأب",
                        "المدرّس",
                    ],
                    "jawaban" => "المدرّس",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "5",
                    "soal" => "",
                    "pilihan" => [
                        "هو يريد الأفلام",
                        "هو يشاهد الأفلام",
                        "هو يريد أن يشاهد الأفلام مع صديقه",
                        "هو يريد يشاهد الأفلام",
                    ],
                    "jawaban" => "هو يريد أن يشاهد الأفلام مع صديقه",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 6-10.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "6",
                    "soal" => "",
                    "pilihan" => [
                        "بعد صلاة الصبح",
                        "بعد صلاة العصر",
                        "بعد صلاة المغرب",
                        "بعد صلاة العشاء",
                    ],
                    "jawaban" => "بعد صلاة العشاء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "7",
                    "soal" => "",
                    "pilihan" => [
                        "في الساعة الواحدة",
                        "في الساعة الثانية",
                        "في الساعة الثالثة",
                        "في الساعة الرابعة",
                    ],
                    "jawaban" => "في الساعة الرابعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "8",
                    "soal" => "",
                    "pilihan" => [
                        "أهمية النية",
                        "أقسام النية",
                        "النية وترتيبها",
                        "فوائد النية",
                    ],
                    "jawaban" => "أهمية النية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "9",
                    "soal" => "",
                    "pilihan" => [
                        "كريم الأخلاق جزء من سعادة الناس",
                        "سعادة الناس جزء من كريم الأخلاق",
                        "سعادة الناس بدون الأخلاق",
                        "الأخلاق الكريمة السعيدة",
                    ],
                    "jawaban" => "كريم الأخلاق جزء من سعادة الناس",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "10",
                    "soal" => "",
                    "pilihan" => [
                        "في المطعم",
                        "في الفصل",
                        "في المستشفى",
                        "في المكتبة",
                    ],
                    "jawaban" => "في المستشفى",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 11-15.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "11",
                    "soal" => "",
                    "pilihan" => [
                        "ثلاثون جزءا",
                        "خمسة عشر جزءا",
                        "خمسة أجزاء",
                        "جزءا واحدا",
                    ],
                    "jawaban" => "خمسة عشر جزءا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "12",
                    "soal" => "",
                    "pilihan" => [
                        "ثلاثة أقلام",
                        "قلما واحدا",
                        "ستة أقلام",
                        "قلمين",
                    ],
                    "jawaban" => "ستة أقلام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "13",
                    "soal" => "",
                    "pilihan" => [
                        "لم أحضر لأني لدي أمر مهم في البيت",
                        "أنا لم أحضر إلى السوق",
                        "السوق بعيد من بيتي",
                        "لا، هو لا يريد أن يذهب إلى السوق",
                    ],
                    "jawaban" => "لم أحضر لأني لدي أمر مهم في البيت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "14",
                    "soal" => "",
                    "pilihan" => [
                        "معالجة المرضى",
                        "مرافقة المرضى",
                        "نهي المرضى",
                        "ضرب المرضى",
                    ],
                    "jawaban" => "معالجة المرضى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "15",
                    "soal" => "",
                    "pilihan" => [
                        "الأستاذ الطلاب أن يتكاسل",
                        "الأستاذ الطلاب أن لا يتكاسل",
                        "الأستاذ كسلان",
                        "الأستاذ لا يتكاسل",
                    ],
                    "jawaban" => "الأستاذ الطلاب أن يتكاسل",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 16-20.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "16",
                    "soal" => "",
                    "pilihan" => [
                        "سنة واحدة",
                        "ثلاث سنوات",
                        "خمس سنوات",
                        "ست سنوات",
                    ],
                    "jawaban" => "ست سنوات",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "17",
                    "soal" => "",
                    "pilihan" => [
                        "اللغة العربية في العصر العباسي",
                        "اللغة العربية لغة عالمية",
                        "الحضارة الإسلامية",
                        "أهمية اللغة العربية",
                    ],
                    "jawaban" => "اللغة العربية لغة عالمية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "18",
                    "soal" => "",
                    "pilihan" => [
                        "هو يشتري كتابا جديدا",
                        "هو لا يشتري كتابا",
                        "هو يشتري كتابا واحدا",
                        "هو يشتري كتابا بالفلوس",
                    ],
                    "jawaban" => "هو لا يشتري كتابا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "19",
                    "soal" => "",
                    "pilihan" => [
                        "في شهر مارس",
                        "في شهر فبراير",
                        "في شهر ديسمبر",
                        "في شهر يناير",
                    ],
                    "jawaban" => "في شهر يناير",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "20",
                    "soal" => "",
                    "pilihan" => [
                        "تجوز المرأة العمل كالرجال",
                        "لا تجوز المرأة العمل خارج بيتها",
                        "لا تجوز المرأة الخروج من بيتها",
                        "تجوز المرأة العمل كالرجال لكن بشرط",
                    ],
                    "jawaban" => "لا تجوز المرأة الخروج من بيتها",
                ]
            ],
            [
                "tipe" => "audio",
                "data" => "v3 21-25.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "21",
                    "soal" => "",
                    "pilihan" => [
                        "الأم",
                        "الأب",
                        "الإبن",
                        "العم",
                    ],
                    "jawaban" => "الإبن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "22",
                    "soal" => "",
                    "pilihan" => [
                        "هو طبيب كريم",
                        "هو أستاذ كريم",
                        "هو تاجر غني",
                        "هو عامل كريم",
                    ],
                    "jawaban" => "هو طبيب كريم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "23",
                    "soal" => "",
                    "pilihan" => [
                        "يوما واحدا",
                        "عشرين يوما",
                        "ثلاثين يوما",
                        "خمسة وعشرين يوما",
                    ],
                    "jawaban" => "ثلاثين يوما",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "24",
                    "soal" => "",
                    "pilihan" => [
                        "يدرس بجاكرتا",
                        "يدرس بسورابايا",
                        "يدرس بمصر",
                        "يدرس بيوكجاكرتا",
                    ],
                    "jawaban" => "يدرس بمصر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "25",
                    "soal" => "",
                    "pilihan" => [
                        "نال الهدية للعمرة بسبب جماله",
                        "نال الهدية للعمرة بسبب ذكائه",
                        "نال الهدية للعمرة بسبب نجاحه",
                        "نال الهدية للعمرة بسبب والديه",
                    ],
                    "jawaban" => "نال الهدية للعمرة بسبب نجاحه",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم ستة وعشرين إلى رقم ثلاثين، استمع إلى الحوار الآتي، الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 26-30.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "26",
                    "soal" => "",
                    "pilihan" => [
                        "ينتهي بعد شهرين",
                        "ينتهي بعد شهر",
                        "ينتهي بعد ثلاثة أشهر",
                        "ينتهي بعد أربعة أشهر",
                    ],
                    "jawaban" => "ينتهي بعد شهر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "27",
                    "soal" => "",
                    "pilihan" => [
                        "مدّة الاشتراك سنة واحدة",
                        "في البيت مدّة الاشتراك سنتين",
                        "الجامعة مدّة الاشتراك ثلاث سنوات",
                        "مدّة الاشتراك أربع سنوات",
                    ],
                    "jawaban" => "مدّة الاشتراك سنة واحدة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "28",
                    "soal" => "",
                    "pilihan" => [
                        "عند شركة الدراجة",
                        "عند شركة الكهرباء",
                        "عند شركة السيارة",
                        "عند شركة الهاتف المحمول",
                    ],
                    "jawaban" => "عند شركة الهاتف المحمول",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "29",
                    "soal" => "",
                    "pilihan" => [
                        "بثمن رخيص",
                        "بثمن غال",
                        "بدون ثمن",
                        "بثمن كمايريد",
                    ],
                    "jawaban" => "بثمن رخيص",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "30",
                    "soal" => "",
                    "pilihan" => [
                        "أسمار",
                        "أثمان",
                        "ثامنية",
                        "ثمينة",
                    ],
                    "jawaban" => "أثمان",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم واحد وثلاثين إلى رقم خمسة وثلاثين ، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 31-35.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "31",
                    "soal" => "",
                    "pilihan" => [
                        "في الجامعة الإسلامية",
                        "في المدرسة المتوسطة",
                        "في الجامعة الأهلية",
                        "في المدرسة الثانوية",
                    ],
                    "jawaban" => "في الجامعة الإسلامية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "32",
                    "soal" => "",
                    "pilihan" => [
                        "بالحافلة",
                        "مشيا على الأقدام",
                        "بالدرّاجة",
                        "بالسيّارة",
                    ],
                    "jawaban" => "بالسيّارة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "33",
                    "soal" => "",
                    "pilihan" => [
                        "للدراسة في المدرسة",
                        "للدراسة في الجامعة",
                        "للتجارة",
                        "لإعطاء الآخرين",
                    ],
                    "jawaban" => "للدراسة في الجامعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "34",
                    "soal" => "",
                    "pilihan" => [
                        "في البنك",
                        "في المقهى",
                        "في المسجد",
                        "في البيت",
                    ],
                    "jawaban" => "في المقهى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "35",
                    "soal" => "",
                    "pilihan" => [
                        "لونها سوداء",
                        "لونها حمراء",
                        "لونها سمراء",
                        "لونها بيضاء",
                    ],
                    "jawaban" => "لونها بيضاء",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم ستة وثلاثين إلى أربعين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 36-40.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "36",
                    "soal" => "",
                    "pilihan" => [
                        "نفران",
                        "ثلاثة أنفار",
                        "أربعة أنفار",
                        "خمسة أنفار",
                    ],
                    "jawaban" => "ثلاثة أنفار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "37",
                    "soal" => "",
                    "pilihan" => [
                        "في الفندق",
                        "في المكتبة",
                        "في الطائرة",
                        "في السوق",
                    ],
                    "jawaban" => "في الطائرة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "38",
                    "soal" => "",
                    "pilihan" => [
                        "عشرون ب",
                        "ثلاثون هـ",
                        "ثلاثون ب",
                        "عشرون هـ",
                    ],
                    "jawaban" => "ثلاثون ب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "39",
                    "soal" => "",
                    "pilihan" => [
                        "مضيفة",
                        "طيارة",
                        "سائقة",
                        "لاعبة",
                    ],
                    "jawaban" => "مضيفة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "40",
                    "soal" => "",
                    "pilihan" => [
                        "هم داخل الطائرة",
                        "هم في مكان الانتظار",
                        "هم خارج الطائرة",
                        "هم في الملعب",
                    ],
                    "jawaban" => "هم داخل الطائرة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم واحد وأربعين إلى خمسة وأربعين، استمع إلى القراءة الآتية  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 41-45.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "41",
                    "soal" => "",
                    "pilihan" => [
                        "منافع التدخين",
                        "أضرار التدخين",
                        "آثار التدخين",
                        "العادة في التدخين",
                    ],
                    "jawaban" => "أضرار التدخين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "42",
                    "soal" => "",
                    "pilihan" => [
                        "التدخين شيء مهم في الحياة",
                        "الحياة تحتاج إلى التدخين",
                        "إن التدخين يسبب إلى كثير من الأمراض",
                        "إن التدخين لا يؤثر إلى الأمراض",
                    ],
                    "jawaban" => "إن التدخين يسبب إلى كثير من الأمراض",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "43",
                    "soal" => "",
                    "pilihan" => [
                        "أمراض الحكة",
                        "أمراض القلب",
                        "أمراض الروح",
                        "أمراض الفكرة",
                    ],
                    "jawaban" => "أمراض القلب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "44",
                    "soal" => "",
                    "pilihan" => [
                        "ينبغي علينا أن ندخن قليلا",
                        "ينبغي علينا أن ندخن كثيرا",
                        "ينبغي علينا أن ندخن ولو كان قليلا",
                        "ينبغي علينا أن لا ندخن ولو كان قليلا",
                    ],
                    "jawaban" => "ينبغي علينا أن لا ندخن ولو كان قليلا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "45",
                    "soal" => "",
                    "pilihan" => [
                        "يحث علينا أن نفعل شيئا يضر علينا",
                        "يحث علينا أن لا نفعل شيئا يضر علينا",
                        "يحث علينا أن نفعل شيئا ينفع علينا",
                        "يحث علينا أن نفعل شيئا لا ينفع علينا",
                    ],
                    "jawaban" => "يحث علينا أن لا نفعل شيئا يضر علينا",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>للإجابة عن الأسئلة من رقم ستة وأربعين إلى خمسين، استمع إلى الحوار الآتي  ثم اختر أنسب جواب من الإختيارات المتعددة المتاحة  بعده:</p>"
            ],
            [
                "tipe" => "audio",
                "data" => "v3 46-50.mp3"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "46",
                    "soal" => "",
                    "pilihan" => [
                        "في البيت",
                        "في المطعم",
                        "في المقصف",
                        "في المطبخ",
                    ],
                    "jawaban" => "في المطعم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "47",
                    "soal" => "",
                    "pilihan" => [
                        "في الصباح",
                        "في النهار",
                        "في المساء",
                        "في الليل",
                    ],
                    "jawaban" => "في الليل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "48",
                    "soal" => "",
                    "pilihan" => [
                        "الدجاجة المقلية",
                        "البيض المغلي",
                        "الأطعمة السريعة",
                        "الفواكه",
                    ],
                    "jawaban" => "الأطعمة السريعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "49",
                    "soal" => "",
                    "pilihan" => [
                        "سيارة الركاب",
                        "سيارة الإسعاف",
                        "الدراجة النارية",
                        "الحافلة",
                    ],
                    "jawaban" => "سيارة الإسعاف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => "50",
                    "soal" => "",
                    "pilihan" => [
                        "نفران",
                        "ثلاثة أنفار",
                        "أربعة أنفار",
                        "خمسة أنفار",
                    ],
                    "jawaban" => "أربعة أنفار",
                ]
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv3(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p><center><b>فهم التراكيب والتعبيرات</b></center></p>
                "
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => 'قال حكيم : "الكلمة إذا خرج من القلب وقعت فى القلب، وإذا خرجت من اللسان لم تجاوز الذان، الواو فى (وقعت) هي ؟',
                    "pilihan" => [
                        "حرف عطف",
                        "حرف استئناف",
                        "واو القسم",
                        "حرف أصلي من أحرف الكلمة",
                    ],
                    "jawaban" => "حرف أصلي من أحرف الكلمة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => 'قال تعالى : (لو كان فيهما آلهة إلا الله لفسدتا) كلمة "آلهة" هي ؟',
                    "pilihan" => [
                        "خبر كان",
                        "اسم كان",
                        "مبتدأ مأخر",
                        "خبر",
                    ],
                    "jawaban" => "اسم كان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => 'قال تعالى : (قتل أصحاب الأخدود) كلمة "أصحاب" هي ؟',
                    "pilihan" => [
                        "مبتدأ مأخر",
                        "نائب الفاعل",
                        "فاعل",
                        "مضاف اليه",
                    ],
                    "jawaban" => "نائب الفاعل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => 'قال رسول الله ﷺ : (أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله) فعل "يشهدوا" فى ذلك الحديث مضارع صحيح الآخر ؟',
                    "pilihan" => [
                        "منصوب وعلامة نصبه حذف النون",
                        "مرفوع وعلامة رفعه ضمة",
                        "مجزوم وعلامة جزمه حذف النون",
                        "منصوب وعلامة نصبه الف",
                    ],
                    "jawaban" => "منصوب وعلامة نصبه حذف النون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "قال رسول الله ﷺ : (إِنَّ الحَلاَلَ بَيِّنٌ وَإِنَّ الحَرَامَ بَيِّنٌ وَبَيْنَهُمَا أُمُوْرٌ مُشْتَبِهَاتٌ لاَ يَعْلَمُهُنَّ كَثِيْرٌ مِنَ النَّاس، فَمَنِ اتَّقَى الشُّبُهَاتِ فَقَدِ اسْتَبْرأَ لِدِيْنِهِ وعِرْضِهِ...الخ) خبر إن من هذا الحديث هو ؟",
                    "pilihan" => [
                        "الحلال",
                        "وإن الحرام",
                        "الحرام",
                        "بين",
                    ],
                    "jawaban" => "بين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => "شكر المهندس العاملتين .......تعملان بنشاط",
                    "pilihan" => [
                        "اللتان",
                        "الذين",
                        "اللتين",
                        "الذَين",
                    ],
                    "jawaban" => "اللتين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "ليس محمد .... في الجامعة الكبيرة بالمدينة ",
                    "pilihan" => [
                        "طالبا",
                        "الطالب",
                        "طالب",
                        "طالبة",
                    ],
                    "jawaban" => "طالبا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "قال تعالى : كذالك وأورثناها بنى إسرائيل. مضاف اليه فى تلك الآية الكريمة هو ؟",
                    "pilihan" => [
                        "كذالك",
                        "إسرائيل",
                        "أورثناها بنى",
                        "بنى إسرائيل",
                    ],
                    "jawaban" => "إسرائيل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "....المرأة فى الماضي لا تخرج من بيتها إلا عند الضرورة",
                    "pilihan" => [
                        "جائتْ",
                        "كانتْ",
                        "لكن",
                        "كان",
                    ],
                    "jawaban" => "كانتْ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "كان جنود المسلمين فى المعركة ثمانين وثلاثين ...؟",
                    "pilihan" => [
                        "ألف",
                        "ألوف",
                        "ألفا",
                        "آلاف",
                    ],
                    "jawaban" => "ألفا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "يجب أن تصل زينب وزنها إلى سبعين ......؟",
                    "pilihan" => [
                        "كيلان",
                        "كيلاً",
                        "كيلون",
                        "كيالين",
                    ],
                    "jawaban" => "كيلاً",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "والذين يرمون المحصنات ثم لم يأتوا بـــــــ.......شهداء",
                    "pilihan" => [
                        "أربع",
                        "رابعة",
                        "أربعون",
                        "أربعة",
                    ],
                    "jawaban" => "أربعة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "يبلغ عدد سكان طوكيو نحو عشرة ........!",
                    "pilihan" => [
                        "ملايين",
                        "مليونان",
                        "مليون",
                        "مليونين",
                    ],
                    "jawaban" => "ملايين",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => 'إن خروج المرأة من البيت يؤدي الى تفكك الأسرة . أي صغة لفظ "خروج"',
                    "pilihan" => [
                        "مصدر",
                        "اسم الفاعل",
                        "اسم مفعول",
                        "اسم فعل الأمر",
                    ],
                    "jawaban" => "مصدر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => "ما هي الجملة الخاطئة من هذه الجملة ",
                    "pilihan" => [
                        "كان هدف الطالب طلب العلم ",
                        "كانت أهداف الطالب طلب العلم ",
                        "أخذت زينب تتناول كثيرا من الطعام",
                        "أخذ زينب تناول كثيرا من الطعام",
                    ],
                    "jawaban" => "أخذ زينب تناول كثيرا من الطعام",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "ما هي الجملة الصحيحة من هذه الجملة",
                    "pilihan" => [
                        "دعاتْ الإسلام الى النظافة والطهارة",
                        "دعا الإسلام الى النظافة والطهارة",
                        "تدعو الإسلام الى النظافة والطهارة",
                        "دعتْ الإسلام الى النظافة والطهارة",
                    ],
                    "jawaban" => "دعا الإسلام الى النظافة والطهارة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "تخطئن الأمة إذا اعتمدت على قوة الشباب وحدهم. الكلمة الخاطئة من هذه الجملة",
                    "pilihan" => [
                        "اعتمدت",
                        "الشباب",
                        "تخطئن",
                        "الأمة",
                    ],
                    "jawaban" => "تخطئن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "انتشرت الغنم بين الأعشاب الخضراء. الكلمة الخاطئة من هذه الجملة :",
                    "pilihan" => [
                        "الإعشاب",
                        "الغنم",
                        "بين",
                        "الخضراء",
                    ],
                    "jawaban" => "الغنم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "ما هي الجملة الصحيحة من هذه الجملة",
                    "pilihan" => [
                        "صبروا المسلمون على ما أصابهم من الوباء",
                        "صبرنا المسلمون على ما أصابهم من الوباء",
                        "صبر المسلمون على ما أصابهم من الوباء",
                        "صبرتم المسلمون على ما أصابهم من الوباء",
                    ],
                    "jawaban" => "صبر المسلمون على ما أصابهم من الوباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "..... القارئ أيات من القرآن الكريم",
                    "pilihan" => [
                        "تلا",
                        "تلى",
                        "تلو",
                        "تلأ",
                    ],
                    "jawaban" => "تلا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => "نعلم جميعا أن ...... المديرة يتعلمان فى الخارج",
                    "pilihan" => [
                        "بنت",
                        "ابني",
                        "ابن",
                        "بنتي",
                    ],
                    "jawaban" => "ابني",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => "الرجل .....قابلته صديقى الحميم",
                    "pilihan" => [
                        "التى",
                        "ما",
                        "من",
                        "الذي",
                    ],
                    "jawaban" => "الذي",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "كان طلاب العلم فى الماضى ....من بلد الى بلد لطلب العلم",
                    "pilihan" => [
                        "أسفرون",
                        "يسافرون",
                        "يسافرين",
                        "تتسافر",
                    ],
                    "jawaban" => "يسافرون",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "وقبل الالتحاق ..... الجامعة كان عمر تلميذا فى المدرسة الثانوية",
                    "pilihan" => [
                        "على",
                        "إلى",
                        "الباء",
                        "عن",
                    ],
                    "jawaban" => "الباء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "وافق مجلس الشعب .......المشروع الكبير",
                    "pilihan" => [
                        "على",
                        "الباء",
                        "إلى",
                        "من",
                    ],
                    "jawaban" => "على",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => "يعتقد المسلمون ....هو كلام الله",
                    "pilihan" => [
                        "بأن القرآن الكريم",
                        "على أن القرآن الكريم",
                        "أن القرآن الكريم",
                        "إن القرأن الكريم",
                    ],
                    "jawaban" => "أن القرآن الكريم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => "إن اختلاف الآراء .... الفروع الفقهية لأ يدل على انحراف في الدين ما دام لم يخرج عن المقررات الشرعية المجمع عليها من السابقين",
                    "pilihan" => [
                        "من",
                        "على",
                        "الباء",
                        "في",
                    ],
                    "jawaban" => "في",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "أتعلم القرآن الكريم <u>حباً</u> في فهم التعاليم الإسلامية. الكلمة التى مسطورة تحتها تعنى",
                    "pilihan" => [
                        "المفعول لأجله",
                        "المفعول فيه",
                        "المفعول به",
                        "المفعول مطلق",
                    ],
                    "jawaban" => "المفعول لأجله",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "صرتَ <u>أستاذا</u> في اللغة العربية . الكلمة التى مسطورة تحتها تعنى :",
                    "pilihan" => [
                        "المفعول معه",
                        "المفعول لأجله",
                        "خبر صار",
                        "اسم صار",
                    ],
                    "jawaban" => "خبر صار",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => "أ وصلت<u>ك</u> الرسالة التى أرسلتها قبل يومين من سورابيا ؟  . الطامة التى مسطورة تحتها تعنى :",
                    "pilihan" => [
                        "المبتدأ",
                        "فاعل",
                        "خبر",
                        "المفعول به",
                    ],
                    "jawaban" => "المفعول به",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "من خطبة النبى ﷺ : فإن لكم على نسائكم <u>حقاً</u>. الكلمة التى مسطورة تحتها تعنى",
                    "pilihan" => [
                        "خبر إن",
                        "اسم إن",
                        "المفعول المطلق",
                        "الحال",
                    ],
                    "jawaban" => "اسم إن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "للحيوان <u>أصوات</u> مختلفة.  الكلمة التى مسطورة تحتها تعنى :",
                    "pilihan" => [
                        "المبتدأ",
                        "الخبر",
                        "المفعول به",
                        "الفاعل",
                    ],
                    "jawaban" => "المبتدأ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "على – أموالا – بعض – تنفق – كثيرة – النظافة – الدول",
                    "pilihan" => [
                        "النظافة تنفق أموالا كثيرة على بعض الدول",
                        "على بعض الدول تنفق النظافة أومالا كثيرة",
                        "تنفق بعض الدول أموالا كثيرة على النظافة",
                        "بعض أموالا كثيرة تنفق على النظافة الدول",
                    ],
                    "jawaban" => "تنفق بعض الدول أموالا كثيرة على النظافة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "من – يفضل – الناس- القراءة – كثير",
                    "pilihan" => [
                        "من يفضل كثير الناس القراءة",
                        "يفضل كثير من الناس القراءة",
                        "القراءة من كثير الناس يفضل",
                        "كثير القراءة من يفضل الناس",
                    ],
                    "jawaban" => "يفضل كثير من الناس القراءة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "الأم – وحد – ها – الوقت – معظم – تبقى –في – البيت",
                    "pilihan" => [
                        "وحد الأمها معظم الوقت فى البيت  تبقى",
                        "الأمها تبقى في معظم الوقت وحد البيت",
                        "فى معظم الوقت الأمها تبقى وحد البيت",
                        "تبقى الأم في البيت وحدها معظم الوقت",
                    ],
                    "jawaban" => "تبقى الأم في البيت وحدها معظم الوقت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "يفضل فريق من الناس أن يكون قريبا من شاطئ البحر . خبر كان من هذه الجملة هي",
                    "pilihan" => [
                        "قريبا",
                        "من الناس",
                        "فريق الناس",
                        "شاطئ البحر",
                    ],
                    "jawaban" => "قريبا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "........ المشاهدون مباراة كرة القدم في الملعب الرياضي الكبير",
                    "pilihan" => [
                        "شاهدت",
                        "شاهدوا",
                        "يشهد",
                        "يشاهدون",
                    ],
                    "jawaban" => "يشهد",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "العَالِمُ كَبِيْرٌ وَإِنْ كَانَ <u>حَدَثًا</u> وَالجَاهِلُ صَغِيْرٌ وَإِنْ كَانَ شَيْخًا. الكلمة التى مسطورة تحتها تعنى",
                    "pilihan" => [
                        "الأمر",
                        "صغير السنّ",
                        "كبير السنّ",
                        "المجالس",
                    ],
                    "jawaban" => "صغير السنّ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => "لا نتظرنّ لأثواب على أحد إن <u>رمت</u> تعرفه فانظر الى الأدب. الكلمة التى تحتها خط تعنى ؟",
                    "pilihan" => [
                        "عرفت",
                        "كرمت",
                        "نظرت",
                        "أردت",
                    ],
                    "jawaban" => "أردت",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "من لم <u>يذق</u> ذل التعلم ساعة تجرع ذل الجهل طول حياته. الكلمة التى تحتها خط تعنى ؟",
                    "pilihan" => [
                        "يشعر",
                        "يتعلم",
                        "يذهب",
                        "يجلس",
                    ],
                    "jawaban" => "يشعر",
                ]
            ]
        ];

        return $data;
    }

    public function get_soal_qiroahv3(){
        $data = [
            [
                "tipe" => "petunjuk",
                "data" => "<p><center><b>فهم المقروء</b></center></p>"
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان أخي إبراهيم طالبا في كلية الهندسة، بجامعة ملك سعود. دعاني أخي لقضاء أيام عيد الفطر معه وقد اتصل بي هاتفيا، قبل سفري قائلا : يا علي أرجو أن تحضر بالطائرة ولا تحاول أن تحضر بالحافلة، فالأمطار كثيرة وربما تعطلت الحافلة في الطريق بسبب المياه والوحل.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 1,
                    "soal" => "أين درس إبراهيم؟",
                    "pilihan" => [
                        "إندونيسيا",
                        "ماليزيا",
                        "الجزائر",
                        "السعودية",
                    ],
                    "jawaban" => "السعودية",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 2,
                    "soal" => "لماذا اقترح إبراهيم عَليًّا ليركب الطائرة؟",
                    "pilihan" => [
                        "أنّ أجرة الطائرة رخيصة",
                        "أن أجرة الحافلة غلية",
                        "أن الطائرة لا تتعطل بسبب المطر",
                        "أن الحافلة لا تتعطل بسبب المياه والوحل ",
                    ],
                    "jawaban" => "أن الطائرة لا تتعطل بسبب المطر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 3,
                    "soal" => "من المتحدث لتلك القرآءة؟ ",
                    "pilihan" => [
                        "إبراهيم ",
                        "ملك سعود ",
                        "علي",
                        "أخي إبراهيم",
                    ],
                    "jawaban" => "علي",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>عاشت خديجة بنت خويلد في بيت غني، وكانت محبوبة من والديها لذكائها وأدبها وعندما مات زوجها عملت بالتجارة فكسبت مالا كثيرا. كان النبي (ص) قبل النبوة مشهورا بالأمانة والصدق، فاختارته السيدة خديجة ليعمل في تجارتها، فسافر إلى الشام في رحلة تجارية وكان معه في تلك الرحلة ميسرة، خادم السيدة خديجة. عندما عادت الرحلة من الشام أخبرت ميسرة السيدة خديجة بما حدث في تلك الرحلة. أخبرها ميسرة عن  صدق محمد وأمانته، كما أخبرها بالسحابة التي كانت تحميه من حر الشمس وهي تسير فوق رأسه.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 4,
                    "soal" => "ماذا حدث في رحلة النبي؟",
                    "pilihan" => [
                        "سار الجمل سرعة",
                        "سارت السحابة تحت قدميه",
                        "حمت السحابة رأسه",
                        "حمت السحابة رأسها",
                    ],
                    "jawaban" => "حمت السحابة رأسه",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 5,
                    "soal" => "عاشت خديجة بنت خويلد في بيت....",
                    "pilihan" => [
                        "ضيق",
                        "فاخر",
                        "صغير",
                        "بسيط",
                    ],
                    "jawaban" => "فاخر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 6,
                    "soal" => '"كان النبي (ص) قبل النبوة مشهورا بالأمانة والصدق". ما هو خبر (كان) من تلك الجملة؟',
                    "pilihan" => [
                        "النبي",
                        "ص",
                        "قبل النبوة",
                        "مشهورا",
                    ],
                    "jawaban" => "مشهورا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 7,
                    "soal" => "لماذا اختارت السيدة خديجة النبي محمدا ليعمل في تجارتها؟",
                    "pilihan" => [
                        "لأنه مشهور بالصدق والأمانة",
                        "لأنه مشهور بالذكاء والأدب",
                        "لأنها مشهورة بالأمانة والصدق",
                        "لأنها مشهورة بذكائها وأدبها",
                    ],
                    "jawaban" => "لأنه مشهور بالصدق والأمانة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 8,
                    "soal" => "ماذا فعلت ميسرة بعدما شاهدت شيئا غريبا في رحلتها مع النبي؟",
                    "pilihan" => [
                        "سكتت",
                        "ضحكت",
                        "تعجبت",
                        "أخبرت",
                    ],
                    "jawaban" => "أخبرت",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>يفضل كثير من الناس الترويح خارج البيوت، حيث يقضون الوقت في مخيمات. ويختلف الوقت الذي يقضيه الناس في المخيمات، فقد يكون ليلة واحدة، وقد يكون عدة أسابيع. ويختلف المكان، فقد يكون على شاطئ البحر، أو في البر، أو في الغابة، أو في الصحراء، أو بين الجبال، حيث الهواء النقي.</p>
                    <p>يخرج الناس أيام العطلة إلى البر، وينصبون في مكان الترويح الخيام، ويحملون معهم الطعام والشراب، ووسائل الترويح. ويفضل فريق من الناس أن يكون قريبا من شاطئ البحر، حيث يمارسون السباحة، وأنواع الرياضة الأخرى، ويصطادون السمك. ويفضل بعض الناس مشاهدة الطيور، أو التصوير، أو المشي.</p>
                    <p>يحمل الناس معهم إلى البر خياما، وملابس، وكثيرا من الطعام. وبعض الناس يعدون الطعام في بيوتهم، ويضعونه في أوان. وهناك من يفضل إعداد الطعام في المخيمات. ويحمل الناس معهم الماء، إذا لم يكن في المكان ماء.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 9,
                    "soal" => "ما العنوان المناسب لهذه الفقرات؟",
                    "pilihan" => [
                        "الهواية",
                        "التخييم",
                        "التنزه",
                        "الأعمال خارج البيت",
                    ],
                    "jawaban" => "التخييم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 10,
                    "soal" => "يقضي الناس أيام عطلتهم إلى البر....؟",
                    "pilihan" => [
                        "هم ينامون في خيامهم",
                        "هم ينامون في بيوتهم",
                        "هم ينامون في فنادقهم",
                        "هم ينامون في شققهم",
                    ],
                    "jawaban" => "هم ينامون في خيامهم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 11,
                    "soal" => "ما هي المدة الأدنى في قضاء خروجهم من البيت للتنزه؟",
                    "pilihan" => [
                        "ليلة واحدة",
                        "يوما واحدا",
                        "عدة أسابيع",
                        "عدة شهور",
                    ],
                    "jawaban" => "ليلة واحدة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 12,
                    "soal" => "أين المكان الذي لا يناسبه للتخييم؟",
                    "pilihan" => [
                        "شاطئ البحر",
                        "الجرف",
                        "الغابة",
                        "بين الجبال",
                    ],
                    "jawaban" => "الجرف",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 13,
                    "soal" => "كم يوما في أسبوع واحد؟",
                    "pilihan" => [
                        "يوما واحدا",
                        "ثلاثة أيام",
                        "عشرة أيام",
                        "سبعة أيام",
                    ],
                    "jawaban" => "سبعة أيام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p></p>أصلي العصر في المسجد وأتلو القرآن الكريم وعندما يؤذن المؤذن آذن المغرب أتناول بعض التمر ثم أشرب قليلا من الماء ثم نصلي المغرب جماعة. وبعد الصلاة أعود إلى المنزل حيث أكمل إفطاري ثم أعود لصلاة العشاء و صلاة التراويح والوتر في المسجد.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 14,
                    "soal" => "ما المرادف من كلمة (أتلو) ؟",
                    "pilihan" => [
                        "أعطى",
                        "أفتح",
                        "أقرأ",
                        "أصدق",
                    ],
                    "jawaban" => "أقرأ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 15,
                    "soal" => 'ما المقصود من عبارة "وعندما يؤذن المؤذن آذن المغرب أتناول بعض التمر ثم أشرب قليلا" ؟',
                    "pilihan" => [
                        "أنه يأكل التمر قبل الآذان",
                        "أنه يأكل التمر قبل المغرب",
                        "أنه يأكل التمر بعد صلاة المغرب",
                        "أنه يأكل التمر بعد ما سمع الآذان",
                    ],
                    "jawaban" => "أنه يأكل التمر بعد ما سمع الآذان",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 16,
                    "soal" => "وعندما يؤذن آذن المغرب <u>أتناول</u> بعض التمر. الكلمة التي تحتها خط تعني؟",
                    "pilihan" => [
                        "استمرار",
                        "استهلاك",
                        "استشعار",
                        "استعداد",
                    ],
                    "jawaban" => "استهلاك",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 17,
                    "soal" => "ثم <u>أعود</u> لصلاة العشاء. في تلك الجملة، الكلمة التي تحتها خط تعني؟",
                    "pilihan" => [
                        "رجع من المنزل",
                        "ذهب إلى المنزل",
                        "ح. رجع من المسجد",
                        "ذهب إلى المسجد",
                    ],
                    "jawaban" => "ذهب إلى المسجد",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان حامد راعيا يرعى أغنام القرية. <u>وكان</u>  يأخذ الأغنام في الصباح الباكر. ويخرج بها إلى أطراف القرية حيث الأشجار والعشب الأخضر. كان حامد يحمل في يده اليمني عصا كبيرة وفي يده اليسرى طعامه ومزماره وكان يصحبه كلبه الذي يجري أمام الأغنام وخلفها.</p>
                    <p>عندما يصل حامد إلى المرعى يترك أغنامه ويذهب إلى شجرة كبيرة يجلس تحتها ليتناول طعامه ثم يتناول مزماره ويغني بعض الألحان الجميلة ثم ينام قليلا ويستيقظ ليتفقد أغنامه. وعند العصر يجمع أغنامه ويعود بها إلى القرية سعيدا.</p>
                    <p>فكر حامد ذات  يوم، وقال لنفسه: لماذا لا أسخر من أهل القرية؟. وأخذ يفكر في طريقة يمازح بها أهل القرية. صعد حامد إلى شجرة عالية وأخذ يصرخ بصوت عال: الذئب.... الذئب...... لقد هجم الذئب على أغنامكم.... أنقذوني... أنقذوني..</p>
                    <p>لما سمع أهل القرية نداء الراعي. أسرعوا إليه فلما وصلوا إلى مكانه أخذ ينظر إليهم ويضحك ثم قال لهم: لقد كذبت عليكم ها.. ها.. ها.. عاد الناس إلى القرية غاضبين ثم نسوا الموضوع.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 18,
                    "soal" => "الفكرة الرئيسة في الفقرة السابقة تتحدث عن.... ",
                    "pilihan" => [
                        "عاش رجل في القرية وعنده أغنام كثيرة وهو صادق",
                        "كان راعيا كاذبا",
                        "كان الرجل راعيا صادقا",
                        "الرجل يحب الغناء",
                    ],
                    "jawaban" => "كان راعيا كاذبا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 19,
                    "soal" => "أين كذب الراعي على أهل القرية؟ ",
                    "pilihan" => [
                        "في السوق",
                        "في الملعب",
                        "في المرعى",
                        "في القرية",
                    ],
                    "jawaban" => "في المرعى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 20,
                    "soal" => "أي عبارة من العبارات الآتية لا يحتويها الموضوع؟ ",
                    "pilihan" => [
                        "حامد كان صادقا و كريما",
                        "حامد كان راعيا و كاذبا",
                        "كان حامد يغني بعض الألحان ",
                        "كان حامد يعود إلى القرية عند العصر",
                    ],
                    "jawaban" => "حامد كان صادقا و كريما",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 21,
                    "soal" => 'خبر كان من عبارة "<u> وكان</u>  يأخذ الأغنام في الصباح الباكر "؟ ',
                    "pilihan" => [
                        "يأخذ",
                        "الأغنام",
                        "في الصباح ",
                        "الباكر",
                    ],
                    "jawaban" => "يأخذ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 22,
                    "soal" => 'ضمير (ها) في جملة "وعند العصر يجمع أغنامه ويعود <u>بها</u> إلى القرية سعيدا." راجعا إلى.. ',
                    "pilihan" => [
                        "القرية",
                        "الأغنام",
                        "الجميلة ",
                        "الألحان ",
                    ],
                    "jawaban" => "الأغنام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>حزنت زينب حزنا شديدا. فهي لا تستطيع أن تفارق صديقتها العزيزة. لاحظ والد زينب في البيت. أن بنته حزينة طوال الوقت ولم تعد تضحك كعادتها، فسألها عن سبب ذٰلك. فأخبرته بأن صديقتها سلمى سترحل مع أسرتها إلى مدينة أخرى. لأن والدها لم يجد عملا في هذه المدينة. ابتسم والد زينب وقال لها: لن تفارقي صديقتك إن شاء الله</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 23,
                    "soal" => "ما سبب حزنها زينب؟ ",
                    "pilihan" => [
                        "ستعود صديقتها إلى منزلها",
                        "ستزور صديقتها إلى مدينة أخرى",
                        "سترحل صديقتها إلى مدينة أخرى ",
                        "كل الأجوبة خاطئة ",
                    ],
                    "jawaban" => "سترحل صديقتها إلى مدينة أخرى ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 24,
                    "soal" => "ما اسم صديقة زينب؟ ",
                    "pilihan" => [
                        "عزيزة",
                        "فاطمة",
                        "خديجة ",
                        "سلمى",
                    ],
                    "jawaban" => "سلمى",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 25,
                    "soal" => "لماذا ستذهب صديقتها وأسرتها عن مدينة قديمة؟ ",
                    "pilihan" => [
                        "لأن والد صديقتها يجد عملا في مدينة أخرى ",
                        "لأن والد صديقتها لم يجد عملا في هذه المدينة",
                        "لأن أسرة صديقتها لا تحب  هذه المدينة ",
                        "لأن أسرة صديقتها تحب  هذه المدينة ",
                    ],
                    "jawaban" => "لأن والد صديقتها لم يجد عملا في هذه المدينة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>ولد أبو بكر الصديق رضي الله عنه في السنة الثانية أو الثالثة من عام الفيل وهو أصغر من النبي(ص) بنحو سنتين. وقد <b>كان</b> محبوبا في الجاهلية. لأنه كان رجلا أمينا، كريما، طيب الأخلاق، حسن السلوك، وهو لم يشرب خمرا في حياته ولم يسجد لصنم أبدا.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 26,
                    "soal" => 'الضمير هو في جملة "وقد <b>كان</b> محبوبا في الجاهلية" يعود إلى ؟',
                    "pilihan" => [
                        "النبي صلى الله عليه وسلم",
                        "أبي بكر الصديق",
                        "العام",
                        "الفيل",
                    ],
                    "jawaban" => "أبي بكر الصديق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 27,
                    "soal" => 'ولد أبو بكر الصديق رضي الله عنه. "وُلِد" في هذه الجملة من فعل؟',
                    "pilihan" => [
                        "معلوم",
                        "مجهول",
                        "مرفوع",
                        "منصوب",
                    ],
                    "jawaban" => "مجهول",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>دعا النبي (ص) الناس إلى الإسلام. فتردد الكثيرون إلا أبا بكر الصديق. فقد أسلم دون تردد. وكان أول من أسلم من الرجال، وكانت السيدة خديجة أول من أسلم من النساء. أما أول من أسلم من الصبيان فهو علي بن أبي طالب رضي الله عنه.</p>
                    <p>كنّى النبي (ص) أبا بكر بالصديق لأنه صدقه عندما أخبره بقصة الإسراء به ليلا من المسجد الحرام في مكة إلى مسجد الأقصى في بيت المقدس. حيث قال تعالى : "سبحان الذي أسرى بعبده ليلا من المسجد الحرام إلى المسجد الأقصى الذي باركنا حوله لنريه من آيتنا....."</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 28,
                    "soal" => "لماذا كُنّيَ أبو بكر بالصديق؟ ",
                    "pilihan" => [
                        "لأنه أول من أسلم من الرجال",
                        "لأنه أول من أسلم من الصبيان",
                        "لأنه لايزال صغيرا ",
                        "لأنه صدق قصة الإسراء",
                    ],
                    "jawaban" => "لأنه صدق قصة الإسراء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 29,
                    "soal" => "فهمنا من النص السابق أن أول الولد أسلم هو؟ ",
                    "pilihan" => [
                        "أبو بكر الصديق",
                        "السيدة خديجة ",
                        "عمر بن الخطاب",
                        "علي بن أبي طالب",
                    ],
                    "jawaban" => "علي بن أبي طالب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 30,
                    "soal" => '<u>فتردد</u> الكثيرون إلا أبا بكر الصديق". والمراد باللفظ الذي تحته خط هو ؟ ',
                    "pilihan" => [
                        "هم يريبون في قصة الإسراء ",
                        "هم يؤمنون بقصة الإسراء",
                        "هم يشكّون على دعوة النبي إلى الإسلام",
                        "هم يخونون دعوة النبي إلى الإسلام",
                    ],
                    "jawaban" => "هم يشكّون على دعوة النبي إلى الإسلام",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>كان في إحدى المدن ملك ذكي يحكم شعبه حكما عادلا وكان للملك وزير ذكي و عادل كذلك. وقد كان الشعب يحب الملك ووزيره. كانت في وسط المدينة بئر. عذبة الماء. يشرب منها جميع السكان المدينة. لأنه لم تكن في المدينة بئر سواها. </p>
                    <p>في أحد الأيام جائت ساحرة إلى المدينة. كانت تحمل قارورة صغيرة. بها ماء. وقفت الساحرة بالقرب من البئر وكان حول البئر جمع كبير من الناس. قالت لهم الساحرة : سأقذف بسبع نقط من هذه القارورة في البئر ومن يشرب من البئر يصير مجنونا أو يمت.</p>
                    <p>في اليوم الثاني عطس سكان المدينة. فذهبوا إلى البئر وشربوا من مائها وقد كانوا خائفين من كلام الساحرة ولما شربوا من الماء لم يمت منهم أحد ولكنهم أصبحوا جميعا مجانين. </p>
                    <p>عطس الملك ولكنه خاف من الجنون والموت. وكذلك خاف وزيره وعندما سمع سكان المدينة. بأن الملك ووزيره لم يشربا من البئر. طافوا من حي إلى حي ومن شارع إلى شارع. وهم ينادون: لقد صارا ملكنا ووزيره مجنونين. </p>
                    <p>في المساء علم الملك بما فعله الناس. فاستدعاهم أمام قصره وأمر بأن تملأ له كأس ذهبية من ماء البئر. </p>
                    <p>فملأوها له في الحال وأخضروها إليه. فتناول بيده ورفعها إلى فمه وشرب من مائها ثم دفع بالكأس إلى وزيره فشرب بقية الماء. انطلق سكان المدينة في الشوارع. ينادون: لقد عاد ملكنا ووزيره إلى رشدهما</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 31,
                    "soal" => "ما العنوان المناسب للنص السابق؟ ",
                    "pilihan" => [
                        "الملك الجائر",
                        "الساحرة الحكيمة",
                        "الملك الحكيم",
                        "الساحرة المجرمة",
                    ],
                    "jawaban" => "الملك الحكيم",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 32,
                    "soal" => "العبارات التي لا تحتوي على ذلك النص هي؟ ",
                    "pilihan" => [
                        "السكان يغضب ملكه ووزيره لأنهما يتناولان الماء من تلك البئر",
                        "أصبح السكان مجنونين بسبب شرب الماء",
                        "قذفت الساحرة ماء قارورتها بسبع نقط",
                        "كان الملك ذكيا و عادلا",
                    ],
                    "jawaban" => "السكان يغضب ملكه ووزيره لأنهما يتناولان الماء من تلك البئر",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 33,
                    "soal" => "ماذا حملت الساحرة؟ ",
                    "pilihan" => [
                        "سبع نقط من القارورة ",
                        "الكأس لإملاء الماء",
                        "هي لا تحمل شيأ إلا مالا",
                        "قارورة صغيرة بها ماء",
                    ],
                    "jawaban" => "قارورة صغيرة بها ماء",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 34,
                    "soal" => "ماذا ستحدث عندما شرب الناس ماء البئر التي احتوت على ماء حملته الساحرة؟ ",
                    "pilihan" => [
                        "سيكون ذكيا وماهرا",
                        "سيصبح مجنونا أو ميتا",
                        "سيصير غانيا",
                        "كل الأجوبة خاطئة ",
                    ],
                    "jawaban" => "سيصبح مجنونا أو ميتا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 35,
                    "soal" => "ماذا قالت الساحرة إلى سكان المدينة؟ ",
                    "pilihan" => [
                        "إنها ستقذف بسبع نقط من دلوها في البئر ",
                        "إنها ستأخذ بعض الماء من البئر وتعطيه إلى الآخر",
                        "إنها ستعطي مالها إلى جميع السكان المدينة ",
                        "إنها ستقذف بسبع نقط من قارورتها في البئر ",
                    ],
                    "jawaban" => "إنها ستقذف بسبع نقط من قارورتها في البئر ",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>هل تعمل المرأة خارج بيتها، أم لا تعمل؟ يختلف الناس في الإجابة عن هذا السؤال إلى ثلاث فرق؛ فريق يقول: نعم، يجب أن تعمل المرأة خارج بيتها، مثل الرجل؛ وفريق آخر يقول: لا يصح أن تعمل المرأة خارج بيتها؛ وفريق ثالث يقول: تعمل المرأة خارج بيتها، ولكن بشرط.</p>
                    <p>يقول الفريق الأول: إن المرأة نصف المجتمع، ولا يصح أن تجلس في بيتها؛ تغسل الملابس، وتعد الطعام، وتنظف البيت، وتربي الأولاد، وهي عندهم جزء من الاقتصاد، تعمل وتأخذ أجر عملها.</p>
                    <p>ويرى الفريق الثاني، أن وظيفة المرأة الأساسية أن تكون في البيت، حيث تديره، وتربي أولادها. ويرى هذا الفريق أن الراتب الذي تأخذه المرأة من عملها، تعطيه للخادمة التي تفسد الأولاد، ولا تصلحهم. ويقول هذا الفريق: إن خروج المرأة من البيت، يؤدي إلى تفكك الأسرة، وضياع الأولاد.</p>
                    <p>أما الفريق الثالث، فيرى أن العمل حق للمرأة، فتعمل عملها الأساسي في بيتها، ولها أن تعمل خارج بيتها، بشرط أن تعمل في المجالات التي تناسبها، وتحفظ أخلاقها، وتبعدها عن مخالطة الرجال، كالعمل في المجال الطبي؛ فتعمل طبيبة، أو ممرضة، أو في المجال التعليمي؛ فتعمل معلمة، أو مربية،أو غير ذلك في مجتمع نسائي.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 36,
                    "soal" => "الفكرة الرئيسة للفقرة الثانية هي؟ ",
                    "pilihan" => [
                        "المرأة تعمل و تحصل أجرة كمثل الرجل",
                        "عندما عملت المرأة خارج البيت ستجعل أسرتها تفككا",
                        "المرأة تعمل داخل و خارج بيتها ",
                        "المرأة تعمل خارج بيتها حيث أن لاتغير أخلاقها",
                    ],
                    "jawaban" => "المرأة تعمل و تحصل أجرة كمثل الرجل",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 37,
                    "soal" => "الفكرة الرئيسة للفقرة الثالثة هي؟ ",
                    "pilihan" => [
                        "المرأة تعمل و تحصل أجرة كمثل الرجل ",
                        "عندما عملت المرأة خارج البيت ستجعل أسرتها تفككا",
                        "المرأة تعمل داخل و خارج بيتها",
                        "المرأة تعمل خارج بيتها حيث أن لاتغير أخلاقها",
                    ],
                    "jawaban" => "عندما عملت المرأة خارج البيت ستجعل أسرتها تفككا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 38,
                    "soal" => "وجدنا من تلك الفقرات أنّ المرأة.... ",
                    "pilihan" => [
                        "كانت تعمل خارج بيتها كمثل الرجل",
                        "كانت تعمل في بيتها فقط لتربية أولادها وغير ذلك",
                        "كانت تعمل في بيتها وأيضا خارج بيتها بشرط",
                        "كل الأجوبة صحيحة",
                    ],
                    "jawaban" => "كل الأجوبة صحيحة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 39,
                    "soal" => '" أما الفريق الثالث، فيرى أن العمل حق للمرأة، فتعمل عمل<b>ها</b> الأساسي في بيت<b>ها</b>، ول<b>ها</b> أن تعمل خارج بيت<b>ها</b>، بشرط أن تعمل في المجالات التي تناسبها " . ضمير "ها" يعود إلى ؟ ',
                    "pilihan" => [
                        "الفريق",
                        "المرأة",
                        "الثالث",
                        "العمل",
                    ],
                    "jawaban" => "المرأة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 40,
                    "soal" => "أفضل العنوان للفقرات السابقة:",
                    "pilihan" => [
                        "عمل الصبيان",
                        "تربية الأولاد",
                        "رفاء الأسرة",
                        "عمل المرأة",
                    ],
                    "jawaban" => "عمل المرأة",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => '
                    <p>كان أبو بكر رفيق النبي (ص) في السلم وفي الحرب وعندما مات النبي (ص) اضطرب الكثيرون ولم يصدقوا أن النبي (ص) قد مات. فخرج إليهم أبو بكر وقال لهم: "من كان يعبد محمدا فإن محمدا قد مات ومن كان يعبد الله فإن الله حي لا يموت"</p>'
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 41,
                    "soal" => "المراد ب(اضطرب) هو؟",
                    "pilihan" => [
                        "فرح",
                        "قلق",
                        "صبر",
                        "بكى",
                    ],
                    "jawaban" => "قلق",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 42,
                    "soal" => "فهمنا من تلك الفقرة أن أبا بكر؟ ",
                    "pilihan" => [
                        "صحبة النبي ",
                        "لا يبكي على وفاة النبي ",
                        "يبكي على وفاة النبي ",
                        "نهي الناس ليعبد النبي ",
                    ],
                    "jawaban" => "نهي الناس ليعبد النبي ",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 43,
                    "soal" => 'الفاعل من "اضطرب" في الجملة "وعندما مات النبي (ص) اضطرب الكثيرون ولم يصدقوا أن النبي (ص) قد ما"ت ؟ ',
                    "pilihan" => [
                        "هو",
                        "هم",
                        "النبي",
                        "الكثيرون",
                    ],
                    "jawaban" => "الكثيرون",
                ]
            ],
            [
                "tipe" => "petunjuk",
                "data" => "
                    <p>أصبح العالم – اليوم – قرية صغيرة، بسبب وسائل النقل الحديثة، ووسائل الاتصال الحديثة. كيف يعيش سكان هذه القرية الصغيرة؟ إنني أدعوك يا صاحبي لزيارة هذه القرية الصغيرة. هيا نتجول فيها، وننظر كيف يعيش سكانها. سأصحبك معي في طائرتي. إنني أملك طائرة سريعة، أسرع من الصوت. تفضل يا صاحبي، اركب الطائرة، وهيا بنا ننطلق.</p>
                    <p>نحن نطير الآن فوق دول الشمال. انظر إلى هذه الدول، إنها دول غنية، نملك القوة والعلم والمال. انظر إلى الناس، إنهم أغنياء في هذه الدول، يلبسون أجمل الثياب، وهم أصحاء، ويعيشون في بيوت جميلة. ما أكثر المدارس والجامعات والمستشفيات والمصانع والمزارع هنا! إنهم يعيشون في أمن ورخاء.</p>
                    <p>هيا نزور الجانب الآخر من العالم. هذه دول الجنوب. إنها دول فقيرة، لا تملك القوة ولا العلم ولا المال. انظر إلى هؤلاء الناس، إنهم فقراء يلبسون ثيابًا بسيطة، ويعيشون في بيوت صغيرة، ومعظمهم مرضى. ما أقل المدارس والجامعات والمستشفيات والمصانع والمزارع هنا! لماذا يتقاتل الناس في هذه البلاد؟ ولماذا ينتشر الفقر والمرض والجهل هنا؟ يا لها من حياة!</p>
                    <p>هل رأيت يا صاحبي هذه القرية الصغيرة؟! يعيش نصف سكانها في رخاء، ويعيش النصف الآخر في فقر وحرب. لماذا لا يعيش جميع سكان القرية في رخاء وأمن؟ هل سيحدث ذلك في يوم من الأيام؟  الله أعلم.</p>"
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 44,
                    "soal" => "ما العنوان المناسب للفقرات السابقة؟ ",
                    "pilihan" => [
                        "دول الشمال و دول الجنوب",
                        "ما أكثر المدارس في دول الشمال",
                        "ما أقل المدارس في دول الجنوب",
                        "كل الأجوبة خاطئة ",
                    ],
                    "jawaban" => "دول الشمال و دول الجنوب",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 45,
                    "soal" => "عرفنا الآن أنّ دول الشمال..... من دول الجنوب",
                    "pilihan" => [
                        "أكثر مجتمعا",
                        "أقل مجتمعا ",
                        "أقل تطورا",
                        "أكثر تطورا",
                    ],
                    "jawaban" => "أكثر تطورا",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 46,
                    "soal" => 'ما المرادف من كلمة "سكان" ؟',
                    "pilihan" => [
                        "مغترب",
                        "مستوطن",
                        "مختلس",
                        "مجدد",
                    ],
                    "jawaban" => "مستوطن",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 47,
                    "soal" => 'المضادة من كلمة "الحديثة"... ؟',
                    "pilihan" => [
                        "الجديدة ",
                        "الجيدة",
                        "القادمة",
                        "القديمة",
                    ],
                    "jawaban" => "القديمة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 48,
                    "soal" => 'ماذا تقصد من عبارة "يعيش نصف سكانها في رخاء" ؟',
                    "pilihan" => [
                        "يعيشون في السعادة",
                        "يعيشون في الحزن",
                        "يعيشون في الفقر",
                        "يعيشون في المسكين",
                    ],
                    "jawaban" => "يعيشون في السعادة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 49,
                    "soal" => 'الكلمة "المَدَارِس" جمع كلمة من... ؟',
                    "pilihan" => [
                        "مُدَرِّسة",
                        "مدرسان ",
                        "مدرسون",
                        "مَدْرَسة",
                    ],
                    "jawaban" => "مَدْرَسة",
                ]
            ],
            [
                "tipe" => "soal",
                "data" => [
                    "no" => 50,
                    "soal" => 'ما معنى "يحدث في الجملة "هل سيحدث ذلك في يوم من الأيام "؟',
                    "pilihan" => [
                        "يصل",
                        "يطلب",
                        "يجد",
                        "يقع",
                    ],
                    "jawaban" => "يقع",
                ]
            ],
        ];

        return $data;
    }
}

/* End of file Home.php */
