<?php

defined('BASEPATH') OR exit('No direct script access allowed');

class Soal_model extends CI_Model {

    public function get_soal_istimav1(){
        $data = 
        [
            [
                "no" => 1,
                "soal" => "هل مريم الآن في الجامعة؟",
                "pilihan" => ["لا، مريم في الجامعة", "لا، مريم في البيت", "لا، مريم في المطبخ", "لا، مريم في المسجد"],
                "jawaban" => "لا، مريم في البيت"
            ],
            [
                "no" => 2,
                "soal" => "هل مريم مسافرة؟",
                "pilihan" => ["نعم مريم مسافرة", "نعم مريم طالبة", "لا مريم في الجامعة", "لا مريم في المطعم"],
                "jawaban" => "نعم مريم مسافرة"
            ],
            [
                "no" => 3,
                "soal" => "هل العائلة بخير؟",
                "pilihan" => ["نعم ، العائلة  بخير", "نعم ، العائلة  بمرض", "لإ ، العائلة  في مرض", "لإ ،  في مستشفى"],
                "jawaban" => "نعم ، العائلة  بخير"
            ],
            [
                "no" => 4,
                "soal" => "هل محمّد مسافر إلى ألمانيا؟",
                "pilihan" => ["نعم، محمّد مسافر إلى ألمانيا", "نعم، محمّد مسافر إلى ألجزائر", "لا، محمّد مسافر إلى ألمانيا", "لا، محمّد مسافر إلى إندونيسيا"],
                "jawaban" => "لا، محمّد مسافر إلى إندونيسيا"
            ],
            [
                "no" => 5,
                "soal" => "من يذهب للتسوق؟",
                "pilihan" => ["أنا وإبراهيم", "أنا و مريم", "أنت وأحمد", "أنا وأحمد"],
                "jawaban" => "أنا وأحمد"
            ],
            [
                "no" => 6,
                "soal" => "أين السوق؟",
                "pilihan" => ["في جاكرتا", "داخل المدينة", "خارج المدينة", "وسط المدينة"],
                "jawaban" => "خارج المدينة"
            ],
            [
                "no" => 7,
                "soal" => "ماذا إشتري في المكتبة؟",
                "pilihan" => ["طعاما", "لباسا", "مشروبا", "كتبا"],
                "jawaban" => "كتبا"
            ],
            [
                "no" => 8,
                "soal" => "أين أحمد بعد التسوق؟",
                "pilihan" => ["في المقهى", "في البنك", "في الجامعة", "في المطعم"],
                "jawaban" => "في البنك"
            ],
            [
                "no" => 9,
                "soal" => "هل كانت الجامعة مشهورة؟",
                "pilihan" => ["نعم، كانت الجامعة مشهورة", "لا، كانت الجامعة غير مشهورة", "نعم، الجامعة غير مشهورة", "لا، الجامعة بسيطة"],
                "jawaban" => "نعم، كانت الجامعة مشهورة"
            ],
            [
                "no" => 10,
                "soal" => "عملت مريم كمترجمة في القنصليّة البلغاريّة",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "خطاء"
            ],
            [
                "no" => 11,
                "soal" => "قامت مريم برحلة بالطائرة",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "صحيح"
            ],
            [
                "no" => 12,
                "soal" => "عقدت مريم اجتماعات كثيرة في سويسرا وفنلندا",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "خطاء"
            ],
            [
                "no" => 13,
                "soal" => 'عندما خرجت مريم من المخرج الخاصّ بالجمارك قالت: أهلًا وسهلًا',
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "خطاء"
            ],
            [
                "no" => 14,
                "soal" => "توجد في المطعم التابع للفندق أكلات شرقيّة",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "صحيح"
            ],
            [
                "no" => 15,
                "soal" => "توجد في المدينة مساجد مشهورة",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "صحيح"
            ],
            [
                "no" => 16,
                "soal" => "الشّوارع قصيرة وعريضة.",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "خطاء"
            ],
            [
                "no" => 17,
                "soal" => "يوجد خارج المدينة مطار دوليّ",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "صحيح"
            ],
            [
                "no" => 18,
                "soal" => "توجد خارج المطار محطّة للقطارات",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "خطاء"
            ],
            [
                "no" => 19,
                "soal" => "هناك تكاسي من شركات مختلفة",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "صحيح"
            ],
            [
                "no" => 20,
                "soal" => "في المطار طائرات من بلدان عربيّة قليلة",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "خطاء"
            ],
            [
                "no" => 21,
                "soal" => "الطّائرات ليست من الإمارات والكويت",
                "pilihan" => ["صحيح", "خطاء"],
                "jawaban" => "صحيح"
            ],
            [
                "no" => 22,
                "soal" => "هل توجد في المدينة بيوت صغيرة؟",
                "pilihan" => ["نعم، توجد في المدينة بيوت كبيرة", "لا، توجد في المدينة بيوت كبيرة", "نعم المدنية صغيرة", "ليس في المدينة بيوت"],
                "jawaban" => "لا، توجد في المدينة بيوت كبيرة"
            ],
            [
                "no" => 23,
                "soal" => "هل يوجد خارج المدينة مطار دوليّ كبير وجديد؟",
                "pilihan" => ["نعم، يوجد خارج المدينة مطار دوليّ كبير وجديد", "لا،  يوجد في المدينة مطار دوليّ كبير وجديد", "نعم، يوجد داخل المدينة مطار دولي كبير", "لا، يوجد في المدينة محطات الباصات"],
                "jawaban" => "لا،  يوجد في المدينة مطار دوليّ كبير وجديد"
            ],
            [
                "no" => 24,
                "soal" => "هل داخل المطار محطّة للباصات؟",
                "pilihan" => ["نعم، داخل المطار محطّة للباصات", "لا، داخل المطار موقف للباصات", "نعم، خارج المطار محطة للقطار", "لا، ليس في المطار الباصات"],
                "jawaban" => "لا، داخل المطار موقف للباصات"
            ],
            [
                "no" => 25,
                "soal" => "هل هناك سيّارات تكسي من شركات مختلفة؟",
                "pilihan" => ["نعم،هناك سيّارات تكسي من شركات مختلفة", "نعم، هناك سيارات تكسي من شركة واحدة", "لا، هناك سيّارات تكسي من شركات موحدة", "لا، ليس هناك سيارات تكسي"],
                "jawaban" => "نعم،هناك سيّارات تكسي من شركات مختلفة"
            ],
            [
                "no" => 26,
                "soal" => "هل توجد داخل المطار أيضًا محلّات للملابس وللكمبيوتر ومطاعم ومخابز؟",
                "pilihan" => ["نعم، توجد داخل المطار أيضًا محلّات للملابس وللكمبيوتر ومطاعم ومخابز", "نعم، خارج المطار محلات للملابس وللكمبيوتر ومطاعم ومخابز", "لا،لم توجد داخل المطار أيضًا محلّات للملابس وللكمبيوتر ومطاعم ومخابز", "لا، ليس في المطار محلات"],
                "jawaban" => "نعم، توجد داخل المطار أيضًا محلّات للملابس وللكمبيوتر ومطاعم ومخابز"
            ],
            [
                "no" => 27,
                "soal" => "هل توجد في المطار طائرات من بلدان أوربّيّة؟",
                "pilihan" => ["نعم، توجد في المطار طائرات من بلدان أوربّيّة", "نعم، في المطار طائرات من اليبن", "لا، توجد في المطار طائرات من بلدان أوربّيّة", "لا، في المطار طائرات من بلدن العربية"],
                "jawaban" => "نعم، توجد في المطار طائرات من بلدان أوربّيّة"
            ],
            [
                "no" => 28,
                "soal" => "متى يتم الحوار بين ماريا وأسعد؟ ",
                "pilihan" => ["الصباح", "النهار", "المساء", "العصر"],
                "jawaban" => "النهار"
            ],
            [
                "no" => 29,
                "soal" => "أين درس أسعد؟ ",
                "pilihan" => ["جامعة الأحقاف", "جامعة القرويين", "جامعة ال سعود", "جامعة الأزهر"],
                "jawaban" => "جامعة الأزهر"
            ],
            [
                "no" => 30,
                "soal" => "هؤلاء عندهم الذين عندهم الرخصة في ترك الصوم، إلا... ",
                "pilihan" => ["المسافرين", "الرجال", "النساء", "الشيوخ"],
                "jawaban" => "الرجال"
            ],
            [
                "no" => 31,
                "soal" => "ما هي الفكرة الرئيسية لذاك الحوار؟ ",
                "pilihan" => ["معرفة الاسلام", "معنى الصوم", "شمولية الاسلام", "معنى الجهاد"],
                "jawaban" => "معرفة الاسلام"
            ],
            [
                "no" => 32,
                "soal" => "متى أفضل الأوقات لأداء زكاة الفطر؟ ",
                "pilihan" => ["أول شهر رمضان", "وسط شهر رمضان", "نهاية شهر رمضان", "بعد صلاة العيد"],
                "jawaban" => "نهاية شهر رمضان"
            ],
            [
                "no" => 33,
                "soal" => "ما معنى الجهاد الحقيقي؟ ",
                "pilihan" => ["حضور المسلم في المعركة", "بذل الجهد في تطبيق السلام", "الحرب المقدس", "كل جواب خطاء"],
                "jawaban" => "بذل الجهد في تطبيق السلام"
            ],
            [
                "no" => 34,
                "soal" => "كم مدة يحب أحمد بالسفر؟ ",
                "pilihan" => ["لمدة 8 أو 9 أيام", "لمدة 8 أو 10 أيام", "لمدة 7 أو 9 أيام", "لمدة 7 أو 10 أيام"],
                "jawaban" => "لمدة 7 أو 10 أيام"
            ],
            [
                "no" => 35,
                "soal" => "أين موقع الحوار السابق؟ ",
                "pilihan" => ["المطار الدولي", "ف رنسا", "مكتب السفر", "لندن"],
                "jawaban" => "مكتب السفر"
            ],
            [
                "no" => 36,
                "soal" => "لماذا يحب أحمد إلى لندن؟ ",
                "pilihan" => ["لحضور اللقاء السنوي", "حضور مؤتمر", "لطول المشوار", "لعمل الشركة"],
                "jawaban" => "لحضور اللقاء السنوي"
            ],
            [
                "no" => 37,
                "soal" => "بكم ثمن التذكرة؟ ",
                "pilihan" => ["ألف وسبعة دنانير", "ألف وأربعة دنانير", "ألف وتسعة دنانير", "ألف وثمانية دنانير"],
                "jawaban" => "ألف وتسعة دنانير"
            ],
            [
                "no" => 38,
                "soal" => "أين كانت مريم حين ذاك؟ ",
                "pilihan" => ["المطار", "الجامعة", "البنك", "الفندق"],
                "jawaban" => "الفندق"
            ],
            [
                "no" => 39,
                "soal" => "بأي وسائل يتكلم أحمد؟ ",
                "pilihan" => ["بالسيارة", "بالجوال", "بالسيف", "بالقلب"],
                "jawaban" => "بالجوال"
            ],
            [
                "no" => 40,
                "soal" => "ماالمقصود بهذا الكلام : وانت رايح إلى أين غدا؟ ",
                "pilihan" => ["أين تجيء غدا", "أين تأكل غدا", "أين تقعد غدا", "أين تذهب غدا"],
                "jawaban" => "أين تذهب غدا"
            ],
        ];

        return $data;
    }    

    public function get_soal_tarakibv1(){
        $data = 
        [
            [
                "no" => 1,
                "soal" => "خرج الضيوف مسرورين. كلمة مسرورين هي؟",
                "pilihan" => [
                    "تميير",
                    "مفعول",
                    "بدل",
                    "حال",
                ],
                "jawaban" => "حال"
            ],
            [
                "no" => 2,
                "soal" => "الإمام أبو حنيفة النعمان بن ثابت ولد في مد ينة الكوفة سنة ثمانين هجرية، و توفي سنة مائة و خمسين. و هو أول أئمة الأربعة ميلادا و أسبقهم وفاة. و كان رحمه الله رجلا عظيما في أكثر من جهة. كان ناجحا في سعيه لحياته و دنياه، كان فقيه العراق، و إمام أهل الرأي. أدركنا الباعث الذي بعث عبد الله بن مبارك أن يقول: في أبي حنيفة أنه مخ العلم . مفرد من كلمة  أئمة ؟",
                "pilihan" => [
                    "أمم",
                    "عمة",
                    "أعوام",
                    "إمام",
                ],
                "jawaban" => "إمام"
            ],
            [
                "no" => 3,
                "soal" => "الإمام أبو حنيفة النعمان بن ثابت ولد في مد ينة الكوفة سنة ثمانين هجرية، و توفي سنة مائة و خمسين. و هو أول أئمة الأربعة ميلادا و أسبقهم وفاة. و كان رحمه الله رجلا عظيما في أكثر من جهة. كان ناجحا في سعيه لحياته و دنياه، كان فقيه العراق، و إمام أهل الرأي. أدركنا الباعث الذي بعث عبد الله بن مبارك أن يقول: في أبي حنيفة أنه مخ العلم . كلمة أبو حنيفة في الفقة السابقة هي؟",
                "pilihan" => [
                    "بدل",
                    "فاعل",
                    "تمييز",
                    "مبتدأ",
                ],
                "jawaban" => "بدل"
            ],
            [
                "no" => 4,
                "soal" => "الإمام أبو حنيفة النعمان بن ثابت ولد في مد ينة الكوفة سنة ثمانين هجرية، و توفي سنة مائة و خمسين. هجرية في هذه الجملة؟",
                "pilihan" => [
                    "تمييز",
                    "حال",
                    "عطف",
                    "توكيد",
                ],
                "jawaban" => "تمييز"
            ],
            [
                "no" => 5,
                "soal" => "و هو أول أئمة الأربعة ميلادا و أسبقهم وفاة. أين الخبر من هذه الجملة؟",
                "pilihan" => [
                    "أول أئمة الأربعة",
                    "وهو",
                    "ميلادا",
                    "وفاة",
                ],
                "jawaban" => "أول أئمة الأربعة"
            ],
            [
                "no" => 6,
                "soal" => 'مفهوم الحرية في الإسلام : يقوم على مبدأ أساس يمكن تلخصه في أن " الناس كل الناس يولدون إحرارا و أن الله هو وحده واهب هذه الحرية، و أن حرية الناس في الحياة مطلقة وفي كل شيئ، و تبقى مطلقة و لم تصطدم بالحق أو بالمصلحة العامة. وربما أهم القضايا في قضية حر ية العقيدة و حرية التدين. و الحديث في هذه القضية أو هذا النوع من الحريات حديث طويل : لأ نه أوسع دوائر الحريات في الإسلام . إعراب كلمة  احرارا؟',
                "pilihan" => [
                    "منصوب",
                    "مجرور",
                    "مجزوم",
                    "مرفوع",
                ],
                "jawaban" => "منصوب"
            ],
            [
                "no" => 7,
                "soal" => 'أن حرية الناس في الحياة مطلقة وفي كل شيئ، و تبقى مطلقة و لم تصطدم بالحق أو بالمصلحة العامة. إعراب "حرية" في هذه الجملة؟',
                "pilihan" => [
                    "منصوب",
                    "مجرور",
                    "مجزوم",
                    "مرفوع",
                ],
                "jawaban" => "منصوب"
            ],
            [
                "no" => 8,
                "soal" => "مفرد من كلمة القضايا؟",
                "pilihan" => [
                    "القضية",
                    "القاضاة",
                    "القضات",
                    "القضة",
                ],
                "jawaban" => "القضية"
            ],
            [
                "no" => 9,
                "soal" => 'لأنه أوسع دوائر الحريات في الإسلام . كلمة "أوسع"؟',
                "pilihan" => [
                    "اسم تفضيل",
                    "اسم فاعل",
                    "اسم مقصور",
                    "اسم مفعول",
                ],
                "jawaban" => "اسم تفضيل"
            ],
            [
                "no" => 10,
                "soal" => "يرجع الطلاب من المدرسة مساء، .... يركبون الحافلات",
                "pilihan" => [
                    "هم",
                    "هن",
                    "هما",
                    "هي",
                ],
                "jawaban" => "هم"
            ],
            [
                "no" => 11,
                "soal" => "سلمى وصفية تذهبان إلى المقصف في الإستراحة . .... تريدان أن تشتريا الكعك",
                "pilihan" => [
                    "هم",
                    "هن",
                    "هما",
                    "أنتما",
                ],
                "jawaban" => "هما"
            ],
            [
                "no" => 12,
                "soal" => 'مصطفى طالب ماهر في علم الطبيعة والرياضيات . كلمة "ماهر" في هذه الجملة؟',
                "pilihan" => [
                    "مبتدأ",
                    "خبر",
                    "نعت",
                    "بدل",
                ],
                "jawaban" => "نعت"
            ],
            [
                "no" => 13,
                "soal" => "الممرضون في هذا المستشفى......... بالآداب الإسلامية عند التعامل المباشر مع المرضى.",
                "pilihan" => [
                    "يتحلى",
                    "يتحلون",
                    "تتحلى",
                    "تتحلون",
                ],
                "jawaban" => "يتحلون"
            ],
            [
                "no" => 14,
                "soal" => "عيّن الجملة الصحيحة من هذه الجملة التالية ",
                "pilihan" => [
                    "المسلمون يصومان في شهر رمضان",
                    "الفتاة يسافرون إلى الجبل للرحلة",
                    "الجو بارد هذه الأيام",
                    "الشباب تذهبون إلى الملعب لممارسة الرياضة",
                ],
                "jawaban" => "الجو بارد هذه الأيام"
            ],
            [
                "no" => 15,
                "soal" => "السؤال: ........ هاشم وصلاح وفاطمة صباح اليوم إلى جاكرتا لمشاركة مسا بقة الخطابة",
                "pilihan" => [
                    "تسافر",
                    "يسافرون",
                    "سافروا",
                    "سافر",
                ],
                "jawaban" => "سافر"
            ],
            [
                "no" => 16,
                "soal" => "أيها الفتيات، ..... الكراسي بعد عمل الواجبات.",
                "pilihan" => [
                    "رتّبي",
                    "رتّبوا",
                    "رتّب",
                    "رتّبن",
                ],
                "jawaban" => "رتّبن"
            ],
            [
                "no" => 17,
                "soal" => "قام المهدسون بتطوير إمكا نيات الروبوتات طوال الوقت، حيث يمكن استخدامها كوسيلة استكشافية بديلة عن البشر . الفاعل لهذه العبارة هما؟",
                "pilihan" => [
                    "المهندسون، استخدامها",
                    "وسيلة، الربوتات",
                    "إمكانيات، البشر",
                    "المهندسون، البشر",
                ],
                "jawaban" => "المهندسون، استخدامها"
            ],
            [
                "no" => 18,
                "soal" => 'بات الحارس ساهرا . كلمة "ساهرا؟',
                "pilihan" => [
                    "مفعول فيه",
                    "مفعول به",
                    "اسم بات",
                    "خبر بات",
                ],
                "jawaban" => "خبر بات"
            ],
            [
                "no" => 19,
                "soal" => 'تعرّف الصِّحة بأنها حالة الإنسان دون أي مَرَض أو دَاء، وهي تشمل الصِّحة العقليَّة والإجتماعية والبدنية . كلمة "الصِّحة"؟',
                "pilihan" => [
                    "فاعل",
                    "نائب الفاعل",
                    "مبتدأ",
                    "خبر",
                ],
                "jawaban" => "نائب الفاعل"
            ],
            [
                "no" => 20,
                "soal" => 'قال تعالى   إن الله وملائكته يصلون على النبي يا أيها الذين آمنوا صلوا عليه وسلموا تسليما  . كلمة "يصلون؟',
                "pilihan" => [
                    "مبتدأ مؤخر",
                    "اسم إن",
                    "خبر إن",
                    "فاعل",
                ],
                "jawaban" => "خبر إن"
            ],
            [
                "no" => 21,
                "soal" => "تأتى من موصولة، إلا ..؟",
                "pilihan" => [
                    "ومن الناس من يقول آمنّا بالله",
                    "لا صلاة لمن لم يقرأ بفاتحة الكتاب",
                    "إن الله لا يضيع أجر من أحسن عملا",
                    "من يجتهد ينجح",
                ],
                "jawaban" => "من يجتهد ينجح"
            ],
            [
                "no" => 22,
                "soal" => "حضرت الطالبات ... فزن بالمسابقة.",
                "pilihan" => [
                    "الذين",
                    "الذي",
                    "التي",
                    "اللاتي",
                ],
                "jawaban" => "اللاتي"
            ],
            [
                "no" => 23,
                "soal" => 'إند ونيسيا جمهرية تقع في المحيط الهادئ، وتعد من أكبر الدول الإسلامية سكانا . كلمة"سكانا"......؟',
                "pilihan" => [
                    "مفعول به",
                    "حال",
                    "مفعول له",
                    "تمييز",
                ],
                "jawaban" => "تمييز"
            ],
            [
                "no" => 24,
                "soal" => 'رجعت الطالبات إلى المعهد بعد العطلة مسرورات . كلمة " مسرورات؟',
                "pilihan" => [
                    "مفعول به",
                    "حال",
                    "مفعول له",
                    "تمييز",
                ],
                "jawaban" => "حال"
            ],
            [
                "no" => 25,
                "soal" => "يذهب محمد إلى السوق المركزي مبكرا . هو يريد أن يشتري قلنسوة؟",
                "pilihan" => [
                    "الأسود",
                    "سوداء",
                    "السوداء",
                    "أسود",
                ],
                "jawaban" => "سوداء"
            ],
            [
                "no" => 26,
                "soal" => "من أهم العلماء الذين احتلوا مكانة عالية في .... ابن الهثيم، حيث اخترع الكاميرا",
                "pilihan" => [
                    "العالم الاختراعات",
                    "العالم  اختراعات",
                    "عالم الاختراعات",
                    "عالم الاختراع",
                ],
                "jawaban" => "عالم الاختراعات"
            ],
            [
                "no" => 27,
                "soal" => "أحمد مشغول في الجامعة وهذا اليوم لديه....؟",
                "pilihan" => [
                    "أربعة حصة",
                    "أربعة حصص",
                    "أربع حصة",
                    "أربع حصص",
                ],
                "jawaban" => "أربع حصة"
            ],
            [
                "no" => 28,
                "soal" => "ستبدأ المحاضرة عن السياسة الإسلامية في ( 07.15 )  صباحا",
                "pilihan" => [
                    "السابعة والنصف",
                    "السابعة والخمس",
                    "السابعة والربع",
                    "السابعة والثلث",
                ],
                "jawaban" => "السابعة والربع"
            ],
            [
                "no" => 29,
                "soal" => "وافقت الملكة .... خطة التطوير التي قدمها مجلس النواب .",
                "pilihan" => [
                    "إلى",
                    "من",
                    "على",
                    "عن",
                ],
                "jawaban" => "على"
            ],
            [
                "no" => 30,
                "soal" => "استخدام أسماء الخمسة الصحيحة في الجمل الآتية هو؟",
                "pilihan" => [
                    "اشترك أخيك في المؤتمر الدولي بالجامعة",
                    "كرّم المدير أخا صديقي بالحفل",
                    "يحب عادل أخوه حبا جما",
                    "هل هو أخيك يا حسان؟",
                ],
                "jawaban" => "كرّم المدير أخا صديقي بالحفل"
            ],
            [
                "no" => 31,
                "soal" => "ذبح محمد عشرين بقرة. عيّن المفعول من الجملة السابقة؟",
                "pilihan" => [
                    "ذبح",
                    "محمد",
                    "عشرين",
                    "بقرة",
                ],
                "jawaban" => "عشرين"
            ],
            [
                "no" => 32,
                "soal" => "زرت خمسة فصول في المدرسة. إعراب فصول؟",
                "pilihan" => [
                    "مرفوع",
                    "منصوب",
                    "مجرور",
                    "مجزوم",
                ],
                "jawaban" => "مجرور"
            ],
            [
                "no" => 33,
                "soal" => "إشترى علي الكتاب بثمن مائة ..... روبية",
                "pilihan" => [
                    "ألفا",
                    "ألف",
                    "آلاف",
                    "آلافا",
                ],
                "jawaban" => "ألف"
            ],
            [
                "no" => 34,
                "soal" => "أكلت عائشة تفاحا. جمع كلمة تفاح ... ؟",
                "pilihan" => [
                    "تفاحون",
                    "أتحفة",
                    "تفافيح",
                    "تفاحات",
                ],
                "jawaban" => "تفافيح"
            ],
            [
                "no" => 35,
                "soal" => "علامة إعراب الرفع لجمع مذكر السالم ..؟",
                "pilihan" => [
                    "نون",
                    "واو",
                    "ياء",
                    "ضمة",
                ],
                "jawaban" => "واو"
            ],
            [
                "no" => 36,
                "soal" => "عين أين الجملة الصحيحة من هذه الأمثلة؟",
                "pilihan" => [
                    "زار المسلمون مساجد كبيرة في أوروبا",
                    "زار المسلمون مساجد كبيرا في أوروبا",
                    "زار المسلمون مساجد كبيرين في أوروبا",
                    "زار المسلمون مساجد كبيرون  في أوروبا",
                ],
                "jawaban" => "زار المسلمون مساجد كبيرة في أوروبا"
            ],
            [
                "no" => 37,
                "soal" => "هذا الطعام يحتوي ...... المواد الكيميائية",
                "pilihan" => [
                    "على",
                    "لـ",
                    "من",
                    "عن",
                ],
                "jawaban" => "على"
            ],
            [
                "no" => 38,
                "soal" => "هؤلاء الطلاب قادرون ....... رفع الأحجار سريعا.",
                "pilihan" => [
                    "على",
                    "لـ",
                    "من",
                    "عن",
                ],
                "jawaban" => "على"
            ],
            [
                "no" => 39,
                "soal" => "كانت فاطمة تحب والديها ورغب .......  مساعدة الأعمال اليومية. ",
                "pilihan" => [
                    "في",
                    "لـ",
                    "من",
                    "عن",
                ],
                "jawaban" => "في"
            ],
            [
                "no" => 40,
                "soal" => "قرأ الأستاذ .... كتاب هذا الشهر",
                "pilihan" => [
                    "100",
                    "10",
                    "13",
                    "50",
                ],
                "jawaban" => "100"
            ]
        ];

        return $data;
    }

    public function get_soal_qiroahv1(){
        $data = [
            [
                "no" => '1',
                "soal" => 'ما مهنة الأب؟ ',
                "pilihan" => [
                    "معلم",
                    "طبيب",
                    "محاضر",
                    "مهندس",
                ],
                "jawaban" => "طبيب"
            ],
            [
                "no" => '2',
                "soal" => 'ماذا تعمل الأخت؟ ',
                "pilihan" => [
                    "الأخت طالبة في الجامعة الإسلاميّة",
                    "الأخت مدرسة في الجامعة الإسلامية",
                    "الأخت عاملة في الجامعة الإسلامية",
                    "الأخت باحثة في الجامعة الإسلامية",
                ],
                "jawaban" => "الأخت طالبة في الجامعة الإسلاميّة"
            ],
            [
                "no" => '3',
                "soal" => 'ماذا أمام البيت؟ ',
                "pilihan" => [
                    "مركز كبير",
                    "شجرة كبيرة",
                    "بيت كبير",
                    "حديقة كبيرة",
                ],
                "jawaban" => "حديقة كبيرة"
            ],
            [
                "no" => '4',
                "soal" => 'هل في الغرفة مكتب قديم وكرسي من بلاستيك',
                "pilihan" => [
                    "نعم، في الغرفة مكتب قديم وكرسي من بلاستيك",
                    "نعم، في الغرفة مكتب جديد وكرسي من بلاستيك",
                    "لا، في الغرفة مكتب قديم وكرسي من حديد",
                    "لا، لا شيء في الغرفة",
                ],
                "jawaban" => "نعم، في الغرفة مكتب قديم وكرسي من بلاستيك"
            ],
            [
                "no" => '5',
                "soal" => 'كيف كان السرير في الغرفة؟  ',
                "pilihan" => [
                    "كان السرير في الغرفة كبير",
                    "كان السرير في الغرفة قديم",
                    "كان السرير في الغرفة جديد",
                    "كان السرير في الغرفة صغير",
                ],
                "jawaban" => "كان السرير في الغرفة كبير",
            ],
            [
                "no" => '6',
                "soal" => 'كيف كانت الجامعة؟ ',
                "pilihan" => [
                    "الجامعة الإسلاميّة الحكوميّة جامعة مشهورة",
                    "الجامعة الإسلاميّة الحكوميّة جامعة صغيرة",
                    "الجامعة الإسلاميّة الحكوميّة جامعة بعيدة",
                    "الجامعة الإسلاميّة الحكوميّة جامعة عالمية",
                ],
                "jawaban" => "الجامعة الإسلاميّة الحكوميّة جامعة مشهورة",
            ],
            [
                "no" => '7',
                "soal" => 'أين أحمد حينما كنت في المقهى؟ ',
                "pilihan" => [
                    "في الشوق",
                    "في البنك",
                    "في الجامعة",
                    "في تكسي",
                ],
                "jawaban" => "في البنك",
            ],
            [
                "no" => '8',
                "soal" => 'إلى أين مشينا لأول المرة؟ ',
                "pilihan" => [
                    "الجامعة",
                    "البنك",
                    "المقهى",
                    "المكتبة",
                ],
                "jawaban" => "المكتبة"
            ],
            [
                "no" => '9',
                "soal" => 'كان السوق خارج المدينة.',
                "pilihan" => [
                    "نعم، كان السوق خارج المدينة",
                    "نعم، كان السوق داخل المدينة",
                    "لا، كان السوق بين المدينتين",
                    "لا، كان السوق وسط المدينة",
                ],
                "jawaban" => "نعم، كان السوق خارج المدينة",
            ],
            [
                "no" => '10',
                "soal" => 'أي مراكز تابعة للجامعة الإسلاميّة الحكوميّة؟ ',
                "pilihan" => [
                    "مراكز خاصّة بالإقتصادية",
                    "مراكز خاصّة بالإجتماية",
                    "مراكز خاصّة بالبيئة",
                    "مراكز خاصّة بالطلاب",
                ],
                "jawaban" => "مراكز خاصّة بالبيئة",
            ],
            [
                "no" => '11',
                "soal" => 'هل صباح رايحة إلى مركز المدينة؟',
                "pilihan" => [
                    "لا، صباح رايحة إلى مركز الدائرة",
                    "لا، صباح رايحة إلى المجمع الإستهلاكي",
                    "نعم، صباح رايحة إلى مركز المدينة",
                    "نعم، صباح رايحة إلى مركز المدينة المنورة",
                ],
                "jawaban" => "لا، صباح رايحة إلى المجمع الإستهلاكي",
            ],
            [
                "no" => '12',
                "soal" => 'أين كانت صباح اليوم؟',
                "pilihan" => [
                    "المجمع الإستهلاكي",
                    "المطار",
                    "السوق المركزي",
                    "الجامعة",
                ],
                "jawaban" => "الجامعة",
            ],
            [
                "no" => '13',
                "soal" => 'متى وصلت مريم إلى المطار؟',
                "pilihan" => [
                    "مريم وصلت قبل يومين",
                    "مريم وصلت قبل ساعتين",
                    "مريم وصلت أمس",
                    "مريم وصلت قبل اليوم",
                ],
                "jawaban" => "مريم وصلت قبل ساعتين",
            ],
            [
                "no" => '14',
                "soal" => 'هل أكل مريم وأحمد من البوفيه الفرنسيّ في المطعم؟',
                "pilihan" => [
                    "لا، أكل مريم وأحمد من البوفيه الشرقيّ",
                    "لا،  أكل مريم وأحمد من البوفيه السين",
                    "نعم، أكل مريم وأحمد من البوفيه الفرنسي",
                    "نعم،  أكل مريم وأحمد من البوفيه السعود",
                ],
                "jawaban" => "لا، أكل مريم وأحمد من البوفيه الشرقيّ",
            ],
            [
                "no" => '15',
                "soal" => 'هل عرفت صباح المشروع الماليّ؟',
                "pilihan" => [
                    "درست صباح عن الإجتماعية",
                    "درست صباح عن المشروع المالي",
                    "درست صباح عن المشروع الدينية",
                    "درست صباح عن الدينية",
                ],
                "jawaban" => "درست صباح عن المشروع المالي",
            ],
            [
                "no" => '16',
                "soal" => 'ماذا عملت مريم في البداية؟',
                "pilihan" => [
                    "معلمة",
                    "مترجمة",
                    "مهندسة",
                    "مديرة",
                ],
                "jawaban" => "مترجمة",
            ],
            [
                "no" => '17',
                "soal" => 'هل هناك علاقات تجاريّة بين فرنسا والبلدان العربيّة؟',
                "pilihan" => [
                    "لا، ليس هناك علاقات تجارية بين فرنسا والبلدان العربية",
                    "نعم،  هناك علاقات تجارية بين فرنسا والبلدان العربية",
                    "لا،  هناك علاقات دينية بين فرنسا والبلدان العربية",
                    "نعم، هناك علاقات دينية بين فرنسا والبلدان العربية",
                ],
                "jawaban" => "نعم،  هناك علاقات تجارية بين فرنسا والبلدان العربية",
            ],
            [
                "no" => '18',
                "soal" => 'إلى أين ذهبت مريم قبل شهر؟',
                "pilihan" => [
                    "ذهبت مريم قبل شهر إلى سويسرا وفرنسا",
                    "ذهبت مريم قبل شهر إلى المانيا",
                    "ذهبت مريم قبل شهر إلى السعودية",
                    "ذهبت مريم قبل شهر إلى سين",
                ],
                "jawaban" => "ذهبت مريم قبل شهر إلى سويسرا وفرنسا",
            ],
            [
                "no" => '19',
                "soal" => 'من ترجم رسائل ومذكّرات دبلوماسيّة كثيرة؟',
                "pilihan" => [
                    "عائشة",
                    "زينب",
                    "ماريا",
                    "مريم",
                ],
                "jawaban" => "مريم",
            ],
            [
                "no" => '20',
                "soal" => 'هل شربت مريم القهوة مع الحليب؟',
                "pilihan" => [
                    "نعم، شربت مريم القهوة مع الحليب",
                    "نعم، شربت مريم القهوة مع السكر",
                    "لا، شربت مريم القهوة",
                    "لا، شربت مريم الشاي",
                ],
                "jawaban" => "لا، شربت مريم الشاي",
            ],
            [
                "no" => '21',
                "soal" => 'عاد الناس إلى القرية غاضبين لأن.... ؟',
                "pilihan" => [
                    "الراعي يضحك عند حضور الناس",
                    "الذئب قد هجم الأغنام",
                    "هم كاذبون على الراعي",
                    "الراعي قد كذب عليهم",
                ],
                "jawaban" => "الراعي قد كذب عليهم",
            ],
            [
                "no" => '22',
                "soal" => 'ماذا تأكل الأغنام؟',
                "pilihan" => [
                    "الأعشاب",
                    "الأطعمة",
                    "الذئب",
                    "الشجرة",
                ],
                "jawaban" => "الأعشاب",
            ],
            [
                "no" => '23',
                "soal" => 'ما الذي هجم الغنم؟',
                "pilihan" => [
                    "الراعي",
                    "الذئب",
                    "الناس",
                    "أهل القرية",
                ],
                "jawaban" => "الذئب", 
            ],
            [
                "no" => '24',
                "soal" => 'اسم المكان الذي يتجه إليه الراعي؟',
                "pilihan" => [
                    "القرية",
                    "المزرعة",
                    "المرعى",
                    "الغابة",
                ],
                "jawaban" => "المرعى",
            ],
            [
                "no" => '25',
                "soal" => 'متى يعود الراعي مع أغنامه إلى القرية؟',
                "pilihan" => [
                    "المساء",
                    "الصباح الباكر",
                    "اليوم التالي",
                    "الليل",
                ],
                "jawaban" => "المساء",
            ],
            [
                "no" => '26',
                "soal" => 'كل واحد من أهل القرية يحمل عصا بيده لأن..؟ ',
                "pilihan" => [
                    "هم غاضبون على الراعي",
                    "الذئب هجم على الراعي والأغنام",
                    "أهل القرية يريدون أن يساعدوا الراعي",
                    "الراعي يصرخ: ادركوني...",
                ],
                "jawaban" => "الراعي يصرخ: ادركوني...",
            ],
            [
                "no" => '27',
                "soal" => 'لم يحضر أهل القرية ليسلموا الراعي لأن..؟',
                "pilihan" => [
                    "هم يسمعون نداء الراعي",
                    "الذئب هجم على الأغنام",
                    "الراعي كذب على أهل القرية",
                    "أهل القرية يتكسلون",
                ],
                "jawaban" => "الراعي كذب على أهل القرية",
            ],
            [
                "no" => '28',
                "soal" => 'كيف الراعي عندما يأتي أهل القرية وفي أيديهم العصا؟ ',
                "pilihan" => [
                    "يصرخ بصوت عال",
                    "يتكلم معهم",
                    "يضحك",
                    "يعود إلى القرية",
                ],
                "jawaban" => "يضحك",
            ],
            [
                "no" => '29',
                "soal" => 'تنتشر الأغنام وتنتقل من مكان إلى آخر ل..... ',
                "pilihan" => [
                    "تأكل العشب",
                    "تهجم على الذئب",
                    "تعود إلى القرية",
                    "تطلب الطعام",
                ],
                "jawaban" => "تأكل العشب",
            ],
            [
                "no" => '30',
                "soal" => 'الرجل الذي كانت حرفته رعي الأغنام يسمى بـــ ... ؟',
                "pilihan" => [
                    "أهل الغنم",
                    "الراعي",
                    "صاحب الغنم",
                    "حارس الغنم",
                ],
                "jawaban" => "الراعي",
            ],
            [
                "no" => '31',
                "soal" => 'يركب محمد القطار، وجاء الجائي إليه ليفتش منه...',
                "pilihan" => [
                    "التذاكر",
                    "الجائزة",
                    "التذكرة",
                    "النقود",
                ],
                "jawaban" => "التذكرة",
            ],
            [
                "no" => '32',
                "soal" => 'في مرحلة المراهقة ينمو ...... والعقل نموا سريعا',
                "pilihan" => [
                    "القلب",
                    "العمل",
                    "الفكر",
                    "الجسم",
                ],
                "jawaban" => "الجسم",
            ],
            [
                "no" => '33',
                "soal" => 'يقوم ...... بقراءة الأنباء المحلية كل الصباح',
                "pilihan" => [
                    "الكاتب",
                    "القارئ",
                    "الناشر",
                    "المذيع",
                ],
                "jawaban" => "المذيع",
            ],
            [
                "no" => '34',
                "soal" => 'الخادمة تعمل الطعام كل الصباح في المطبخ وبعد أن يكون الطعام جاهزا وضعته الخادمة على المائدة. ماذا تعمل الخادمة في غرفة الطعام؟',
                "pilihan" => [
                    "تجهز الطعام",
                    "تشتري الخضروات",
                    "تأخذ الصحن",
                    "تنظف المائدة",
                ],
                "jawaban" => "تجهز الطعام",
            ],
            [
                "no" => '35',
                "soal" => 'إبراهيم يركب السيارة إلى الشركة التي يعمل بها، كانت الطريق مزدحمة بآلات المواصلات. تسير السيارة في ....؟',
                "pilihan" => [
                    "الميدان",
                    "الطارق",
                    "الطريق",
                    "البحر",
                ],
                "jawaban" => "الطريق",
            ],
            [
                "no" => '36',
                "soal" => 'نستطيع أن نعرف الأخبار الدولية الحديثة من صديقنا ....؟',
                "pilihan" => [
                    "المهندس",
                    "المحامي",
                    "المدرس",
                    "الصحافي",
                ],
                "jawaban" => "الصحافي",
            ],
            [
                "no" => '37',
                "soal" => 'قام ..... بالدفاع عن المتهم في المحكمة',
                "pilihan" => [
                    "القاضي",
                    "الصحافي",
                    "الشرطي",
                    "المحامي",
                ],
                "jawaban" => "المحامي",
            ],
            [
                "no" => '38',
                "soal" => 'قبل السفر بالطائرة يشتري المسافر تذكرة السفر من .....',
                "pilihan" => [
                    "مكتب الطيران",
                    "المقصف",
                    "دكان المطار",
                    "الصيدلية",
                ],
                "jawaban" => "مكتب الطيران",
            ],
            [
                "no" => '39',
                "soal" => 'يأخذ الرجل الأغنام إلى أطراف القرية حيث تأكل العشب الأخضر، الرجل هو....',
                "pilihan" => [
                    "صاحب الغنم",
                    "الراعي",
                    "حارس الغنم",
                    "تاجر الغنم",
                ],
                "jawaban" => "الراعي",
            ],
            [
                "no" => '40',
                "soal" => 'دعا الملك الرجل ليبني له القصر، وأخذ الرجل يفكر ثم يضع خطة دقيقة، الرجل هو....',
                "pilihan" => [
                    "العامل",
                    "المبنى",
                    "المفكر",
                    "المهندس",
                ],
                "jawaban" => "المهندس",
            ],
            [
                "no" => '41',
                "soal" => '(أسس) الرسول أول مسجد للمسلمين في المدينة ',
                "pilihan" => [
                    "هدم",
                    "قام",
                    "صنع",
                    "بنى",
                ],
                "jawaban" => "بنى",
            ],
            [
                "no" => '42',
                "soal" => '(يقود) عصام سيارته إلى الشركة التي يعمل بها موظفا',
                "pilihan" => [
                    "يأخذ",
                    "يركب",
                    "يصعد",
                    "يسوق",
                ],
                "jawaban" => "يسوق",
            ],
            [
                "no" => '43',
                "soal" => 'أرسل الكسرى (الوفد) إلى أمير المؤمنين ليعرف ما يريد المسلمون',
                "pilihan" => [
                    "الخادم",
                    "الجندي",
                    "المبعوث",
                    "رجال الدولة",
                ],
                "jawaban" => "المبعوث",
            ],
            [
                "no" => '44',
                "soal" => 'للانسان (مشاكله) ومشاغله في الحياة',
                "pilihan" => [
                    "العراقل",
                    "الأمور",
                    "المسائل",
                    "الصعوبات",
                ],
                "jawaban" => "المسائل",
            ],
            [
                "no" => '45',
                "soal" => 'بعد انتهاء الامتحان الوطني قامت المدرسة ب (رحلة) إلى شاطئ البحر',
                "pilihan" => [
                    "الاطلاع",
                    "الذهاب",
                    "البحث",
                    "السفر",
                ],
                "jawaban" => "السفر",
            ],
            [
                "no" => '46',
                "soal" => 'في العطلة (القادمة) سيزور إسماعيل صديقه في باكستان',
                "pilihan" => [
                    "التالية",
                    "الجديدة",
                    "القديمة",
                    "اللاحقة",
                ],
                "jawaban" => "القديمة",
            ],
            [
                "no" => '47',
                "soal" => 'يحب حسن الأكل وهو يأكل الأرز كثيرا ويشرب كوبا كبيرا من العصير، وأصبح ولدا (سمينا) في الحي',
                "pilihan" => [
                    "عظيما",
                    "كبيرا",
                    "طويلا",
                    "هزيلا",
                ],
                "jawaban" => "هزيلا", 
            ],
            [
                "no" => '48',
                "soal" => 'استأذن محمد من أصدقائه (العودة) إلى البيت أولا ',
                "pilihan" => [
                    "الرحلة",
                    "السفر",
                    "الذهاب",
                    "الرجوع",
                ],
                "jawaban" => "الذهاب",
            ],
            [
                "no" => '49',
                "soal" => 'قال الولد: لا يمكن للسارق إخفاء الخروف في هذه القرية لأن صوته سوف (يكشف) مكانه ',
                "pilihan" => [
                    "يستر",
                    "يقفل",
                    "يفتح",
                    "يظهر",
                ],
                "jawaban" => "يستر",
            ],
            [
                "no" => '50',
                "soal" => 'إن الحياة المادية تشغل الناس عن واجباتهم الانسانية وهذه الظاهرة (تتعارض) مع تعاليم الاسلام.  ',
                "pilihan" => [
                    "تناسب",
                    "تختلف",
                    "تخالف",
                    "تقضي عليه",
                ],
                "jawaban" => "تناسب",
            ],            
        ];

        return $data;
    }

    public function get_audio_istimav1(){
        $data = [
            [
                "judul" => "استمع الى الحوار التالى",
                "audio" => "<audio controls controlsList='nodownload'><source src='".base_url()."assets/sounds/1.mp3' type='audio/mp3'></audio>",
            ],
            [
                "judul" => "استمع إلى الناص التالى",
                "audio" => "<audio controls controlsList='nodownload'><source src='".base_url()."assets/sounds/2.mp3' type='audio/mp3'></audio>",
            ],
            [
                "judul" => "استمع الى الحوار جيدا",
                "audio" => "<audio controls controlsList='nodownload'><source src='".base_url()."assets/sounds/3.mp3' type='audio/mp3'></audio>",
            ],
            [
                "judul" => "استمع جيدا",
                "audio" => "<audio controls controlsList='nodownload'><source src='".base_url()."assets/sounds/4.mp3' type='audio/mp3'></audio>",
            ],
            [
                "judul" => "استمع إلى الناص التالى",
                "audio" => "<audio controls controlsList='nodownload'><source src='".base_url()."assets/sounds/4.mp3' type='audio/mp3'></audio>",
            ],
            [
                "judul" => "استمع إلى الحوار التالى",
                "audio" => "<audio controls controlsList='nodownload'><source src='".base_url()."assets/sounds/5.mp3' type='audio/mp3'></audio>",
            ],
            [
                "judul" => "استمع الحوار التالى!",
                "audio" => "<audio controls controlsList='nodownload'><source src='".base_url()."assets/sounds/6.mp3' type='audio/mp3'></audio>",
            ],
            [
                "judul" => "استمع إلى مكالمة التالية!",
                "audio" => "<audio controls controlsList='nodownload'><source src='".base_url()."assets/sounds/7.mp3' type='audio/mp3'></audio>",
            ]
        ];

        return $data;
    }

    public function get_teks_qiroahv1(){
        $data = [
            [
                "judul" => "فهم الناص",
                "teks" => "الأب طبيب والأمّ معلّمة والأخت طالبة في الجامعة الإسلاميّة والأخ طالب في الجامعة التّكنيكيّة الوطنيّة وأنا طالب في الجامعة الدّوليّة. عندنا بيت جميل في المدينة وأمام البيت حديقة كبيرة وجميلة. عندي غرفة كبيرة وحمّام ومطبخ صغير وفي الغرفة مكتب قديم وكرسي من بلاستيك وسرير كبير وخزانة قديمة من خشب وراديو قديم وجهاز فيديو وكمبيوتر وجهاز تلفزيون ومصباح."
            ],
            [
                "judul" => "اقرأ الناص التالي!",
                "teks" => "مشيت للتّسوّق من البيت الّذي هو داخل المدينة بالسّيّارة الجديدة إلى سوق خارج المدينة وكان أحمد معي وفي الطّريق إلى هذا السّوبرماركت الّذي هو من الأسواق الرّخيصة رأينا مؤسّسات صناعيّة وزراعيّة تابعة للحكومة والقطاع الخاصّ. ورغم الكثير من النّاس الّذين هم في كلّ مكان مشينا أوّلًا إلى مكتبة واشترينا من المكتبة كتبا أي قاموسين وروايتين واشترينا للدّراسة في الجامعة ورقا وأقلاما وممحاة وكراريس وشنطة بيضاء للكمبيوتر المحمول أي اللّاب توب. وبعد التّسوّق كنت في مقهى من المقاهي العربيّة وأحمد كان في البنك.وبعد ذلك مشينا إلى الجامعة الإسلاميّة الحكوميّة وهي جامعة من الجامعات المشهورة في العالم في الشّريعة والقانون الدّوليّ وتوجد هناك أساتذة ودكاترة وباحثون من كلّ العالم ومعاهد للبحث العلميّ في المواضيع الاجتماعيّة والاقتصاديّة ومنظّمات حكوميّة وغير حكوميّة ومشاريع للتّعاون مع المجتمع المدنيّ ومراكز خاصّة بالبيئة والمناخ العالميّ والعولمة."
            ],
            [
                "judul" => "اقرأ الناص التالي!",
                "teks" => "أحمد: هالو! مساء الخير.<br>
                صباح : مساء النور. من معي؟ من يتكلّم؟<br>
                أحمد: معك أحمد. كيف حالك؟<br>
                صباح: أنا بخير، الحمد لله وكيف حالك؟ هل ذهبت إلى المطار؟ هل وصلت مريم؟<br>
                أحمد: شكرا، أنا بخير، الحمد لله، نعم، كنت في المطار. مريم وصلت قبل ساعتين. أين كنت اليوم؟<br>
                صباح: اليوم كنت في الجامعة. سمعت أنّ مريم نزلت في فندق. هل هذا صحيح؟<br>
                أحمد: نعم ، هذا صحيح. هي الآن في الفندق.<br>
                صباح: وأين كنتم في المساء بعد أن وصلت مريم؟<br>
                أحمد: كنّا في مطعم صغير في الفندق وكالعادة أكلنا أكثر من اللازم من البوفيه الشرقيّ.<br>
                صباح: هل تمّت دراسة دقيقة للمشروع الماليّ الذي وصل عندي إلى المكتب؟<br>
                أحمد: نعم، تمّت الدراسة بعون الله وقالت مريم إنّها مسؤولة عن الإجراءات التنفيذيّة.<br>
                صباح: وغدا؟ ما هو البرنامج؟ هل عندها مواعد أو ارتباطات رسميّة؟<br>
                أحمد: والله، لا أدري بالضبط، أعتقد عندها مواعد رسميّة في القنصليّة الألمانيّة والسفارة السعوديّة والبنك الإسلاميّ  والله أعلم.<br>
                صباح: وأنت رايح إلى أين غدا؟<br>
                أحمد: والله، أنا رايح إلى المكتب في حيّ البنوك للمتابعة اليوميّة للتطوّرات الجارية في الأسواق الماليّة والأسهم المصرفيّة والأسعار الجديدة للبترول والغاز الطبيعيّ والموادّ الخام الأخرى.<br>
                صباح: يا مسكين! أنا غدا رايحة إلى المجمّع الاستهلاكيّ الجديد في مركز المدينة للتسوّق وأشوف الأشياء المغرية الجديدة في السوق. مع السلامة، وسلّم لي على مريم.<br>
                أحمد: مع السلامة وسلّمي على صالح وتصبحين على خير.<br>
                صباح: وأنت من أهله. مع السلامة.<br>"
            ],
            [
                "judul" => "الاستقبال في المطار",
                "teks" => "وصلت مريم أمس الجمعة. ذهبت بالتاكسي إلى المطار وقلت عندما خرجت من المخرج الخاصّ بالجمارك ودخلت القاعة الرئيسيّة: أهلًا وسهلًا! الحمد لله على السلامة! كيف كانت الرحلة وكيف حالك وكيف العائلة؟ قالت إنّ الرحلة كانت ممتازة وكلّهم بخير والحمد لله.
                من المطار ذهبنا إلى الفندق وفي الطريق إلى الفندق سألتها عنِ العمل الجديد في الخارج. قالت إنّ العمل في البداية كان كمترجمة في السفارة وفي نفس الوقت كموظّفة في السلك الدبلوماسيّ وإنّها كانت قبل شهر في سويسرا وفرنسا وإنّها عقدت في هذين البلدين اجتماعات ومؤتمرات كثيرة مع دبلوماسيّين وتجّار عرب وأجانب وإنّها سمعت أنّ العلاقات السياسيّة والاقتصاديّة والتجاريّة جيّدة بين هذين البلدين والبلدان العربيّة وإنّها ترجمت رسائل ومذكّرات دبلوماسيّة كثيرة.
                وبعد أن وصلنا بالتاكسي إلى الفندق صعدت مريم إلى الشقّة وجلست أنا في اللوبي أي في القاعة الكبيرة عند المدخل الرئيسيّ. وبعد قليل نزلت مريم وذهبنا إلى مطعم من المطاعم في الفندق وأكلنا هناك طعاما شرقيّا وبعد الأكل شربنا الشاي."
            ],
            [
                "judul" => "",
                "teks" => "يحكى أن راعيا خرج بأغنامه إلى المرعى في واد قريب من القرية. فانتشرت الأغنام بين الأعشاب الخضراء، تنتقل من مكان إلى آخر تأكل العشب إلى أن يقترب وقت العودة في المساء، فجمع الراعي أغنامه وسار في طريقه إلى القرية، وقبل أن يدخل الراعي الأغنام إلى الحظيرة، أخذ يصرخ بأعلى صوته: يا أهل القرية، ادركون! الذئب! الذئب!
                سمع الناس نداءه فأسرعوه إليه، وكل منهم يحمل عصا غليظا وما كادوا يصلون حتى وجدوه يضحك. فعرفوا أن الراعي قد كذب عليهم، وأن الذئب لم يهاجم الغنم، فغضبوا منه وعادوا إلى بيوتهم غاضبين. وفي اليوم التالي، خرج الراعي بالغنم إلى الوادي، وأثناء عودته إلى القرية في المساء، هاجمت الذئب الغنم، فأخذ الراعي يصرخ : ادركوني! ادركوني! ولكن لم يحضر أحد لنجدته، لاعتقادهم أنه يكذب. فهجم الذئب على الغنم، فكان هذا جزاء كذبه"
            ],
            [
                "judul" => "اختر أنسب الكلمة لتكملة الجمل الآتية! ",
                "teks" => ""
            ],
            [
                "judul" => "هات الترادف من الكلمات التي بين الكوسين! ",
                "teks" => ""
            ],
            [
                "judul" => "هات التضاد من الكلمات التي بين الكوسين! ",
                "teks" => ""
            ]
        ];

        return $data;
    }

    public function get_soal_istima(){
        $data = [
            [
                "no" => "1",
                "soal" => "",
                "pilihan" => [
                    "في يوم الإثنين",
                    "بالحافلة",
                    "نعم هو يذهب إلى الجامعة",
                    "لأنه طالب مجتهد",
                ],
                "jawaban" => "بالحافلة"
            ],
            [
                "no" => "2",
                "soal" => "",
                "pilihan" => [
                    "سأكون مدرسا",
                    "نعم ، أخي تاجر",
                    "سأكون تاجرا",
                    "أبي طبيب",
                ],
                "jawaban" => "سأكون مدرسا"
            ],
            [
                "no" => "3",
                "soal" => "",
                "pilihan" => [
                    "هذا دكتور إبراهيم",
                    "نعم هو محاضر",
                    "في الأسبوع القادم",
                    "نعم، في الجامعة",
                ],
                "jawaban" => "في الأسبوع القادم"
            ],
            [
                "no" => "4",
                "soal" => "",
                "pilihan" => [
                    "الممرض",
                    "الطبيب",
                    "الشرطى",
                    "الفلاح",
                ],
                "jawaban" => "الفلاح"
            ],
            [
                "no" => "5",
                "soal" => "",
                "pilihan" => [
                    "معاني القرآن الكريم",
                    "سور القرآن الكريم",
                    "أسماء القرآن الكريم",
                    "إعجاز القرآن",
                ],
                "jawaban" => "معاني القرآن الكريم"
            ],
            
            [
                "no" => "6",
                "soal" => "",
                "pilihan" => [
                    "لا يتناول الغداء",
                    "يتناول العشاء",
                    "لا يتناول الفطور",
                    "يتناول الفطور",
                ],
                "jawaban" => "لا يتناول الفطور"
            ],
            [
                "no" => "7",
                "soal" => "",
                "pilihan" => [
                    "وصل المسافرون المطار و لم تصل الطائرة",
                    "وصلت الطائرة و يصل المسافرون",
                    "وصل المسافرون المطار بعد مغادرة الطائرة",
                    "ركب المسافرون الطائرة و غادروا المطار",
                ],
                "jawaban" => "وصل المسافرون المطار بعد مغادرة الطائرة"
            ],
            [
                "no" => "8",
                "soal" => "",
                "pilihan" => [
                    "مكارم الأخلاق",
                    "الأخلاق",
                    "غرض البعث",
                    "الرسول",
                ],
                "jawaban" => "غرض البعث"
            ],
            [
                "no" => "9",
                "soal" => "",
                "pilihan" => [
                    "بدأ الإمتحان في السابعة و النصف",
                    "بدأ الإمتحان في الثامنة و النصف",
                    "بدأ الإمتحان في التاسعة تماما",
                    "بدأ الإمتحان في السابعة إلا النصف",
                ],
                "jawaban" => "بدأ الإمتحان في السابعة و النصف"
            ],
            [
                "no" => "10",
                "soal" => "",
                "pilihan" => [
                    "الشبكة الدولية",
                    "السفن",
                    "الطائرات",
                    "الحافلة",
                ],
                "jawaban" => "الشبكة الدولية"
            ],
            [
                "no" => "11",
                "soal" => "",
                "pilihan" => [
                    "النظافة",
                    "النوم مبكرا",
                    "الوضوء",
                    "الاغتسال بعد النوم",
                ],
                "jawaban" => "النظافة"
            ],
            [
                "no" => "12",
                "soal" => "",
                "pilihan" => [
                    "لأن القرد نظر إليهم",
                    "لأن القرد في رقبته سلسلة",
                    "لأن القرد كان يرقص",
                    "لأن القرد أخذ العصا",
                ],
                "jawaban" => "لأن القرد في رقبته سلسلة"
            ],
            [
                "no" => "13",
                "soal" => "",
                "pilihan" => [
                    "أن الله يحبّ المؤمن الضعيف أكثر من القويّ",
                    "أن الله يحبّ المؤمن القوي أكثر من الضعيف",
                    "المؤمن الضعيف مثل المؤمن القويّ",
                    "أن الله يحبّ المؤمن",
                ],
                "jawaban" => "أن الله يحبّ المؤمن القوي أكثر من الضعيف"
            ],
            [
                "no" => "14",
                "soal" => "",
                "pilihan" => [
                    "طبيب",
                    "مريض",
                    "ممرض",
                    "صيدلي",
                ],
                "jawaban" => "طبيب"
            ],
            [
                "no" => "15",
                "soal" => "",
                "pilihan" => [
                    "طبيب",
                    "طالب",
                    "دكتور",
                    "مريض",
                ],
                "jawaban" => "دكتور"
            ],
            [
                "no" => "16",
                "soal" => "",
                "pilihan" => [
                    "اشتري الحاسوب",
                    "طلب مبلغا كبيرا من المال",
                    "لم يشتر الحاسوب",
                    "عنده مبلغ كبير",
                ],
                "jawaban" => "لم يشتر الحاسوب"
            ],
            [
                "no" => "17",
                "soal" => "",
                "pilihan" => [
                    "الطعام مفيد",
                    "العملُ مهمٌّ",
                    "المالُ فيه خير",
                    "اتّباع بالأنبياء مهم",
                ],
                "jawaban" => "العملُ مهمٌّ"
            ],
            [
                "no" => "18",
                "soal" => "",
                "pilihan" => [
                    "ليلة التي خير من ألف شهر",
                    "شهر رمضان",
                    "نزول القران",
                    "ليلة القدر",
                ],
                "jawaban" => "شهر رمضان"
            ],
            [
                "no" => "19",
                "soal" => "",
                "pilihan" => [
                    "الحادية عشرة",
                    "الحادية عشرة والنصف",
                    "الثانية عشرة والنصف",
                    "الثانية عشرة إلا النصف",
                ],
                "jawaban" => "الثانية عشرة والنصف"
            ],
            [
                "no" => "20",
                "soal" => "",
                "pilihan" => [
                    "خمسين مسافرا",
                    "ستين مسافرا",
                    "خمسة و عشرين مسافرا",
                    "عشرين مسافرا",
                ],
                "jawaban" => "خمسين مسافرا"
            ],
            [
                "no" => "21",
                "soal" => "",
                "pilihan" => [
                    "الطلاب سوف يواجهون الامتحان",
                    "نصيحة المدرس لطلابه قبل الامتحان",
                    "الطلاب يدرسون بجهد",
                    "المدرس سوف يواجه الامتحان",
                ],
                "jawaban" => "نصيحة المدرس لطلابه قبل الامتحان"
            ],
            [
                "no" => "22",
                "soal" => "",
                "pilihan" => [
                    "السادسة",
                    "الثامنة",
                    "التاّسعة",
                    "السابعة",
                ],
                "jawaban" => "السابعة"
            ],
            [
                "no" => "23",
                "soal" => "",
                "pilihan" => [
                    "المدينة المنوّرة",
                    "جدّة",
                    "مكّة المكرمة",
                    "المنزل",
                ],
                "jawaban" => "مكّة المكرمة"
            ],
            [
                "no" => "24",
                "soal" => "",
                "pilihan" => [
                    "عبد الرحمن و أبوه",
                    "أبو عبد الرحمن",
                    "عبد الرحمن",
                    "أم عبد الرّحمن",
                ],
                "jawaban" => "أبو عبد الرحمن"
            ],
            [
                "no" => "25",
                "soal" => "",
                "pilihan" => [
                    "في المطار",
                    "في مكان الاستئجار",
                    "في جاكرتا",
                    "في البيت",
                ],
                "jawaban" => "في مكان الاستئجار"
            ],[
                "no" => "26",
                "soal" => "",
                "pilihan" => [
                    "يعمل الآن طبيبا",
                    "يعمل مهندسا",
                    "لا يعمل",
                    "يعمل مدرسا",
                ],
                "jawaban" => "لا يعمل"
            ],
            [
                "no" => "27",
                "soal" => "",
                "pilihan" => [
                    "أربع و عشرون سنةً",
                    "ستة وعشرون سنةً",
                    "خمس	و عشرون سنةً",
                    "سبعة و عشرون سنةً",
                ],
                "jawaban" => "ستة وعشرون سنةً"
            ],
            [
                "no" => "28",
                "soal" => "",
                "pilihan" => [
                    "في السوق",
                    "في المطعم",
                    "في الفصل",
                    "في المكتبة",
                ],
                "jawaban" => "في المكتبة"
            ],
            [
                "no" => "29",
                "soal" => "",
                "pilihan" => [
                    "دول الشرق",
                    "دول الشرق الأوسط",
                    "الدول النامية",
                    "الدول الغربية",
                ],
                "jawaban" => "الدول النامية"
            ],
            [
                "no" => "30",
                "soal" => "",
                "pilihan" => [
                    "في الساعة السادسة",
                    "في الساعة الثامنة",
                    "في الساعة السابعة",
                    "في الساعة التاسعة",
                ],
                "jawaban" => "في الساعة الثامنة"
            ],
            [
                "no" => "31",
                "soal" => "",
                "pilihan" => [
                    "في المطعم",
                    "في الفصل",
                    "في السوق",
                    "في المستشفى",
                ],
                "jawaban" => "في المطعم"
            ],
            [
                "no" => "32",
                "soal" => "",
                "pilihan" => [
                    "هو مريض",
                    "يصلي الصبح",
                    "لا يعرف الملعب الرياضي",
                    "سيزور أحد أصدقائه",
                ],
                "jawaban" => "سيزور أحد أصدقائه"
            ],
            [
                "no" => "33",
                "soal" => "",
                "pilihan" => [
                    "ثلاث سنوات",
                    "خمس سنوات",
                    "سنتين",
                    "أربع  سنوات",
                ],
                "jawaban" => "ثلاث سنوات"
            ],
            [
                "no" => "34",
                "soal" => "",
                "pilihan" => [
                    "عمل أبيه",
                    "عمل أخيه",
                    "عمل جده",
                    "اختيار المهنة",
                ],
                "jawaban" => "اختيار المهنة"
            ],
            [
                "no" => "35",
                "soal" => "",
                "pilihan" => [
                    "طبيب",
                    "طياّر",
                    "مهندس",
                    "مدرّس",
                ],
                "jawaban" => "طبيب"
            ],
            [
                "no" => "36",
                "soal" => "",
                "pilihan" => [
                    "مهندسا",
                    "مدرّسا",
                    "طياّرا",
                    "طبيبا",
                ],
                "jawaban" => "مدرّسا"
            ],
            [
                "no" => "37",
                "soal" => "",
                "pilihan" => [
                    "الطّبّ",
                    "التّعليم",
                    "الطّيران",
                    "الهندسة",
                ],
                "jawaban" => "الطّيران"
            ],
            [
                "no" => "38",
                "soal" => "",
                "pilihan" => [
                    "رجل وزوجته",
                    "امرأة وابنتها",
                    "أمّ وابنتها",
                    "امرأة وأختها",
                ],
                "jawaban" => "أمّ وابنتها"
            ],
            [
                "no" => "39",
                "soal" => "",
                "pilihan" => [
                    "وضع الماء في اللبن",
                    "وضع اللبن في الماء",
                    "بيع اللبن في السوق",
                    "بيع اللبن في بيت عمر",
                ],
                "jawaban" => "وضع الماء في اللبن"
            ],
            [
                "no" => "40",
                "soal" => "",
                "pilihan" => [
                    "الله",
                    "الابنة",
                    "الأمّ",
                    "الأخت",
                ],
                "jawaban" => "الابنة"
            ],
            [
                "no" => "41",
                "soal" => "",
                "pilihan" => [
                    "زوج المرأة",
                    "الأب",
                    "عمر",
                    "الله",
                ],
                "jawaban" => "عمر"
            ],
            [
                "no" => "42",
                "soal" => "",
                "pilihan" => [
                    "الابنة",
                    "الأمّ",
                    "عمر",
                    "لا أحد",
                ],
                "jawaban" => "لا أحد"
            ],
            [
                "no" => "43",
                "soal" => "",
                "pilihan" => [
                    "حياة الناس",
                    "فوائد السفر",
                    "بلاد العالم",
                    "السفارة",
                ],
                "jawaban" => "فوائد السفر"
            ],
            [
                "no" => "44",
                "soal" => "",
                "pilihan" => [
                    "أربع قارات",
                    "ست قارات",
                    "خمس قارات",
                    "قارات كثيرة",
                ],
                "jawaban" => "خمس قارات"
            ],
            [
                "no" => "45",
                "soal" => "",
                "pilihan" => [
                    "السفر",
                    "الأمم الأخرى",
                    "الإستماع",
                    "القراءة",
                ],
                "jawaban" => "السفر"
            ],
            [
                "no" => "46",
                "soal" => "",
                "pilihan" => [
                    "في المطار",
                    "في لندن",
                    "في بلده",
                    "في الطائرة",
                ],
                "jawaban" => "في لندن"
            ],
            [
                "no" => "47",
                "soal" => "",
                "pilihan" => [
                    "هو في استقبال صديقه",
                    "ليذهب إلى المستشفى",
                    "للعمل",
                    "للتَنَزُّه",
                ],
                "jawaban" => "للعمل"
            ],
            [
                "no" => "48",
                "soal" => "",
                "pilihan" => [
                    "هو مشغول في المكتب",
                    "هو لا يريد السفر",
                    "ستتأخر طائرته",
                    "هو مريض",
                ],
                "jawaban" => "ستتأخر طائرته"
            ],
            [
                "no" => "49",
                "soal" => "",
                "pilihan" => [
                    "للسفر إلى لندن",
                    "لاستقبال صديقه",
                    "ليأخذ تذكرة الطائرة",
                    "لطلب العمل",
                ],
                "jawaban" => "لاستقبال صديقه"
            ],
            [
                "no" => "50",
                "soal" => "",
                "pilihan" => [
                    "صباح الغد",
                    "مساء اليوم",
                    "بعد الظهر",
                    "هذه الليلة",
                ],
                "jawaban" => "صباح الغد"
            ],
        ];

        return $data;
    }

    public function get_soal_tarakib(){
        $data = [
            [
                "no" => "1",
                "soal" => "عاش سيدنا نوح تسعمائة وخمسين ...",
                "pilihan" => [
                    "عاما",
                    "أعواما",
                    "أعوام",
                    "عام",
                ],
                "jawaban" => "عاما",
            ],
            [
                "no" => "2",
                "soal" => "لا يزال كثير من الكتب العربية والفارسية فى <u>حاجة</u> ... الكشف و التحقيق عن الزهد الإسلامى.",
                "pilihan" => [
                    "على",
                    "الباء",
                    "إلى",
                    "عن",
                ],
                "jawaban" => "إلى",
            ],
            [
                "no" => "3",
                "soal" => "إذا لم تمطر غدا ...... للنزهة.",
                "pilihan" => [
                    "فسوف نخرج",
                    "فسوف لن نخرج",
                    "لم نخرج",
                    "فسوف خرجوا",
                ],
                "jawaban" => "فسوف نخرج",
            ],
            [
                "no" => "4",
                "soal" => "كان في المدرسة أستاذ. الخبر في هذه الجملة ؟",
                "pilihan" => [
                    "كان",
                    "في المدرسة",
                    "المدرس",
                    "أستاذ",
                ],
                "jawaban" => "في المدرسة",
            ],
            [
                "no" => "5",
                "soal" => "<u>اتصف</u> مذهب أبى حنيفة ... اعتماده على الرأي و الأخذ بالقياس.",
                "pilihan" => [
                    "من",
                    "فى",
                    "الباء",
                    "على",
                ],
                "jawaban" => "الباء",
            ],
            [
                "no" => "6",
                "soal" => "<u>وافق</u> مجلس الشعب ... المشروع الكبير",
                "pilihan" => [
                    "من",
                    "إلى",
                    "الباء",
                    "على",
                ],
                "jawaban" => "الباء",
            ],
            [
                "no" => "7",
                "soal" => "<u>الاعتماد</u> ...... النفس أساس النجاح  ",
                "pilihan" => [
                    "علی",
                    "فی",
                    "إلی",
                    "عن",
                ],
                "jawaban" => "علی",
            ],
            [
                "no" => "8",
                "soal" => "اصطاد القط فأرا . کلمة فأرا فی الجملة السابقة؟",
                "pilihan" => [
                    "مضاف إلیه",
                    "فاعل",
                    "خبر",
                    "مفعول به",
                ],
                "jawaban" => "مفعول به",
            ],
            [
                "no" => "9",
                "soal" => "ما حققه العلم فی مجال الفضاء یثیر الإعجاب ((ما)) فی الجملة السابقة؟",
                "pilihan" => [
                    "تعجبیة",
                    "موصولة",
                    "استفهامیة",
                    "نافیة",
                ],
                "jawaban" => "موصولة",
            ],
            [
                "no" => "10",
                "soal" => "قال تعالی: (قال رب إنی وهن العظم منی و اشتعل الرأس شیبا. کلمة (شیبا) ؟",
                "pilihan" => [
                    "تمییز",
                    "حال",
                    "صفة",
                    "مفعول به",
                ],
                "jawaban" => "تمییز",
            ],
            [
                "no" => "11",
                "soal" => "قال تعالی: ( إن الإنسان خلق هلوعا. کلمة (هلوعا) هي؟",
                "pilihan" => [
                    "مفعول به",
                    "حال",
                    "اسم إن",
                    "تمییز",
                ],
                "jawaban" => "حال",
            ],
            [
                "no" => "12",
                "soal" => 'قال تعالی (وأقام الصلاة وآتی الزکاة ولم یخش إلا الله). فعل "یخش" فی الآیة الکریمة مضارع معتال الآخر: ',
                "pilihan" => [
                    "مجزوم وعلامة جزمه حذف حرف العلة وهی الیاء",
                    "مجزوم وعلامة جزمه حذف حرف العلة وهی الألف",
                    "مجزوم وعلامة جزمه السکون المقدرة علی الألف المحذوفة",
                    "منصوب وعلامة نصبه الفتحة الظاهرة",
                ],
                "jawaban" => "مجزوم وعلامة جزمه حذف حرف العلة وهی الألف",
            ],
            [
                "no" => "13",
                "soal" => "بین هذه الجمل جملة صحیحة هي؟",
                "pilihan" => [
                    "لقد حاولوا کثیرا ولکنهم لم استطعوا أن یغیروا عاداتهم.",
                    "لقد حاولوا کثیرا ولکنهم لم یستطيعون أن یغیروا عاداتهم.",
                    "لقد حاولوا کثیرا ولکنهم لم یستطيعوا أن یغیروا عاداتهم.",
                    "لقد حاولوا کثیرا ولکنهم لم یستطعن أن یغیروا عاداتهم.",
                ],
                "jawaban" => "لقد حاولوا کثیرا ولکنهم لم یستطيعوا أن یغیروا عاداتهم.",
            ],
            [
                "no" => "14",
                "soal" => "كلا الرّجلين مُجدّ. كلمة (كلا) في الجملة:",
                "pilihan" => [
                    "مبتدأ مرفوع بالألف",
                    "خبر مقدم مرفوع بالألف",
                    "مبتدأ مرفوع بالضمة المقدرة",
                    "مبتدأ مرفوع بحذف النون",
                ],
                "jawaban" => "مبتدأ مرفوع بالألف",
            ],
            [
                "no" => "15",
                "soal" => "قال: لا تظلم الناس فتندم. الفاء في قوله ‘‘فتندم‘‘ هي:",
                "pilihan" => [
                    "سببيّة",
                    "استئنافية",
                    "جواب الشرط",
                    "استدراكيّة",
                ],
                "jawaban" => "جواب الشرط",
            ],
            [
                "no" => "16",
                "soal" => "اختر الأوقات المناسبة للزيارة. كلمة الأوقات:",
                "pilihan" => [
                    "مجرور بالكسرة",
                    "مجرور بالتاء",
                    "منصوب بالكسرة",
                    "منصوب بالفتحة",
                ],
                "jawaban" => "منصوب بالكسرة",
            ],
            [
                "no" => "17",
                "soal" => "...... أحمد في الحمام في الصباح قبل ذهاب إلى المدرسة. ",
                "pilihan" => [
                    "اغتسل",
                    "يغسل",
                    "غسل",
                    "أغسل",
                ],
                "jawaban" => "اغتسل",
            ],
            [
                "no" => "18",
                "soal" => "الأم ..... المطبخ وتقدّم الطعام لأولاده. ",
                "pilihan" => [
                    "تطبخ",
                    "يطبخ",
                    "تنظف",
                    "ينظف",
                ],
                "jawaban" => "تطبخ",
            ],
            [
                "no" => "19",
                "soal" => "...... الأساتيذ الطلاب في الجامعة الإسلامية الحكومية بسورابايا. ",
                "pilihan" => [
                    "تعلم",
                    "يعلم",
                    "يعلمون",
                    "يعلمن",
                ],
                "jawaban" => "يعلم",
            ],
            [
                "no" => "20",
                "soal" => "...... المسلمون بذكري مولدي النبي صلى الله عليه وسلم ",
                "pilihan" => [
                    "أستغفر",
                    "انتظروا",
                    "انتظر",
                    "احتفل",
                ],
                "jawaban" => "احتفل",
            ],
            [
                "no" => "21",
                "soal" => "يريد صالح أن يذهب إلى مصر في الأسبوع القادم.  القادم في هذه الجملة تعني؟ ",
                "pilihan" => [
                    "الماضي",
                    "الآتي",
                    "أمس",
                    "الآن",
                ],
                "jawaban" => "الآتي",
            ],
            [
                "no" => "22",
                "soal" => "هذا رائع. هذا أكبر ..... في هذه المدينة",
                "pilihan" => [
                    "المساجد",
                    "المسجد",
                    "المسجدين",
                    "المسجدان",
                ],
                "jawaban" => "المساجد",
            ],
            [
                "no" => "23",
                "soal" => "أن تحفظ العالم – يجب علينا – حولنا – مهم لحياة الناس – لأن حفظ العالم. ",
                "pilihan" => [
                    "يجب علينا حولنا أن نحفظ العالم لأن حفظ العالم مهم لحياة الناس",
                    "أن نحفظ العالم حولنا مهم لحياة الناس لأن حفظ العالم يجب علينا",
                    "يجب علينا أن نحفظ العالم حولنا لأن حفظ العالم مهم لحياة الناس",
                    "مهم لحياة الناس أن نحفظ العالم لأن حفظ العالم حولنا يجب علينا",
                ],
                "jawaban" => "يجب علينا أن نحفظ العالم حولنا لأن حفظ العالم مهم لحياة الناس",
            ],
            [
                "no" => "24",
                "soal" => " تعمل – إن – من خير – لنفسك – تجده – عند الله <br>الترتيب الصحيح مِن الكَلِماتِ السَابِقَةِ هُوَ.......",
                "pilihan" => [
                    "إن تعمل من خير لنفسك تجده عند الله",
                    "إن تعمل لنفسك من خير تجد عند الله",
                    "إن تعمل من خير تجده عند الله لنفسك",
                    "إن تعمل لنفسك من خير عند الله تجده",
                ],
                "jawaban" => "إن تعمل من خير تجده عند الله لنفسك",
            ],
            [
                "no" => "25",
                "soal" => "تجتهد – إن – في درسك – في الإمتحان – تنجح <br>الترتيب الصحيح من الكلمات السابقة هو....... ",
                "pilihan" => [
                    "تجتهد في درستك إن تنجح في الإمتحان",
                    "في درسك إن تجتهد تنجح في الإمتحان",
                    "إن تجتهد تنجح في الإمتحان في درسك",
                    "إن تنجح في درسك تجتهد في الإمتحان",
                ],
                "jawaban" => "إن تجتهد تنجح في الإمتحان في درسك",
            ],
            [
                "no" => "26",
                "soal" => " دعا الإسلام إلى أن يقوم العمل على تَقْوى  الله بامتثال أوامره واجتناب نواهيه. وذلك لأن الإنسان إذا أطاع الله واجتنب المعاصي جعل الله له في قلبه نورًا يفرق به بين الحق والباطل. جملة الشرط في هذه الفقرة هي؟",
                "pilihan" => [
                    "الإنسان إذا أطاع الله واجتنب المعَاصى",
                    "جَعل الله له في قلبه نورًا",
                    "أطاع الله واجتنب المعاصى",
                    "يُفَرق به بين الحق والباطل",
                ],
                "jawaban" => "الإنسان إذا أطاع الله واجتنب المعَاصى",
            ],
            [
                "no" => "27",
                "soal" => "وجب على الطلاب أن...... في دراستهم سوَاء كانت في المدرسة الحكُوميةِ أو فيِ المدرسةِ الأَهْليَّةِ. ",
                "pilihan" => [
                    "يلْتحقوا",
                    "يدرسوا",
                    "يعملوْا",
                    "يجْتهدوا",
                ],
                "jawaban" => "يلْتحقوا",
            ],
            [
                "no" => "28",
                "soal" => "رأى القاضي أن هذه القضية ..... واجه هذا الرجل ثقيلة.",
                "pilihan" => [
                    "الذي",
                    "التي",
                    "اللاتي",
                    "الذين",
                ],
                "jawaban" => "التي",
            ],
            [
                "no" => "29",
                "soal" => " الموضوع الذي قدمه الدكتور في هذه المحاضرة <u>مناسب</u> بحال الناس في هذا العصر. الكلمة التي تحتها خط تعني؟",
                "pilihan" => [
                    "متجانس",
                    "لائق",
                    "مفيد",
                    "منخفض",
                ],
                "jawaban" => "لائق",
            ],
            [
                "no" => "30",
                "soal" => "<u>اقترح</u> أحد السكان في هذه القرية لصناعة الجسر قريتين لتسهيل المرور بينهما. ماذا نقصد  الكلمة التي تحتها خد؟",
                "pilihan" => [
                    "قدم رأيا",
                    "قدم جسرا",
                    "قدم مالا",
                    "قدم سكان ",
                ],
                "jawaban" => "قدم رأيا",
            ],
            [
                "no" => "31",
                "soal" => "<u>يكون</u> الطقس فى <u>الشتاء</u> <u>برد</u> وفى الصيف <u>حارًا</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟",
                "pilihan" => [
                    "يكون",
                    "الشتاء",
                    "برد",
                    "حارا",
                ],
                "jawaban" => "برد",
            ],
            [
                "no" => "32",
                "soal" => "<u>الماء</u> من <u>أكبر</u> <u>نعمة</u> الله على <u>الإنسان</u>  . ما هي الكلمة الخاطئة من هذه الجملة ؟",
                "pilihan" => [
                    "الماء",
                    "أكبر",
                    "نعمة",
                    "الإنسان",
                ],
                "jawaban" => "نعمة",
            ],
            [
                "no" => "33",
                "soal" => "<u>يفحصان</u> الطبيبان <u>المريض</u> في <u>أحد</u> المستشفيات<u> بكل فرح</u> وسرور. ما هي الكلمة الخاطئة من هذه الجملة ؟",
                "pilihan" => [
                    "يفحصان",
                    "المريض",
                    "إحدى",
                    "بكل فرح",
                ],
                "jawaban" => "يفحصان",
            ],
            [
                "no" => "34",
                "soal" => "كان <u>المدافع</u> في هذه المباراة <u>يرفسَ</u> الكرة بشدة حتى <u>تحصل</u> على <u>الهدف</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟ ",
                "pilihan" => [
                    "المدافع",
                    "يرفس",
                    "تحصل",
                    "الهدف",
                ],
                "jawaban" => "يرفس",
            ],
            [
                "no" => "35",
                "soal" => "يزور الطلاب والطالبات <u>المتاحف</u> <u>المتنوع</u> لزيادة <u>المعلومات</u> .  ما هي الكلمة الخاطئة من هذه الجملة ؟",
                "pilihan" => [
                    "يزور",
                    "المتاحف",
                    "المتنوع",
                    "المعلومات",
                ],
                "jawaban" => "المتنوع",
            ],
            [
                "no" => "36",
                "soal" => "كان <u>الطلاب</u> يستمعون <u>مما</u> حاضره <u>المحاضر</u> في <u>الجامعة</u> الإسلامية. ما هي الكلمة الخاطئة من هذه الجملة؟",
                "pilihan" => [
                    "الطلاب",
                    "مما",
                    "المحاضر",
                    "الجامعة",
                ],
                "jawaban" => "مما",
            ],
            [
                "no" => "37",
                "soal" => "الكلام <u>السلبي</u> يؤدي <u>من</u> ضعفاء <u>الخطوات</u> لنيل <u>النجاح</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟",
                "pilihan" => [
                    "السلبي",
                    "من",
                    "الخطوات",
                    "النجاح",
                ],
                "jawaban" => "من",
            ],
            [
                "no" => "38",
                "soal" => "أين الجملة الصحيحة من هذه الخيارات ؟",
                "pilihan" => [
                    "تبحر هذا الرجل في علم النحو والصرف والبلاغة",
                    "تبحر هذا الرجل إلى علم النحو والصرف والبلاغة",
                    "تبحر هذا الرجل بعلم النحو والصرف والبلاغة",
                    "تبحر هذا الرجل من علم النحو والصرف والبلاغة",
                ],
                "jawaban" => "تبحر هذا الرجل في علم النحو والصرف والبلاغة",
            ],
            [
                "no" => "39",
                "soal" => "أين الجملة الصحيحة من هذه الخيارات ؟",
                "pilihan" => [
                    "تخرجت فاطمة إلى هذه الجامعة السنة الماضية",
                    "تخرجت فاطمة في هذه الجامعة السنة الماضية",
                    "تخرجت فاطمة من  هذه الجامعة السنة الماضية",
                    "تخرجت فاطمة بهذه الجامعة السنة الماضية",
                ],
                "jawaban" => "تخرجت فاطمة في هذه الجامعة السنة الماضية",
            ],
            [
                "no" => "40",
                "soal" => "أين الجملة الصحيحة من هذه الخيارات ؟",
                "pilihan" => [
                    "يصيدان الصياد السمك وسط البحر",
                    "يصيدون الصياد السمك وسط البحر",
                    "يصيد الصياد السمك وسط البحر",
                    "تصيد الصياد السمك وسط البحر",
                ],
                "jawaban" => "يصيد الصياد السمك وسط البحر",
            ],
        ];

        return $data;
    }

    public function get_soal_qiroah(){
        $data = [
            [
                "no" => "1",
                "soal" => "ما العنوان المناسب لهذا الحديث ؟",
                "pilihan" => [
                    "الرجل العطشان",
                    "الرفق بالحيوان",
                    "الكلب العطشان",
                    "البئر فى الطريق",
                ],
                "jawaban" => "الرفق بالحيوان",
            ],
            [
                "no" => "2",
                "soal" => 'ما المرادف من "يلهث" في هذه القراءة ؟',
                "pilihan" => [
                    "ظمئ",
                    "سبع",
                    "حزن",
                    "بكا",
                ],
                "jawaban" => "ظمئ",
            ],
            [
                "no" => "3",
                "soal" => 'ثمّ أمسكه بفيه. أين يعود ضمير "ه" في هذه الجملة؟',
                "pilihan" => [
                    "رجل",
                    "كلب",
                    "امرأة",
                    "بئر",
                ],
                "jawaban" => "كلب",
            ],
            [
                "no" => "4",
                "soal" => "ما الفكرة الرئيسة في الفقرة السابقة ؟",
                "pilihan" => [
                    "الناس لايعرف هذه النعمة",
                    "إنّ نبيّ الله داوود كان يأكل من عمل يده",
                    "بعض النّاس لا يحبون العمل",
                    "العمل خير في الحياة",
                ],
                "jawaban" => "العمل خير في الحياة",
            ],
            [
                "no" => "5",
                "soal" => "الجملة المناسبة بالفقرة السابقة ؟",
                "pilihan" => [
                    "ينبغي علينا أن نأكل مما كسبنا",
                    "ينبغي علينا أن نأكل ما أعطانا الجار",
                    "ينبغي علينا أن نأكل مما كسب الأب",
                    "ينبغي علينا أن نسأل الآخر",
                ],
                "jawaban" => "ينبغي علينا أن نأكل مما كسبنا",
            ],
            [
                "no" => "6",
                "soal" => "الفكرة الرئيسة للفقرة السابقة هى :",
                "pilihan" => [
                    "عدد سكان الصين ألف مليون نسمة.",
                    "تحديد النسل يكون عن طريق تحديد طفل واحد للأسرة.",
                    "زيادة السكان من أهم مشكلات معظم دول العالم.",
                    "القانون يعاقب من لايطيع قانون تحديد النسل.",
                ],
                "jawaban" => "زيادة السكان من أهم مشكلات معظم دول العالم.",
            ],
            [
                "no" => "7",
                "soal" => "كيف حددت الصين النسل :",
                "pilihan" => [
                    "طفل واحد لكل أسرة.",
                    "طفلين للأسرة.",
                    "طفلين للأسرتين.",
                    "ثلاثة أطفال للأسرة.",
                ],
                "jawaban" => "طفل واحد لكل أسرة.",
            ],
            [
                "no" => "8",
                "soal" => "أدى تزايد السكان إلى :",
                "pilihan" => [
                    "مشكلة اقتصادية",
                    "مشكلات اجتماعية",
                    "مشكلات سياسية",
                    "مشكلات اقتصادية واجتماعية",
                ],
                "jawaban" => "مشكلات اقتصادية واجتماعية",
            ],
            [
                "no" => "9",
                "soal" => "ولكن الشعب الصينى مطيع للأوامر ولم تشذ عن هذا القانون إلا حالا تحددها الأطباء مشكلة اقتصادية. أين خبر لكنّ ؟",
                "pilihan" => [
                    "للأوامر",
                    "الشعب",
                    "الصيني",
                    "مطيع",
                ],
                "jawaban" => "مطيع",
            ],
            [
                "no" => "10",
                "soal" => "أفضل العنوان للفقرات السابقة :",
                "pilihan" => [
                    "نظرة الآباء إلى الأبناء",
                    "نظرة الأبناء إلى الآباء",
                    "اختلاف الرأي بين الآباء والأبناء",
                    "تفكير الآباء المتأخر",
                ],
                "jawaban" => "اختلاف الرأي بين الآباء والأبناء",
            ],
            [
                "no" => "11",
                "soal" => "خطأ الآباء فى نظرتهم للأبناء .......",
                "pilihan" => [
                    "أنهم يأمرون أولادهم دائما بدون سبب",
                    "أنهم يحسبون جيدا فارقا لسن بينهم",
                    "أنهم ينظرون إلى الأبناء على أنهم كبار",
                    "أنهم لايحبون لأولادهم أن يكونوا مثلهم",
                ],
                "jawaban" => "أنهم ينظرون إلى الأبناء على أنهم كبار",
            ],
            [
                "no" => "12",
                "soal" => "خطأ الأبناء فى نظرتهم الآباء ...........",
                "pilihan" => [
                    "أنهم نالوا السهولة أن يتّفقوا معهم فى الرأي",
                    ". أن الآباء يفكرون تفكيرا متأخرا",
                    "أنّ الآباء يجب أن يكونوا أكثر صبرا",
                    "أن الآباء يتمنون لهم الخير",
                ],
                "jawaban" => ". أن الآباء يفكرون تفكيرا متأخرا",
            ],
            [
                "no" => "13",
                "soal" => "التعبير المناسب من هذه القراءة ؟",
                "pilihan" => [
                    "ينبغي على الأبناء أن يطيعوا آبائهم",
                    "ينبغي على الأبناء أن يرحوا آبائهم",
                    "ينبغي على الأبناء أن يستمعوا إلى آبائهم",
                    "ينبغي على الأبناء أن لا يطيعوا آبائهم",
                ],
                "jawaban" => "ينبغي على الأبناء أن يطيعوا آبائهم",
            ],
            [
                "no" => "14",
                "soal" => "الفكرة الرئيسة في الفقرة السابقة تتحدّث عن ......",
                "pilihan" => [
                    "انتشار الحضارة الإسلاميّة في العالم",
                    "انتشار الإسلام في العالم",
                    "انتشار العلم والثقافة في الصين",
                    "انتشار العلم والثقافة في أوروبا",
                ],
                "jawaban" => "انتشار الحضارة الإسلاميّة في العالم",
            ],
            [
                "no" => "15",
                "soal" => "أين يقع بلاد السودان ؟",
                "pilihan" => [
                    "في إفريقيا",
                    "في شرق الأوسط",
                    "في الدول الغربي",
                    "في آسيا",
                ],
                "jawaban" => "في إفريقيا",
            ],
            [
                "no" => "16",
                "soal" => "أيّ عبارة من العبارات الآتية لا يحتويها الموضوع ؟",
                "pilihan" => [
                    'موضوع الندوة "فائدة الكتاب"',
                    "الكتاب العاديّ سينتهي قريبا",
                    "لا يحضر في الندوة إلا مدرسون من الجامعة",
                    "تستعمل الدول الغنية الكتاب الإلكتروني",
                ],
                "jawaban" => "لا يحضر في الندوة إلا مدرسون من الجامعة",
            ],
            [
                "no" => "17",
                "soal" => "خبر كانت في الفقرة السابقة؟",
                "pilihan" => [
                    "ندوة",
                    "هناك",
                    "في كلّية الاداب",
                    "مفيدة",
                ],
                "jawaban" => "هناك",
            ],
            [
                "no" => "18",
                "soal" => 'ضمير (ها) في جملة "تكلّم فيها مدرّسون من الجامعة" راجع إلى ',
                "pilihan" => [
                    "كانت",
                    "الجامعة",
                    "ندوة",
                    "كلية الاداب",
                ],
                "jawaban" => "ندوة",
            ],
            [
                "no" => "19",
                "soal" => 'خبر إنّ في الجملة  "إن الكتاب العاديّ سينتهي قريبا"، ويترك مكانة الكتاب الإلكتروني"',
                "pilihan" => [
                    "العاديّ",
                    "قريبا",
                    "سينتهي",
                    "مكانة",
                ],
                "jawaban" => "سينتهي",
            ],
            [
                "no" => "20",
                "soal" => 'تكلّم الجميع عن فائدة الكتاب، "تكلم" في هذه الجملة على وزن ؟',
                "pilihan" => [
                    "أفعل",
                    "تفاعل",
                    "تفعل",
                    "فاعل",
                ],
                "jawaban" => "تفعل",
            ],
            [
                "no" => "21",
                "soal" => "كم سنة أنشأت تلك الشركة ؟",
                "pilihan" => [
                    "سنة واحدة",
                    "سنتين",
                    "ثلاث سنوات",
                    "أربع سنوات",
                ],
                "jawaban" => "ثلاث سنوات",
            ],
            [
                "no" => "22",
                "soal" => "وصف الرجل في هذه الفقرة بأنه رجل ؟",
                "pilihan" => [
                    "جميل",
                    "شريف",
                    "حكيم",
                    "لطيف",
                ],
                "jawaban" => "شريف",
            ],
            [
                "no" => "23",
                "soal" => '"من أغنياء المدينة " ؟',
                "pilihan" => [
                    "اسم أصبح",
                    "خبر أصبح",
                    "مبتدأ مؤخر",
                    "بدل",
                ],
                "jawaban" => "خبر أصبح",
            ],
            [
                "no" => "24",
                "soal" => "ما عمل هذا الرجل قبل أن يكون تاجرا؟",
                "pilihan" => [
                    "الموظف الحكومي",
                    "الموظف الأهلي",
                    "رجال العمل",
                    "مهندس",
                ],
                "jawaban" => "الموظف الحكومي",
            ],
            [
                "no" => "25",
                "soal" => "ماذا تجهز الشركة الكبيرة لهذا الرجل؟",
                "pilihan" => [
                    "السراويل",
                    "الثياب",
                    "أقمصة",
                    "الأقلام",
                ],
                "jawaban" => "الأقلام",
            ],
            [
                "no" => "26",
                "soal" => "حسن طالب مسلم من اندونيسيا، وهي تقع في قارة ؟",
                "pilihan" => [
                    "آسيا",
                    "أفريقا",
                    "أوربا",
                    "أوستراليا",
                ],
                "jawaban" => "آسيا",
            ],
            [
                "no" => "27",
                "soal" => " يدرس حسن في المرحلة ؟",
                "pilihan" => [
                    "المتوسطة",
                    "الثانوية",
                    "الجامعية",
                    "الإبتدائية",
                ],
                "jawaban" => "الجامعية",
            ],
            [
                "no" => "28",
                "soal" => "متى حضر حسن الى المدينة المنورة؟",
                "pilihan" => [
                    "قبل ثلاث سنوات",
                    "قبل أشهر",
                    "قبل سنتين",
                    "قبل أربع سنوات",
                ],
                "jawaban" => "قبل ثلاث سنوات",
            ],
            [
                "no" => "29",
                "soal" => "حفظ حسن القرآن في ؟",
                "pilihan" => [
                    "إندونسيا",
                    "مالزيا",
                    "المدينة المنورة",
                    "إندونسيا والمدينة المنورة",
                ],
                "jawaban" => "إندونسيا",
            ],
            [
                "no" => "30",
                "soal" => 'كلمة "المعجز" اشتقت من العجز، وهو . . .',
                "pilihan" => [
                    "الضعف",
                    "الثبات",
                    "القوة",
                    "الأبدي",
                ],
                "jawaban" => "القوة",
            ],
            [
                "no" => "31",
                "soal" => "معنى التلاوة في هذه القراءة؟",
                "pilihan" => [
                    "الحفظ",
                    "القراءة",
                    "الكتابة",
                    "التفسير",
                ],
                "jawaban" => "القراءة",
            ],
            [
                "no" => "32",
                "soal" => " المصاحف جمع من ؟",
                "pilihan" => [
                    "الصحف",
                    "المصحف",
                    "الصحفي",
                    "الصحيفة",
                ],
                "jawaban" => "المصحف",
            ],
            [
                "no" => "33",
                "soal" => 'معنى "المتعبد بتلاوته" ؟',
                "pilihan" => [
                    "أن الذي يتلوه عباد",
                    "أن تلاوته عبادة",
                    "أن تلاوته ليست من العبادة",
                    "التلاوة مهمة في العبادة",
                ],
                "jawaban" => "أن تلاوته عبادة",
            ],
            [
                "no" => "34",
                "soal" => 'معنى "فؤادك"  في هذه القراءة ؟',
                "pilihan" => [
                    "صدرك",
                    "قلبك",
                    "عقلك",
                    "فكرتك",
                ],
                "jawaban" => "قلبك",
            ],
            [
                "no" => "35",
                "soal" => "ما العنوان المناسب للنص السابق؟‏",
                "pilihan" => [
                    "العمل أساس الإنتاج",
                    "الإسلام يدعو إلى الإنتاج",
                    "علاقة النشاط الاقتصادي بالأخلاق",
                    "توقّف مصلحة المجتمع على مصلحة الفرد",
                ],
                "jawaban" => "علاقة النشاط الاقتصادي بالأخلاق",
            ],
            [
                "no" => "36",
                "soal" => "‏ ‏فهمنا من النص السابق أن الإسلام أمرنا بــــ ؟ ‏",
                "pilihan" => [
                    "كسب الرزق الحلال",
                    "إتقان العمل وأخذ الأرباح",
                    "الارتقاء بمستوى الإنتاج",
                    "إتقان العمل والتحلي بالأخلاق",
                ],
                "jawaban" => "إتقان العمل والتحلي بالأخلاق",
            ],
            [
                "no" => "37",
                "soal" => "ما موقف أفراد المجتمعات المتقدمة من العمل؟",
                "pilihan" => [
                    "يحترمونه ويعتبرونه من القداسة",
                    "يعتبرونه كأعباء ثقيلة",
                    "يحترمونه ولايعتبرونه من القداسة",
                    "يعتبرونه من وسائل الإنتاج",
                ],
                "jawaban" => "يحترمونه ويعتبرونه من القداسة",
            ],
            [
                "no" => "38",
                "soal" => "ما هو أساس النجاح في العمل حسب النص السابق؟‏",
                "pilihan" => [
                    "إتقان العمل والنشاط في الإنتاج",
                    "إتقان العمل مع التوكل على الله",
                    "إتقان العمل وعدم التهاون فيه",
                    "إتقان العمل مع الالتزام بالمثل الأعلى",
                ],
                "jawaban" => "إتقان العمل مع التوكل على الله",
            ],
            [
                "no" => "39",
                "soal" => "احتكر  بعض الناس الطعام. وأهم الأغراض من الاحتكار هو . . . .‏",
                "pilihan" => [
                    "حفظ الطعام",
                    "جمع الأموال",
                    "براءة من الله",
                    "التضخم المالي",
                ],
                "jawaban" => "التضخم المالي",
            ],
            [
                "no" => "40",
                "soal" => '"الجالب مرزوق والمحتكر ملعون". والمراد بالجالب هنا . . . .‏',
                "pilihan" => [
                    "من يعطي المحتاجين سلعته",
                    "من يأتي بسلعة بثمن معقول",
                    "من يحتكر السلعة لبيعها بثمن ‏غال",
                    "من يجمع السلعة بأرخص ثمن",
                ],
                "jawaban" => "من يأتي بسلعة بثمن معقول",
            ],
            [
                "no" => "41",
                "soal" => "أنواع الحرية للأفراد التي يضمنها الإسلام هي . . . .‏",
                "pilihan" => [
                    "البيع والشراء",
                    "التنافس في جمع الأموال",
                    "التنافس في البيع والشراء",
                    "احتكار السلع للتضخم المالي",
                ],
                "jawaban" => "التنافس في البيع والشراء",
            ],
            [
                "no" => "42",
                "soal" => "أین یوسف الآن ؟",
                "pilihan" => [
                    "فی کوریا",
                    "فی مالیزیا",
                    "فی الیابان",
                    "فی الریاض",
                ],
                "jawaban" => "فی مالیزیا",
            ],
            [
                "no" => "43",
                "soal" => "متی سیحضر یوسف إلی الریاض؟",
                "pilihan" => [
                    "فی رمضان",
                    "فی شعبان",
                    "فی شوال",
                    "قبل رمضان",
                ],
                "jawaban" => "فی شوال",
            ],
            [
                "no" => "44",
                "soal" => "ما الفکرةالرئیسیة للفقرة السابقة؟",
                "pilihan" => [
                    "التعاون أمر واجب بین أعضاء الأسرة",
                    "یستطیع الفرد آن یحیا حیاة سعیدة بمفرده فی المجتمع",
                    "تبقی تستمر حیاة المجتمع بالتعاون فیما بین  أعضائه",
                    "لا یجوز التعاون علی الإثم والعدوان.",
                ],
                "jawaban" => "تبقی تستمر حیاة المجتمع بالتعاون فیما بین  أعضائه",
            ],
            [
                "no" => "45",
                "soal" => "مرادف متین فی جملة .ولهذا یبدو المجتمع کأنه جدار متین؟",
                "pilihan" => [
                    "ضعیف",
                    "جمیل",
                    "حائط",
                    "قوي",
                ],
                "jawaban" => "قوي",
            ],
            [
                "no" => "46",
                "soal" => "ماذا تعمل هذه الزّوجة ..؟",
                "pilihan" => [
                    "موظّفة",
                    "مدرّسة",
                    "ممرّضة",
                    "طبيبة",
                ],
                "jawaban" => "طبيبة",
            ],
            [
                "no" => "47",
                "soal" => " ماذا يعمل هذا الزّوج....؟",
                "pilihan" => [
                    "طبيبا",
                    "طيارا",
                    "مدرسا",
                    "فلاحا",
                ],
                "jawaban" => "مدرسا",
            ],
            [
                "no" => "48",
                "soal" => "يعمل الزّوج في ....؟",
                "pilihan" => [
                    "الصبّاح",
                    "المساء",
                    "الصّباح والمساء",
                    "غير معين",
                ],
                "jawaban" => "الصبّاح",
            ],
            [
                "no" => "49",
                "soal" => "متى تعود الزّوجة إلى البيت  ؟",
                "pilihan" => [
                    "بعد العصر",
                    "بعد الظّهر",
                    "بعد المغرب",
                    "بعد العشاء",
                ],
                "jawaban" => "بعد العصر",
            ],
            [
                "no" => "50",
                "soal" => "لا تتناول الأسرة الوجبات في البيت: لأنّ .... ؟",
                "pilihan" => [
                    "الطّعام جيّدٌ في الخارج",
                    "الزّوجة لا تحبّ إعداد الطّعام",
                    "الزّوجة مشغولةٌ",
                    "ليس للأسرة أموال كثيرة",
                ],
                "jawaban" => "الزّوجة مشغولةٌ",
            ],
        ];

        return $data;
    }

    public function get_soal_istimav2(){
        $data = [
            [
                "no" => "1",
                "soal" => "",
                "pilihan" => [
                    "في يوم الإثنين",
                    "بالحافلة",
                    "نعم هو يذهب إلى الجامعة",
                    "لأنه طالب مجتهد",
                ],
                "jawaban" => "بالحافلة"
            ],
            [
                "no" => "2",
                "soal" => "",
                "pilihan" => [
                    "سأكون مدرسا",
                    "نعم ، أخي تاجر",
                    "سأكون تاجرا",
                    "أبي طبيب",
                ],
                "jawaban" => "سأكون مدرسا"
            ],
            [
                "no" => "3",
                "soal" => "",
                "pilihan" => [
                    "هذا دكتور إبراهيم",
                    "نعم هو محاضر",
                    "في الأسبوع القادم",
                    "نعم، في الجامعة",
                ],
                "jawaban" => "في الأسبوع القادم"
            ],
            [
                "no" => "4",
                "soal" => "",
                "pilihan" => [
                    "الممرض",
                    "الطبيب",
                    "الشرطى",
                    "الفلاح",
                ],
                "jawaban" => "الفلاح"
            ],
            [
                "no" => "5",
                "soal" => "",
                "pilihan" => [
                    "معاني القرآن الكريم",
                    "سور القرآن الكريم",
                    "أسماء القرآن الكريم",
                    "إعجاز القرآن",
                ],
                "jawaban" => "معاني القرآن الكريم"
            ],
            
            [
                "no" => "6",
                "soal" => "",
                "pilihan" => [
                    "لا يتناول الغداء",
                    "يتناول العشاء",
                    "لا يتناول الفطور",
                    "يتناول الفطور",
                ],
                "jawaban" => "لا يتناول الفطور"
            ],
            [
                "no" => "7",
                "soal" => "",
                "pilihan" => [
                    "وصل المسافرون المطار و لم تصل الطائرة",
                    "وصلت الطائرة و يصل المسافرون",
                    "وصل المسافرون المطار بعد مغادرة الطائرة",
                    "ركب المسافرون الطائرة و غادروا المطار",
                ],
                "jawaban" => "وصل المسافرون المطار بعد مغادرة الطائرة"
            ],
            [
                "no" => "8",
                "soal" => "",
                "pilihan" => [
                    "مكارم الأخلاق",
                    "الأخلاق",
                    "غرض البعث",
                    "الرسول",
                ],
                "jawaban" => "غرض البعث"
            ],
            [
                "no" => "9",
                "soal" => "",
                "pilihan" => [
                    "بدأ الإمتحان في السابعة و النصف",
                    "بدأ الإمتحان في الثامنة و النصف",
                    "بدأ الإمتحان في التاسعة تماما",
                    "بدأ الإمتحان في السابعة إلا النصف",
                ],
                "jawaban" => "بدأ الإمتحان في السابعة و النصف"
            ],
            [
                "no" => "10",
                "soal" => "",
                "pilihan" => [
                    "الشبكة الدولية",
                    "السفن",
                    "الطائرات",
                    "الحافلة",
                ],
                "jawaban" => "الشبكة الدولية"
            ],
            [
                "no" => "11",
                "soal" => "",
                "pilihan" => [
                    "النظافة",
                    "النوم مبكرا",
                    "الوضوء",
                    "الاغتسال بعد النوم",
                ],
                "jawaban" => "النظافة"
            ],
            [
                "no" => "12",
                "soal" => "",
                "pilihan" => [
                    "لأن القرد نظر إليهم",
                    "لأن القرد في رقبته سلسلة",
                    "لأن القرد كان يرقص",
                    "لأن القرد أخذ العصا",
                ],
                "jawaban" => "لأن القرد في رقبته سلسلة"
            ],
            [
                "no" => "13",
                "soal" => "",
                "pilihan" => [
                    "أن الله يحبّ المؤمن الضعيف أكثر من القويّ",
                    "أن الله يحبّ المؤمن القوي أكثر من الضعيف",
                    "المؤمن الضعيف مثل المؤمن القويّ",
                    "أن الله يحبّ المؤمن",
                ],
                "jawaban" => "أن الله يحبّ المؤمن القوي أكثر من الضعيف"
            ],
            [
                "no" => "14",
                "soal" => "",
                "pilihan" => [
                    "طبيب",
                    "مريض",
                    "ممرض",
                    "صيدلي",
                ],
                "jawaban" => "طبيب"
            ],
            [
                "no" => "15",
                "soal" => "",
                "pilihan" => [
                    "طبيب",
                    "طالب",
                    "دكتور",
                    "مريض",
                ],
                "jawaban" => "دكتور"
            ],
            [
                "no" => "16",
                "soal" => "",
                "pilihan" => [
                    "اشتري الحاسوب",
                    "طلب مبلغا كبيرا من المال",
                    "لم يشتر الحاسوب",
                    "عنده مبلغ كبير",
                ],
                "jawaban" => "لم يشتر الحاسوب"
            ],
            [
                "no" => "17",
                "soal" => "",
                "pilihan" => [
                    "الطعام مفيد",
                    "العملُ مهمٌّ",
                    "المالُ فيه خير",
                    "اتّباع بالأنبياء مهم",
                ],
                "jawaban" => "العملُ مهمٌّ"
            ],
            [
                "no" => "18",
                "soal" => "",
                "pilihan" => [
                    "ليلة التي خير من ألف شهر",
                    "شهر رمضان",
                    "نزول القران",
                    "ليلة القدر",
                ],
                "jawaban" => "شهر رمضان"
            ],
            [
                "no" => "19",
                "soal" => "",
                "pilihan" => [
                    "الحادية عشرة",
                    "الحادية عشرة والنصف",
                    "الثانية عشرة والنصف",
                    "الثانية عشرة إلا النصف",
                ],
                "jawaban" => "الثانية عشرة والنصف"
            ],
            [
                "no" => "20",
                "soal" => "",
                "pilihan" => [
                    "خمسين مسافرا",
                    "ستين مسافرا",
                    "خمسة و عشرين مسافرا",
                    "عشرين مسافرا",
                ],
                "jawaban" => "خمسين مسافرا"
            ],
            [
                "no" => "21",
                "soal" => "",
                "pilihan" => [
                    "الطلاب سوف يواجهون الامتحان",
                    "نصيحة المدرس لطلابه قبل الامتحان",
                    "الطلاب يدرسون بجهد",
                    "المدرس سوف يواجه الامتحان",
                ],
                "jawaban" => "نصيحة المدرس لطلابه قبل الامتحان"
            ],
            [
                "no" => "22",
                "soal" => "",
                "pilihan" => [
                    "السادسة",
                    "الثامنة",
                    "التاّسعة",
                    "السابعة",
                ],
                "jawaban" => "السابعة"
            ],
            [
                "no" => "23",
                "soal" => "",
                "pilihan" => [
                    "المدينة المنوّرة",
                    "جدّة",
                    "مكّة المكرمة",
                    "المنزل",
                ],
                "jawaban" => "مكّة المكرمة"
            ],
            [
                "no" => "24",
                "soal" => "",
                "pilihan" => [
                    "عبد الرحمن و أبوه",
                    "أبو عبد الرحمن",
                    "عبد الرحمن",
                    "أم عبد الرّحمن",
                ],
                "jawaban" => "أبو عبد الرحمن"
            ],
            [
                "no" => "25",
                "soal" => "",
                "pilihan" => [
                    "في المطار",
                    "في مكان الاستئجار",
                    "في جاكرتا",
                    "في البيت",
                ],
                "jawaban" => "في مكان الاستئجار"
            ],[
                "no" => "26",
                "soal" => "",
                "pilihan" => [
                    "يعمل الآن طبيبا",
                    "يعمل مهندسا",
                    "لا يعمل",
                    "يعمل مدرسا",
                ],
                "jawaban" => "لا يعمل"
            ],
            [
                "no" => "27",
                "soal" => "",
                "pilihan" => [
                    "أربع و عشرون سنةً",
                    "ستة وعشرون سنةً",
                    "خمس	و عشرون سنةً",
                    "سبعة و عشرون سنةً",
                ],
                "jawaban" => "ستة وعشرون سنةً"
            ],
            [
                "no" => "28",
                "soal" => "",
                "pilihan" => [
                    "في السوق",
                    "في المطعم",
                    "في الفصل",
                    "في المكتبة",
                ],
                "jawaban" => "في المكتبة"
            ],
            [
                "no" => "29",
                "soal" => "",
                "pilihan" => [
                    "دول الشرق",
                    "دول الشرق الأوسط",
                    "الدول النامية",
                    "الدول الغربية",
                ],
                "jawaban" => "الدول النامية"
            ],
            [
                "no" => "30",
                "soal" => "",
                "pilihan" => [
                    "في الساعة السادسة",
                    "في الساعة الثامنة",
                    "في الساعة السابعة",
                    "في الساعة التاسعة",
                ],
                "jawaban" => "في الساعة الثامنة"
            ],
            [
                "no" => "31",
                "soal" => "",
                "pilihan" => [
                    "في المطعم",
                    "في الفصل",
                    "في السوق",
                    "في المستشفى",
                ],
                "jawaban" => "في المطعم"
            ],
            [
                "no" => "32",
                "soal" => "",
                "pilihan" => [
                    "هو مريض",
                    "يصلي الصبح",
                    "لا يعرف الملعب الرياضي",
                    "سيزور أحد أصدقائه",
                ],
                "jawaban" => "سيزور أحد أصدقائه"
            ],
            [
                "no" => "33",
                "soal" => "",
                "pilihan" => [
                    "ثلاث سنوات",
                    "خمس سنوات",
                    "سنتين",
                    "أربع  سنوات",
                ],
                "jawaban" => "ثلاث سنوات"
            ],
            [
                "no" => "34",
                "soal" => "",
                "pilihan" => [
                    "عمل أبيه",
                    "عمل أخيه",
                    "عمل جده",
                    "اختيار المهنة",
                ],
                "jawaban" => "اختيار المهنة"
            ],
            [
                "no" => "35",
                "soal" => "",
                "pilihan" => [
                    "طبيب",
                    "طياّر",
                    "مهندس",
                    "مدرّس",
                ],
                "jawaban" => "طبيب"
            ],
            [
                "no" => "36",
                "soal" => "",
                "pilihan" => [
                    "مهندسا",
                    "مدرّسا",
                    "طياّرا",
                    "طبيبا",
                ],
                "jawaban" => "مدرّسا"
            ],
            [
                "no" => "37",
                "soal" => "",
                "pilihan" => [
                    "الطّبّ",
                    "التّعليم",
                    "الطّيران",
                    "الهندسة",
                ],
                "jawaban" => "الطّيران"
            ],
            [
                "no" => "38",
                "soal" => "",
                "pilihan" => [
                    "رجل وزوجته",
                    "امرأة وابنتها",
                    "أمّ وابنتها",
                    "امرأة وأختها",
                ],
                "jawaban" => "أمّ وابنتها"
            ],
            [
                "no" => "39",
                "soal" => "",
                "pilihan" => [
                    "وضع الماء في اللبن",
                    "وضع اللبن في الماء",
                    "بيع اللبن في السوق",
                    "بيع اللبن في بيت عمر",
                ],
                "jawaban" => "وضع الماء في اللبن"
            ],
            [
                "no" => "40",
                "soal" => "",
                "pilihan" => [
                    "الله",
                    "الابنة",
                    "الأمّ",
                    "الأخت",
                ],
                "jawaban" => "الابنة"
            ],
            [
                "no" => "41",
                "soal" => "",
                "pilihan" => [
                    "زوج المرأة",
                    "الأب",
                    "عمر",
                    "الله",
                ],
                "jawaban" => "عمر"
            ],
            [
                "no" => "42",
                "soal" => "",
                "pilihan" => [
                    "الابنة",
                    "الأمّ",
                    "عمر",
                    "لا أحد",
                ],
                "jawaban" => "لا أحد"
            ],
            [
                "no" => "43",
                "soal" => "",
                "pilihan" => [
                    "حياة الناس",
                    "فوائد السفر",
                    "بلاد العالم",
                    "السفارة",
                ],
                "jawaban" => "فوائد السفر"
            ],
            [
                "no" => "44",
                "soal" => "",
                "pilihan" => [
                    "أربع قارات",
                    "ست قارات",
                    "خمس قارات",
                    "قارات كثيرة",
                ],
                "jawaban" => "خمس قارات"
            ],
            [
                "no" => "45",
                "soal" => "",
                "pilihan" => [
                    "السفر",
                    "الأمم الأخرى",
                    "الإستماع",
                    "القراءة",
                ],
                "jawaban" => "السفر"
            ],
            [
                "no" => "46",
                "soal" => "",
                "pilihan" => [
                    "في المطار",
                    "في لندن",
                    "في بلده",
                    "في الطائرة",
                ],
                "jawaban" => "في لندن"
            ],
            [
                "no" => "47",
                "soal" => "",
                "pilihan" => [
                    "هو في استقبال صديقه",
                    "ليذهب إلى المستشفى",
                    "للعمل",
                    "للتَنَزُّه",
                ],
                "jawaban" => "للعمل"
            ],
            [
                "no" => "48",
                "soal" => "",
                "pilihan" => [
                    "هو مشغول في المكتب",
                    "هو لا يريد السفر",
                    "ستتأخر طائرته",
                    "هو مريض",
                ],
                "jawaban" => "ستتأخر طائرته"
            ],
            [
                "no" => "49",
                "soal" => "",
                "pilihan" => [
                    "للسفر إلى لندن",
                    "لاستقبال صديقه",
                    "ليأخذ تذكرة الطائرة",
                    "لطلب العمل",
                ],
                "jawaban" => "لاستقبال صديقه"
            ],
            [
                "no" => "50",
                "soal" => "",
                "pilihan" => [
                    "صباح الغد",
                    "مساء اليوم",
                    "بعد الظهر",
                    "هذه الليلة",
                ],
                "jawaban" => "صباح الغد"
            ],
        ];

        return $data;
    }

    public function get_soal_tarakibv2(){
        $data = [
            [
                "no" => "1",
                "soal" => 'اشترى أحمد سبعة ...',
                "pilihan" => [
                    "كتبٍ",
                    "كتابا",
                    "كتابٍ",
                    "كتابٌ"
                ],
                "jawaban" => "كتبٍ",
            ],
            [
                "no" => "2",
                "soal" => 'الإتحاد أساس النجاح. الإتحاد في هذه الجملة تكون ؟',
                "pilihan" => [
                    "فاعل",
                    "نائب الفاعل",
                    "مبتدأ",
                    "خبر"
                ],
                "jawaban" => "مبتدأ",
            ],
            [
                "no" => "3",
                "soal" => 'نشأت اللغة العربية في جزيرة العرب قبل الإسلام.إعراب  "الإسلام" في هذه الجملة؟',
                "pilihan" => [
                    "مرفوع",
                    "منصوب",
                    "مجرور",
                    "مجزوم"
                ],
                "jawaban" => "مجرور",
            ],
            [
                "no" => "4",
                "soal" => 'كان في المدرسة أستاذ مَشْهُوْرٌ. اسم كان في هذه الجملة ؟',
                "pilihan" => [
                    "كان",
                    "في المدرسة",
                    "المدرس",
                    "أستاذ"
                ],
                "jawaban" => "أستاذ"
            ],
            [
                "no" => "5",
                "soal" => 'لا شكّ أن اللغة العربية ..... في ديننا للمسلمين والمسلمات.',
                "pilihan" => [
                    "لغةً مهمةً",
                    "لغةٍ مهمةٍ",
                    "لغةَ مهمةٍ",
                    "لغةٌ مهمةٌ"
                ],
                "jawaban" => "لغةٌ مهمةٌ"
            ],
            [
                "no" => "6",
                "soal" => 'أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني ........؟',
                "pilihan" => [
                    "جديدا",
                    "جديدٍ",
                    "جديدةً",
                    "جديدةٍ"
                ],
                "jawaban" => "جديدةً",
            ],
            [
                "no" => "7",
                "soal" => '........ مشكلة الأفراد في مواجهة الحياة',
                "pilihan" => [
                    "تختلف",
                    "يختلف",
                    "أختلف",
                    "نختلف"
                ],
                "jawaban" => "تختلف",
            ],
            [
                "no" => "8",
                "soal" => 'صاد الرجل الأسماك الكثيرة هذه الليلة. کلمة <b>الكثيرة</b> فی الجملة السابقة؟',
                "pilihan" => [
                    "مضاف إلیه",
                    "مفعول",
                    "توكيد",
                    "نعت"
                ],
                "jawaban" => "نعت"
            ],
            [
                "no" => "9",
                "soal" => 'لا أصدق بما قاله عدنان عن هذا الخبر. "ما" فی الجملة السابقة؟',
                "pilihan" => [
                    "تعجبیة",
                    "موصولة",
                    "استفهامیة",
                    "نافیة"
                ],
                "jawaban" => "موصولة",
            ],
            [
                "no" => "10",
                "soal" => 'قال تعالی: (قال رب إنی وهن العظم منی و اشتعل الرأس شیبا. کلمة (شیبا) ؟',
                "pilihan" => [
                    "منصوب",
                    "مرفوع",
                    "مجرور",
                    "مجزوم"
                ],
                "jawaban" => "منصوب",
            ],
            [
                "no" => "11",
                "soal" => 'قال تعالی: ( إن الإنسان خلق هلوعا. کلمة (هلوعا) هي؟',
                "pilihan" => [
                    "مفعول به",
                    "حال",
                    "اسم إن",
                    "تمییز"
                ],
                "jawaban" => "حال",
            ],
            [
                "no" => "12",
                "soal" => 'مرحلة الشباب أهم <u>مرحلة</u> في حياة الإنسان، وأغلى <u>ثروة</u> عند الأمة. ما الإعراب من كلمة التي تحتها خط؟',
                "pilihan" => [
                    "مرفوع",
                    "منصوب",
                    "مجزوم",
                    "مجرور"
                ],
                "jawaban" => "منصوب",
            ],
            [
                "no" => "13",
                "soal" => 'بین هذه الجمل جملة صحیحة هي؟',
                "pilihan" => [
                    "حاولت فاطمة أن تنهي كتابة الرسالة هذه السنة",
                    "حاول فاطمة أن تنهي كتابة الرسالة هذه السنة",
                    "حاولتا فاطمة أن تنهي كتابة الرسالة هذه السنة",
                    "حاولت فاطمة أن ينهي كتابة الرسالة هذه السنة"
                ],
                "jawaban" => "حاولت فاطمة أن تنهي كتابة الرسالة هذه السنة",
            ],
            [
                "no" => "14",
                "soal" => 'الموظفان يعملان في شريكة الطباعة معا. الموظفان في هذه الجملة؟',
                "pilihan" => [
                    "مبتدأ مرفوع بالألف",
                    "مبتدأ مرفوع بالنون",
                    "خبر مرفوع بالألف",
                    "خبر مرفوع  بالنون"
                ],
                "jawaban" => "مبتدأ مرفوع بالألف",
            ],
            [
                "no" => "15",
                "soal" => 'قال: <u>لا تُظلمْ</u> الناس فتندم. الكلمة التي تحتها خط هي؟',
                "pilihan" => [
                    "فعل ماض",
                    "فعل الأمر",
                    "الفعل الناهي",
                    "اسم فعل"
                ],
                "jawaban" => "الفعل الناهي",
            ],
            [
                "no" => "16",
                "soal" => 'هذه الجامعة مناسبة لمن يريدون أن يعمقوا علوما طبية. كلمة مناسبة؟',
                "pilihan" => [
                    "خبر",
                    "مبتدأ",
                    "نعت",
                    "موصوف"
                ],
                "jawaban" => "خبر",
            ],
            [
                "no" => "17",
                "soal" => '...... الأم الدجاجة المشوية في الصباح لأنني أحب بهذا الطبخ. ',
                "pilihan" => [
                    "طبخت",
                    "طبخ",
                    "طبختا",
                    "طبخوا"
                ],
                "jawaban" => "طبخت",
            ],
            [
                "no" => "18",
                "soal" => 'الجد والجدة  ..... في سعادة مع أولادهما و أحفادهما. ',
                "pilihan" => [
                    "يعيشان",
                    "يعيش",
                    "تعيش ",
                    "تعيشان "
                ],
                "jawaban" => "يعيشان",
            ],
            [
                "no" => "19",
                "soal" => '...... الأساتيذ الطلاب والطالبات أن يراجعوا الدروس لمقابلة الاختبار الآخر في هذه المدرسة. ',
                "pilihan" => [
                    "يأمرون",
                    "يأمر",
                    "تأمرون",
                    "تأمر"
                ],
                "jawaban" => "يأمر",
            ],
            [
                "no" => "20",
                "soal" => 'كثير من الناس ......  بذكري مولدي النبي صلى الله عليه وسلم ',
                "pilihan" => [
                    "يفكرون",
                    "يسمعون",
                    "ينظرون",
                    "يحتفلون"
                ],
                "jawaban" => "يحتفلون"
            ],
            [
                "no" => "21",
                "soal" => 'يريد صالح أن يذهب إلى مصر في الأسبوع القادم.  القادم في هذه الجملة تعني؟ ',
                "pilihan" => [
                    "الماضي",
                    "الآتي",
                    "أمس",
                    "الآن"
                ],
                "jawaban" => "الآتي",
            ],
            [
                "no" => "22",
                "soal" => 'أصبح لاعب كرة القدم بسبب صناعة هدف ......',
                "pilihan" => [
                    "رائعٍ",
                    "رائعٌ",
                    "رائعاً",
                    "رائعين"
                ],
                "jawaban" => "رائعٍ",
            ],
            [
                "no" => "23",
                "soal" => 'أن تحفظ العالم – يجب علينا – حولنا – مهم لحياة الناس – لأن حفظ العالم. ',
                "pilihan" => [
                    "يجب علينا حولنا أن نحفظ العالم لأن حفظ العالم مهم لحياة الناس",
                    "أن نحفظ العالم حولنا مهم لحياة الناس لأن حفظ العالم يجب علينا",
                    "يجب علينا أن نحفظ العالم حولنا لأن حفظ العالم مهم لحياة الناس",
                    "مهم لحياة الناس أن نحفظ العالم لأن حفظ العالم حولنا يجب علينا"
                ],
                "jawaban" => "يجب علينا أن نحفظ العالم حولنا لأن حفظ العالم مهم لحياة الناس",
            ],
            [
                "no" => "24",
                "soal" => ' ليست – الشهادة – الدراسة – لنيل– أغراض – إن- فحسب <br>الترتيب الصحيح مِن الكَلِماتِ السَابِقَةِ هُوَ.......',
                "pilihan" => [
                    "ليست لنيل الشهادة إن أغراض الدراسة فحسب",
                    "إن فحسب أغراض الدراسة ليست لنيل الشهادة",
                    "إن أغراض الدراسة ليست لنيل الشهادة فحسب",
                    "إن أغراض الدراسة لنيل الشهادة ليست فحسب "
                ],
                "jawaban" => "إن أغراض الدراسة ليست لنيل الشهادة فحسب",
            ],
            [
                "no" => "25",
                "soal" => 'تجتهد – إن – في الإمتحان – تنجح  <br>الترتيب الصحيح من الكلمات السابقة هو....... ',
                "pilihan" => [
                    "تجتهد في الامتحان إن تنجح ",
                    "إن  تنجح تجتهد في الامتحان",
                    "إن تجتهد تنجح في الامتحان",
                    "إن تنجح  في الإمتحان تجتهد"
                ],
                "jawaban" => "إن تجتهد تنجح في الامتحان",
            ],
            [
                "no" => "26",
                "soal" => ' يقاس تقدم الدول - اليوم - بالنظافة، فإذا كانت الدولة وسكانها يهتمون بالنظافة، فهي دولة متحضرة، وإذا كانت الدولة وسكانها لا يهتمون بالنظافة، فهي دولة متخلفة. أين الفاعل في هذه العبارة؟',
                "pilihan" => [
                    "تقدم الدول",
                    "بالنظافة",
                    "اليوم",
                    "وسكانها"
                ],
                "jawaban" => "تقدم الدول",
            ],
            [
                "no" => "27",
                "soal" => 'لن ترجع الأيام التي مضت. ترجع في هذه الجملة؟',
                "pilihan" => [
                    "منصوب بالفتحة",
                    "منصوب بالألف",
                    "منصوب بالكسرة",
                    "منصوب بحذف حرف العلة"
                ],
                "jawaban" => "منصوب بالفتحة",
            ],
            [
                "no" => "28",
                "soal" => 'الموضوع الذي قدمه الدكتور في هذه المحاضرة مناسب بحال الناس في هذا العصر. الكلمة التي تحتها خط تعني؟',
                "pilihan" => [
                    "متجانس",
                    "لائق",
                    "مفيد",
                    "منخفض"
                ],
                "jawaban" => "لائق",
            ],
            [
                "no" => "29",
                "soal" => ' لا يوافق أكثر الحاضرين برأي رئيس القرية عن أمور مجيئ الضيوم من خارج البلاد لاحتفال يوم استقلال اندونيسي. هذه العبارة تعني؟',
                "pilihan" => [
                    "لا يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                    "يوجد الضيوم من خارج البلاد في يوم الاستقلال",
                    "يوجد بعض الضيوم من خارج البلاد  في يوم الاستقلال",
                    "لا يوجد يوم الاستقلال "
                ],
                "jawaban" => "لا يوجد الضيوم من خارج البلاد في يوم الاستقلال",
            ],
            [
                "no" => "30",
                "soal" => '<u>اقترح</u> أحد السكان في هذه القرية لصناعة الجسر بين قريتين لتسهيل المرور بينهما. ماذا نقصد  الكلمة التي تحتها خد؟',
                "pilihan" => [
                    "قدم رأيا",
                    "قدم جسرا",
                    "قدم مالا",
                    "قدم سكان "
                ],
                "jawaban" => "قدم رأيا",
            ],
            [
                "no" => "31",
                "soal" => '<u>كانوا</u> الإنسان <u>في</u> هذا العصر <u>لا يهتمون</u> <u>بالتربية</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                "pilihan" => [
                    "كانوا",
                    "في",
                    "لا يهتمون",
                    "بالتربية"
                ],
                "jawaban" => "كانوا",
            ],
            [
                "no" => "32",
                "soal" => '<u>يبني</u> <u>المهندس</u> <u>هذا البناء</u> العالي بعشرة <u>يوم</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                "pilihan" => [
                    "يبني",
                    "هذا البناء",
                    "يوم",
                    "المهندس"
                ],
                "jawaban" => "يوم",
            ],
            [
                "no" => "33",
                "soal" => '<u>تفحص</u> الطبيبة <u>المريض</u> في <u>هذه</u> المستشفي  <u>بكل فرح</u> وسرور. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                "pilihan" => [
                    "تفحص",
                    "المريض",
                    "هذه",
                    "بكل فرح"
                ],
                "jawaban" => "هذه",
            ],
            [
                "no" => "34",
                "soal" => 'كان <u>المدافع</u> في هذه المباراة <u>يرفسون</u> الكرة بشدة حتى <u>تحصل</u> على <u>الهدف</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟ ',
                "pilihan" => [
                    "المدافع",
                    "يرفسون",
                    "تحصل",
                    "الهدف"
                ],
                "jawaban" => "يرفسون",
            ],
            [
                "no" => "35",
                "soal" => '<u>يزور</u> الطلاب والطالبات <u>المتاحف</u> <u>المتنوعة</u> لزيادة <u>المعلوماتُ</u> .  ما هي الكلمة الخاطئة من هذه الجملة ؟',
                "pilihan" => [
                    "يزور",
                    "المتاحف",
                    "المتنوعة",
                    "المعلوماتُ"
                ],
                "jawaban" => "المعلوماتُ"
            ],
            [
                "no" => "36",
                "soal" => '<u>يستمعون</u> <u>الطلاب</u> محاضرة عميد <u>الجامعة</u> في الجامعة <u>الإسلامية</u>. ما هي الكلمة الخاطئة من هذه الجملة؟',
                "pilihan" => [
                    "يستمعون",
                    "الطلاب",
                    "الجامعة",
                    "الإسلامية"
                ],
                "jawaban" => "يستمعون",
            ],
            [
                "no" => "37",
                "soal" => '<u>مشكلة الأسرة</u> <u>يؤدي</u> إلى نجاح <u>أولادهم</u> في <u>المدرسة</u>. ما هي الكلمة الخاطئة من هذه الجملة ؟',
                "pilihan" => [
                    "مشكلة الأسرة",
                    "يؤدي",
                    "أولادهم",
                    "المدرسة"
                ],
                "jawaban" => "يؤدي",
            ],
            [
                "no" => "38",
                "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                "pilihan" => [
                    "تبحر هذا الرجل في علم النحو والصرف والبلاغة",
                    "تبحرت هذا الرجل في علم النحو والصرف والبلاغة",
                    "تبحروا هذا الرجل في علم النحو والصرف والبلاغة",
                    "تبحرا هذا الرجل في علم النحو والصرف والبلاغة"
                ],
                "jawaban" => "تبحر هذا الرجل في علم النحو والصرف والبلاغة",
            ],
            [
                "no" => "39",
                "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                "pilihan" => [
                    "ليس للمسلمين عدوٌّ ",
                    "ليس للمسلمين عدوًّا",
                    "ليس للمسلمين عدوٍّ",
                    "ليس للمسلمين عدوون"
                ],
                "jawaban" => "ليس للمسلمين عدوٌّ ",
            ],
            [
                "no" => "40",
                "soal" => 'أين الجملة الصحيحة من هذه الخيارات ؟',
                "pilihan" => [
                    "الطلاب لم يرمو الزبالة في أي مكان",
                    "الطلاب لم يرمون الزبالة في أي مكان",
                    "الطلاب لم يرم الزبالة في أي مكان",
                    "الطلاب لم يرمي الزبالة في أي مكان"
                ],
                "jawaban" => "الطلاب لم يرمو الزبالة في أي مكان",
            ],
        ];

        return $data;
    }

    public function get_soal_qiroahv2(){
        $data = [
            [
                "no" => "1",
                "soal" => 'عما تتحدث الفقرة السابقة؟',
                "pilihan" => [
                    "اللغة العربية ",
                    "اللغة العربية الفصيحة وآثرها",
                    "الجزيرة العربية ",
                    "الدولة العربية ",
                ],
                "jawaban" => "اللغة العربية الفصيحة وآثرها",
            ],
            [
                "no" => "2",
                "soal" => 'ما المرادف من كلمة "نَشَأَتْ " من تلك الفقرة ؟',
                "pilihan" => [
                    "صارت",
                    "ارتقت",
                    "كبرت",
                    "أصبحت",
                ],
                "jawaban" => "ارتقت",
            ],
            [
                "no" => "3",
                "soal" => 'متي نشأت اللغة العربية ؟',
                "pilihan" => [
                    "بعد الاسلام ",
                    "قبل الاسملام ",
                    "في عصر الخلافة ",
                    "في عصر الحديث ",
                ],
                "jawaban" => "قبل الاسملام ",
            ],
            [
                "no" => "4",
                "soal" => 'كل هذه العبارة مخطيئة. إلا ؟',
                "pilihan" => [
                    "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة",
                    "أعطى القرآن الكريم بعض الألفاظ العربية الجديدة معاني جديدة",
                    "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني صحيحة",
                    "أعطى القرآن الكريم بعض الألفاظ العربية الصحيحة معاني جديدة",
                ],
                "jawaban" => "أعطى القرآن الكريم بعض الألفاظ العربية القديمة معاني جديدة",
            ],
            [
                "no" => "5",
                "soal" => 'ما سبب نشأة علوم اللغة العربية ؟',
                "pilihan" => [
                    "الحديث ",
                    "الفقه",
                    "القرآن",
                    "الشعب ",
                ],
                "jawaban" => "القرآن",
            ],
            [
                "no" => "6",
                "soal" => 'أین یوسف الآن؟',
                "pilihan" => [
                    "فی کوریا",
                    "فی مالیزیا",
                    "فی الیابان",
                    "فی الریاض",
                ],
                "jawaban" => "فی مالیزیا",
            ],
            [
                "no" => "7",
                "soal" => 'متی سیحضر یوسف إلی الریاض؟',
                "pilihan" => [
                    "‌فی رمضان",
                    "‌فی شعبان",
                    "‌فی شوال",
                    "‌قبل رمضان",
                ],
                "jawaban" => "‌فی شوال",
            ],
            [
                "no" => "8",
                "soal" => 'ما المرادف من كلمة "المكتب" في تلك الفقرة؟',
                "pilihan" => [
                    "‌المكتبة",
                    "‌المدرسة",
                    "‌الديوان",
                    "‌الفصل",
                ],
                "jawaban" => "‌الديوان",
            ],
            [
                "no" => "9",
                "soal" => 'الفكرة الرئيسة للفقرة السابقة هى :',
                "pilihan" => [
                    "عدد سكان الصين ألف مليون نسمة.",
                    "تحديد النسل يكون عن طريق تحديد طفل واحد للأسرة.",
                    "زيادة السكان من أهم مشكلات معظم دول العالم.",
                    "القانون يعاقب من لايطيع قانون تحديد النسل.",
                ],
                "jawaban" => "زيادة السكان من أهم مشكلات معظم دول العالم.",
            ],
            [
                "no" => "10",
                "soal" => 'كيف حددت الصين النسل :',
                "pilihan" => [
                    "طفل واحد لكل أسرة.",
                    "طفلين للأسرة.",
                    "طفلين للأسرتين.",
                    "ثلاثة أطفال للأسرة.",
                ],
                "jawaban" => "طفل واحد لكل أسرة.",
            ],
            [
                "no" => "11",
                "soal" => 'أدى تزايد السكان إلى :',
                "pilihan" => [
                    "مشكلة اقتصادية",
                    "مشكلات اجتماعية",
                    "مشكلات سياسية",
                    "مشكلات اقتصادية واجتماعية",
                ],
                "jawaban" => "مشكلات اقتصادية واجتماعية",
            ],
            [
                "no" => "12",
                "soal" => 'ولكن <u>الشعب</u> <u>الصينى</u> <u>مطيع</u> <u>للأوامر</u> ولم تشذ عن هذا القانون إلا حالا تحددها الأطباء مشكلة اقتصادية. أين خبر لكنّ ؟',
                "pilihan" => [
                    "للأوامر",
                    "الشعب",
                    "الصيني",
                    "مطيع",
                ],
                "jawaban" => "مطيع",
            ],
            [
                "no" => "13",
                "soal" => 'ما الموضوع المناسب لهذا النص ؟',
                "pilihan" => [
                    "مرحلة الشباب",
                    "مرحلة الرجولة",
                    "حياة الشباب",
                    "الحياة البشرية المتعددة ",
                ],
                "jawaban" => "مرحلة الشباب",
            ],
            [
                "no" => "14",
                "soal" => ' ما المضاد من الكلمة " الشباب " حسب النص ؟',
                "pilihan" => [
                    "الرجال",
                    "الأولاد",
                    "الشابة",
                    "الشيوخ",
                ],
                "jawaban" => "الشيوخ",
            ],
            [
                "no" => "15",
                "soal" => 'كل هذه العبارات غير الصحيحة. إلا ؟',
                "pilihan" => [
                    "مرحلة الشباب ليست من  أهم مرحلة في حياة الإنسان",
                    "مرحلة الشباب هي مرحلة التنزه ",
                    "لا تحتاج الأمة إلى الشاب القوي الجاد",
                    "والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره",
                ],
                "jawaban" => "والإنسان الذي لا يعطي في شبابه، قلما يعطي في بقية عمره",
            ],
            [
                "no" => "16",
                "soal" => 'ما المرادف من كلمة " الثروة" في النص ؟',
                "pilihan" => [
                    "الغني ",
                    "الفقر",
                    "المال",
                    "النقود",
                ],
                "jawaban" => "الغني ",
            ],
            [
                "no" => "17",
                "soal" => 'ما هو الذي يحتاجه الأمة من الشباب ؟',
                "pilihan" => [
                    "تحتاج الأمة إلى الشاب القوي الجاد",
                    "الأمة تحتاج إلي الشباب الغني بالمال",
                    "الامة تحتاج إلي الشباب الكسلان",
                    "الامة تحتاج الي الشباب الغضبان",
                ],
                "jawaban" => "تحتاج الأمة إلى الشاب القوي الجاد",
            ],
            [
                "no" => "18",
                "soal" => 'المرادف من كلمة "العطاء " في النص ؟',
                "pilihan" => [
                    "البخيل",
                    "المتكبر",
                    "الإحسان",
                    "الكسلان",
                ],
                "jawaban" => "الإحسان",
            ],
            [
                "no" => "19",
                "soal" => 'ما معنى "المرحلة" في هذه الفقرة ؟',
                "pilihan" => [
                    "المستوى",
                    "الجامعة",
                    "الترتيب",
                    "الفروق",
                ],
                "jawaban" => "المستوى",
            ],
            [
                "no" => "20",
                "soal" => 'كم نوعا من النظافة حسب النص ؟',
                "pilihan" => [
                    "نظافة جسمية، ونظافة روحية ",
                    "نظافة غرفة، ونظافة بيت",
                    "نظافة خاصة، ونظافة خارجية",
                    "نظافة خاصة، ونظافة عامة",
                ],
                "jawaban" => "نظافة خاصة، ونظافة عامة",
            ],
            [
                "no" => "21",
                "soal" => 'ما الموضوع المناسب لهذا النص ؟',
                "pilihan" => [
                    "نظافة البيئة",
                    "نظافة البيت",
                    "نظافة الجسم",
                    "نظافة الأمة ",
                ],
                "jawaban" => "نظافة الأمة ",
            ],
            [
                "no" => "22",
                "soal" => 'ما المراد بالناظافة الخاصة ؟',
                "pilihan" => [
                    "نظافة جسم الإنسان وثوبه وطعامه وبيئته",
                    "نظافة قلب الانسان و روحه",
                    "نظافة فكر الانسان و حركته ",
                    "نظافة طعام الانسان وشربه",
                ],
                "jawaban" => "نظافة جسم الإنسان وثوبه وطعامه وبيئته",
            ],
            [
                "no" => "23",
                "soal" => 'ما هي الدولة المشهورة في العالم بالنظافة حسب النص ؟',
                "pilihan" => [
                    "ماليزيا وسنغافورة",
                    "مصر و يمان ",
                    "ج.عراق و إيران",
                    "تركي و يابان ",
                ],
                "jawaban" => "ماليزيا وسنغافورة",
            ],
            [
                "no" => "24",
                "soal" => 'ما المراد بالدولة المتحضرة حسب النص ؟',
                "pilihan" => [
                    "الدولة وسكانها يهتمون بالنظافة",
                    "الدولة وسكانها يهتمون بالتقدم",
                    "الدولة وسكانها يهتمون بالمال",
                    "الدولة وسكانها يهتمون بالتربية",
                ],
                "jawaban" => "الدولة وسكانها يهتمون بالنظافة",
            ],
            [
                "no" => "25",
                "soal" => 'ماالمرادف بكلمة " القذارة " في النص ؟',
                "pilihan" => [
                    "النظافة",
                    "الحديثة",
                    "الجديدة",
                    "الوسخة ",
                ],
                "jawaban" => "الوسخة ",
            ],
            [
                "no" => "26",
                "soal" => 'ما العنوان المناسب لهذا الحديث ؟',
                "pilihan" => [
                    "الرجل العطشان",
                    "الرفق بالحيوان",
                    "الكلب العطشان",
                    "البئر فى الطريق",
                ],
                "jawaban" => "الرفق بالحيوان",
            ],
            [
                "no" => "27",
                "soal" => 'ما المرادف من "يلهث" في هذه القراءة ؟',
                "pilihan" => [
                    "ظمئ",
                    "سبع",
                    "حزن",
                    "بكا",
                ],
                "jawaban" => "ظمئ",
            ],
            [
                "no" => "28",
                "soal" => ' كل هذه العبارات غير الصحيحة. إلا ؟',
                "pilihan" => [
                    "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                    "أن فرص التعليم، كانت كثيرة  في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
                    "أن فرص التعليم، كانت قليلة في المستقبل، حيث كان يلتحق بالمدارس طلاب قليلون",
                    "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب كثيرون ",
                ],
                "jawaban" => "أن فرص التعليم، كانت قليلة في الماضي، حيث كان يلتحق بالمدارس طلاب قليلون",
            ],
            [
                "no" => "29",
                "soal" => 'مالفرق بين التعليم في الماضي و التعليم في الحاضر حسب النص ؟',
                "pilihan" => [
                    "التعليم في الحاضر  والتعليم في الماضي خاصة للأغنياء",
                    "التعليم في الحاضر للأغنياء والتعليم في الماضي لجميع الأفراد",
                    "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للمساكين",
                    "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للأغنياء",
                ],
                "jawaban" => "التعليم في الحاضر لجميع الأفراد والتعليم في الماضي خاصة للأغنياء",
            ],
            [
                "no" => "30",
                "soal" => 'كيف كان الطلاب في الماضي حسب النص ؟',
                "pilihan" => [
                    "يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب",
                    "يذهب الطالب إلى مدرسته، أو جامعته بالسيارة",
                    "يستطيع الطالب أن يتعلم، وهو في بيته عن طريق الشبكة الدولية",
                    "كل العبارات صحيحة ",
                ],
                "jawaban" => "يسافرون من بلد إلى بلد، لطلب العلم، وكانوا يواجهون في سفرهم كثيرا من التعب",
            ],
            [
                "no" => "31",
                "soal" => 'كيف كان المعلم في الماضي حسب النص ؟',
                "pilihan" => [
                    "لا يطلب أجرا على عمله",
                    "يطلب أجرا على عمله ",
                    "يستخدمون الأدوات  المتحدثة في التعليم ",
                    "يعلم الطلاب عبر الشبكة الدولية",
                ],
                "jawaban" => "لا يطلب أجرا على عمله",
            ],
            [
                "no" => "32",
                "soal" => 'ما الفكرة الرئيسة في الفقرة السابقة ؟',
                "pilihan" => [
                    "الناس لايعرف هذه النعمة",
                    "إنّ نبيّ الله داوود كان يأكل من عمل يده",
                    "بعض النّاس لا يحبون العمل",
                    "العمل خير في الحياة",
                ],
                "jawaban" => "العمل خير في الحياة",
            ],
            [
                "no" => "33",
                "soal" => 'الجملة المناسبة بالفقرة السابقة ؟',
                "pilihan" => [
                    "ينبغي علينا أن نأكل مما كسبنا",
                    "ينبغي علينا أن نأكل ما أعطانا الجار",
                    "ينبغي علينا أن نأكل مما كسب الأب",
                    "ينبغي علينا أن نسأل الآخر",
                ],
                "jawaban" => "ينبغي علينا أن نأكل مما كسبنا",
            ],
            [
                "no" => "34",
                "soal" => 'أفضل العنوان للفقرات السابقة :',
                "pilihan" => [
                    "نظرة الآباء إلى الأبناء",
                    "نظرة الأبناء إلى الآباء",
                    "اختلاف الرأي بين الآباء والأبناء",
                    "تفكير الآباء المتأخر",
                ],
                "jawaban" => "اختلاف الرأي بين الآباء والأبناء",
            ],
            [
                "no" => "35",
                "soal" => 'خطأ الآباء فى نظرتهم للأبناء .......',
                "pilihan" => [
                    "أنهم يأمرون أولادهم دائما بدون سبب",
                    "أنهم يحسبون جيدا فارقا لسن بينهم",
                    "أنهم ينظرون إلى الأبناء على أنهم كبار",
                    "أنهم لايحبون لأولادهم أن يكونوا مثلهم",
                ],
                "jawaban" => "أنهم ينظرون إلى الأبناء على أنهم كبار",
            ],
            [
                "no" => "36",
                "soal" => 'خطأ الأبناء فى نظرتهم الآباء ...........',
                "pilihan" => [
                    "أنهم نالوا السهولة أن يتّفقوا معهم فى الرأي",
                    ". أن الآباء يفكرون تفكيرا متأخرا",
                    "أنّ الآباء يجب أن يكونوا أكثر صبرا",
                    "أن الآباء يتمنون لهم الخير",
                ],
                "jawaban" => ". أن الآباء يفكرون تفكيرا متأخرا",
            ],
            [
                "no" => "37",
                "soal" => 'التعبير المناسب من هذه القراءة ؟',
                "pilihan" => [
                    "ينبغي على الأبناء أن يطيعوا آبائهم",
                    "ينبغي على الأبناء أن يرحوا آبائهم",
                    "ينبغي على الأبناء أن يستمعوا إلى آبائهم",
                    "ينبغي على الأبناء أن لا يطيعوا آبائهم",
                ],
                "jawaban" => "ينبغي على الأبناء أن يطيعوا آبائهم",
            ],
            [
                "no" => "38",
                "soal" => 'الفكرة الرئيسة في الفقرة السابقة تتحدّث عن ......',
                "pilihan" => [
                    "انتشار الحضارة الإسلاميّة في العالم",
                    "انتشار الإسلام في العالم",
                    "انتشار العلم والثقافة في الصين",
                    "انتشار العلم والثقافة في أوروبا",
                ],
                "jawaban" => "انتشار الحضارة الإسلاميّة في العالم",
            ],
            [
                "no" => "39",
                "soal" => 'أين يقع بلاد السودان ؟',
                "pilihan" => [
                    "في إفريقيا",
                    "في شرق الأوسط",
                    "في الدول الغربي",
                    "في آسيا",
                ],
                "jawaban" => "في إفريقيا",
            ],
            [
                "no" => "40",
                "soal" => 'كم سنة أنشأت تلك الشركة ؟',
                "pilihan" => [
                    "سنة واحدة",
                    "ب.سنتين",
                    "ثلاث سنوات",
                    "أربع سنوات",
                ],
                "jawaban" => "ثلاث سنوات",
            ],
            [
                "no" => "41",
                "soal" => 'وصف الرجل في هذه الفقرة بأنه رجل ؟',
                "pilihan" => [
                    "جميل",
                    "شريف",
                    "حكيم",
                    "لطيف",
                ],
                "jawaban" => "شريف",
            ],
            [
                "no" => "42",
                "soal" => '"من أغنياء المدينة " ؟',
                "pilihan" => [
                    "اسم أصبح",
                    "خبر أصبح",
                    "مبتدأ مؤخر",
                    "بدل",
                ],
                "jawaban" => "خبر أصبح",
            ],
            [
                "no" => "43",
                "soal" => 'ما عمل هذا الرجل قبل أن يكون تاجرا؟',
                "pilihan" => [
                    "الموظف الحكومي",
                    "الموظف الأهلي",
                    "رجال العمل",
                    "مهندس",
                ],
                "jawaban" => "الموظف الحكومي",
            ],
            [
                "no" => "44",
                "soal" => 'حسن طالب مسلم من اندونيسيا، وهي تقع في قارة ؟',
                "pilihan" => [
                    "آسيا",
                    "أفريقا",
                    "أوربا",
                    "أوستراليا",
                ],
                "jawaban" => "آسيا",
            ],
            [
                "no" => "45",
                "soal" => ' يدرس حسن في المرحلة ؟',
                "pilihan" => [
                    "المتوسطة",
                    "الثانوية",
                    "الجامعية",
                    "الإبتدائية",
                ],
                "jawaban" => "الجامعية",
            ],
            [
                "no" => "46",
                "soal" => 'متى حضر حسن الى المدينة المنورة؟',
                "pilihan" => [
                    "قبل ثلاث سنوات",
                    "قبل أشهر",
                    "قبل سنتين",
                    "قبل أربع سنوات",
                ],
                "jawaban" => "قبل ثلاث سنوات",
            ],
            [
                "no" => "47",
                "soal" => 'ماذا تعمل هذه الزّوجة ..؟',
                "pilihan" => [
                    "موظّفة",
                    "مدرّسة",
                    "ممرّضة",
                    "طبيبة",
                ],
                "jawaban" => "طبيبة",
            ],
            [
                "no" => "48",
                "soal" => ' ماذا يعمل هذا الزّوج....؟',
                "pilihan" => [
                    "طبيبا",
                    "طيارا",
                    "مدرسا",
                    "فلاحا ",
                ],
                "jawaban" => "مدرسا",
            ],
            [
                "no" => "49",
                "soal" => 'يعمل الزّوج في ....؟',
                "pilihan" => [
                    "الصبّاح",
                    "المساء",
                    "الصّباح والمساء",
                    "غير معين",
                ],
                "jawaban" => "الصبّاح",
            ],
            [
                "no" => "50",
                "soal" => 'متى تعود الزّوجة إلى البيت  ؟',
                "pilihan" => [
                    "بعد العصر",
                    "بعد الظّهر",
                    "بعد المغرب",
                    "بعد العشاء",
                ],
                "jawaban" => "بعد العصر",
            ],
        ];

        return $data;
    }

}
/* End of file Soal_model.php */
